import { v4 as uuid } from 'uuid';
import { question } from './data';

export const q = `
بصفه عامة يمكن القول أن الاقتصاد هو
1
علم إدارة الموارد الاقتصادية
علم إدارة الأزمات
علم إدارة الموارد الاجتماعية
علم إدارة الموارد الاجتماعية والأزمات
#


يبحث علم الاقتصاد تفسير سلوك الفرد فيما يتعلق باستخدام المواد الاقتصادية بهدف تحقيق
3
الرفاهية الاجتماعية للمجتمع
الاستقرار السياسي
الرفاهية الاقتصادية للمجتمع
الاستقرار الاقتصادي
#

من وحدات القرار الاقتصادي
3
الأسر
الخدمات العامة
المنشآت التجارية
جميع ما سبق

#

يمكن التمييز بين استخدامات للموارد في
2
التجارة
الاستهلاك والإنتاج
التصدير
غير ذلك
#


البيانات الاقتصادية . . . . وذلك لتأثيرها بالبعد الزمني
4
ثابتة
مستقرة
متحركة
ليست ثابتة
#

البيانات الاقتصادية تتأثر ب
1
المعطيات النفسية والاجتماعية
بالمعطيات الاجتماعية
بالمعطيات النفسية
بالمعطيات الداخلية
#

من طبيعة التحليل الاقتصادي
3
بعض العوامل الأخرى ثابتة
بعض العوامل الأخرى متغيرة
بقاء كافة العوامل الأخرى على حالها
كافة العوامل الأخرى متغيرة
#
هو  Model النموذج
2
علاقة بين عوامل مختلفة
ذلك النظام من العلاقات بين مجموعة المتغيرات لبيان ظاهرة معينة
علاقة بين عناصر الإنتاج
علاقات متعددة ومختلفة
#
المتغيرات الداخلية هي
1
التي تتحدد من داخل النموذج
التي تتحدد من خارج النموذج
تلك التي تؤثر في النموذج ولا تتأثر
يتحدد خارج علاقات النموذج
#
المتغيرات الخارجية هي
4
التي تتحدد داخل علاقات النموذج
التي تؤثر بالنموذج وتتأثر به
التي يتحدد من داخل النموذج
تلك التي تؤثر في النموذج ولا تتأثر به
#
السياسة الاقتصادية هي
1
مجموعة الأهداف والأساليب والبرامج التي يلجأ اليها المجتمع بغية معظمة الرفاهية الاقتصادية
مجموعة الوسائل والإجراءات التي يلجأ اليها المجتمع بغية تحقيق الاستقرار السياسي
مجموعة الوسائل التي يلجأ اليها المجتمع بغية تحقيق الاستقرار الاقتصادي
مجموعة الأهداف والأساليب والبرامج التي يلجأ اليها المجتمع بغية معظمة الإنتاج
#
السياسة الزراعية هي
1
ذلك الشطر من السياسة الاقتصادية الذي يجري تطبيقه في القطاع الزراعي من البنيان الاقتصادي القومى
ذلك الشطر من السياسة الاقتصادية الذي يجري تطبيقه في قطاع الخدمات من البنيان الاقتصادي القومى
ذلك الشطر من السياسة الاقتصادية الذي يجري تطبيقه في القطاع الصناعي من البنيان الاقتصادي القومى
ذلك الشطر من السياسة الاقتصادية الذي يجري تطبيقه في المجتمع
#
من أهداف السياسة الزراعية
3
تناقص الدخل المزرعي
ثبات الأحوال الاجتماعية
زيادة الكفاءة الاقتصادية
انخفاض الكفاءة
#
تقاس الكفاءة الاقتصادية ب
1
أسعار وكميات السلع المنتجة منسوبة الي أسعار وكميات الموارد المختلفة
أسعار السلع المنتجة
كميات السلع المنتجة
كميات السلع المنتجة منسوبة الي أسعار السلع المنتجة
#
تعني الكفاءة الاقتصادية القصوى
3
جميع الموارد المستخدمة ليست في أحسن استخدام لها
تناقص الموارد المستخدمة
جميع الموارد المستخدمة في أحسن استخدام لها
كفاءة الموارد المستخدمة

#
الزارعة غالبا ما تتميز ب
1
وجود فائض في العمال الزراعيين
وجود فائض في العمال الصناعيين
عدم وجود فائض في العمال الزراعيين
وجود توازن بين حجم القوي العاملة الواجب وجودها والموجودين فعلا
#
يعتبر متوسط الدخل في الزراعة
4
مساوي لبقية قطاعات الاقتصاد الأخرى
أكبر من مستواه من مثله في بقية قطاعات الاقتصاد الأخرى
لا يقارن ببقية قطاعات الاقتصاد الأخرى
أقل من مستواه من مثله في بقية قطاعات الاقتصاد الأخرى
#
تغير الدخل المزرعي من عام لأخر ناتج عن
4
أسعار المحاصيل الزراعية
التغيرات في العرض والطلب
التغيرات السنوية التي تحدث في الإنتاج نفسه
جميع ما سبق
#
لرفع وتثبيت الدخل المزرعي تتبع السياسة الزراعية وسائل عديدة منها
3
البعد عن الإرشاد الزراعي
عدم تعاون الزراعيين مع بعض
دراسة وتحليل أسعار المحاصيل الزراعية
عدم صرف معونات للمزارعين
#
مثال للأهداف الاجتماعية والسياسية البعيدة الأثر للسياسية الزراعية
1
تطور خدمة المجتمع والخدمة الصحية الريفية
عدم تحسين فرص التعليم
البعد عن الإرشاد الزراعي
عدم صرف معونات للمزارعين

#
من وسائل تحقيق أهداف السياسة الزراعية
1
إنهاء الجهاز السعري القائم
التخطيط السليم
التوجيه السليم
غير ذلك
#
لتحقيق هدف عدالة توزيع الدخل من خلال
2
التنظيم السليم
تعديل الضرائب والإعانات والمنح
إنهاء الجهاز السعري القائم
التوجيه السليم
#
قيام جهاز سعري يحقق كفاءة الإنتاج عن طريق
3
التنظيم السليم
التخطيط السليم
إجراءات التوزيع المباشر
الضبط السليم
#
السياسة الزراعية تستهدف
4
عدالة توزيع الدخل داخل قطاع الزراعة
تحسين الأحوال الاجتماعية
عدم زيادة الكفاءة الاقتصادية
أ، ب معا
#
من إجراءات تحسين الأحوال الاجتماعية
1
تطور وسائل الترفيه
معالجة السياسة الزراعية
تقييد حرية الفرد
زيادة الكفاءة

#
الفرق بين النظرية الاقتصادية والسياسة الاقتصادية أن النظرية الاقتصادية
3
تقدم تفسيرا لتأثيرات الظواهر الاقتصادية
تخدم في المجال الرياضي
تخدم في مجال تفسير الظواهر الاقتصادية
غير ذلك
#
تعد نظرية السياسة الاقتصادية الحرة
2
تجميعا لآراء الاقتصاديين الفرنسيين
تجميعا لآراء الاقتصاديين الأمريكيين
تجميعا لآراء الاقتصاديين الإيطاليين
تجميعا لآراء الاقتصاديين المصريين
#
الاقتصاديين الأمريكيين نادوا ب
1
مبدأ حرية المنافسة في الحياة الاقتصادية
مبدأ حرية المنافسة في الحياة الاجتماعية
مبدأ حرية المنافسة في الحياة الليبرالية
جميع ما سبق
#
يجمع بين نظرية السياسة الاجتماعية ونظرية السياسة الاقتصادية الحكومية
4
مفهوم تعديل الأسعار
مفهوم إعادة توزيع الدخول فقط
مفهوم إعادة توزيع الدخول والأسعار
مفهوم إعادة توزيع الدخول والثروات
#
نظرية السياسة الاجتماعية
2
تستطيع تقديم الدليل علي تحقيق الرفاهية المثلي لأفراد المجتمع
لا تستطيع تقديم الدليل علي تحقيق الرفاهية المثلي لأفراد المجتمع
تستطيع تقديم جانبا من الرفاهية المثلي
لا تستطيع تقديم جانبا من الرفاهية المثلي


#
سياسة النمو الاقتصادي هي
4
سياسات تخفيض أو ترشيد الاستهلاك
سياسات زيادة الإنتاج
سياسات حفز الاستثمار
جميع ما سبق
#
يقصد بالنمو الاقتصادي
3
الزيادة في الدخل الجاري
الزيادة في الدخل القومي الحقيقي
الزيادة في الدخل الفردي الحقيقي
غير ذلك
#
يصاحب التنمية الاقتصادية
1
تغيير بنياني للاقتصاد موضع الاعتبار
تغير بنياني للاقتصاد موضع الاعتبار
تغير في الدخل الجاري
غير ذلك
#
حسب قانون ساي في راي الكلاسيكيين
3
الطلب يحدد العرض 
الطلب ليس له علاقة بالعرض
العرض يحدد الطلب
العرض منفصل عن الطلب
#
وفقا لأراء كينز في التوظيف الكامل فان
1
الطلب هو الذي يحدد العرض
العرض منفصل عن الطلب
العرض هو الذي يحدد الطلب
الطلب ليس له علاقة بالعرض

#
عند كينز هو الذي يتحكم فيEffective Demand الطلب الفعال 
4
الإنتاج
مستويات التوظف
الدخل القومي
جميع ما سبق
#
تعتمد أفكار النيو كلاسيك على
4
تجانس الإنتاج وحده
اختصار عناصر الإنتاج الي العمل ورأس المال
الاهتمام بنظريات توزيع الدخل
جميع ما سبق
#
طبقا للنظرية الكلاسيكية يتحدد سعر الفائدة في السوق
1
بتعادل الطلب على الاستثمار وعرض القروض
بتعادل الطلب على الادخار وعرض النقود
بتعادل قوي الطلب مع قوي العرض
بتعادل الطلب على الاستهلاك وعرض النقود
#
تضخم الطلب يحدث عندما
1
الطلب الكلي أكبر من الإنتاج
الإنتاج أكبر من الطلب الكلي
الطلب الكلي يتساوى مع الإنتاج
الإنتاج أصغر من الطلب الكلي
#
تضخم التكاليف يطلق عليه
1
تضخم البائعين
تضخم المنتجين
تضخم المشترين
التضخم الناشئ عن دفع التكاليف الي أسفل

#
يمكن تتبع آثار مشكلة التضخم علي
3
معدلات زيادة الناتج المحلي
معدلات زيادة الإنتاج
معدلات زيادة الناتج القومي
معدلات زيادة الاستهلاك
#
أول المستفيدين من التضخم هم
2
الشركات الحكومية
الشركات المنتجة الخاصة
الأفراد
غير ذلك
#
من الأثار السلبية للتضخم
3
يزيد من القوة الشرائية للدخل
ليس له علاقة بالدخل
يقلل من القوة الشرائية للدخل
يقلل منالاستثمار
#
ينشأ الأثر السلبي للتضخم أساسا بسبب
1
التفاوت الكبير بين معدلات الزيادة في أسعار السلع المختلفة
تحسن وضع قطاع الأعمال
يحسن مركز أصحاب الثروة
يحسن مركز المدينين
#
من إثر التضخم على توزيع الناتج
3
تدهور مركز أصحاب الثروة من العقارات
تدهور وضع قطاع الأعمال لزيادة اربحيتهم
تحمل أصحاب الثروة النقدية لعبء انخفاض قيمتها الحقيقية
تدهور مركز المدينين

#
نتيجة لمشكلة البطالة يحدث
1
قصور الإنتاج
زيادة الطلب الكلي
زيادة عرض موارد الإنتاج
زيادة الطلب النقدي
#
من أثر البطالة على محور الإنتاج...…
2
زيادة الناتج الحقيقي
حدوث قصورا في عملية التراكم الرأسمالي
عدم حدوث قصورا في عملية التراكم الرأسمالي
عدم حدوث قصورا في تكوين المدخرات
#
من أثر البطالة على محور عرض موارد الإنتاج...…
4
انخفاض معدلات الإنتاجية
انخفاض معدلات الأجور
ثبات معدلات الإنتاجية
زيادة معدلات الأجور
#
أثبت فيليبس أن انخفاض معدلات البطالة يؤدى الى…
1
زيادة معدلات الأجور
انخفاض معدلات الأجور
انخفاض معدلات التضخم
تدهور معدلات الأجور
#
أثبت فيليبس أن العلاقة بين معدلي زيادة الأجور والبطالة بالمملكة المتحدة
1
علاقة عكسية
علاقة تبادلية
علاقة طردية
لا يوجد علاقة
#

من أهداف السياسة الزراعية
1
زيادة وثبات الدخل المزرعى
#

النموذج هو
1
ذلك النظام من العلاقات بين مجموعة المتغيرات لبيان ظاهرة معينه
#
المتغيرات الداخلية هي
1
تلك التي تتحدد من داخل النموذج، أي تؤثر فيه وتتأثر به
#
المتغيرات الخارجية هي
1
تلك التي تؤثر في النموذج ولا تتأثر به بمعنى إنها تتحدد خارج علاقات نموذج
#
الاقتصاد هو
1
علم إدارة الموارد الاقتصادية مشتملة على المورد البشرى كعنصرإنتاج من ناحية وكعنصر مستهدف رفاهيته من ناحية أخرى
#
السياسة الزراعية هي
1
مجموعة الأهداف والأساليب والبرامج والإجراءات التي يلجأالمجتمع إلى طبيقها في القطاع الزراعي بغية معظمة رفاهيته الاقتصادية
#
السياسة الاقتصادية هي
1
مجموعة الأهداف والأساليب والبرامج والوسائل والإجراءات التي يلجأ إليها المجتمع بغية معظمة الرفاهية الاقتصادية لمختلف أفراد ذلك المجتمع
#
تعنى الكفاءة الاقتصادية لقصوى أن
1
جميع الموارد مستخدمة في أحسن استخدام لها وانه يمكن بإحداث تغيير في طريقة استخدامها الحصول على زيادة في الإنتاج
#
سياسة النمو الاقتصادي
1
هي تلك البرامج والإجراءات التي تتخذها الحكومات لزيادة معدل النموالاقتصادي
#
التنمية الاقتصادية
1
هي تحقيق زيادة سريعة تراكمية ودائمة في الدخل الفردي الحقيقي عبر فترة ممتدة من الزمن
#
النمو الاقتصادي
1
الزيادة في الدخل الفردي الحقيقي
#
التوظيف الكامل عند الاقتصاديين الكلاسيك هو
1
حجم العمالة التي يحققها تعادل كل من الطلب على العمل مع عرض العمل في كل سوق على انفراد
#
سياسة توزيع الدخل عند آدم سميث هي
1
جزء من عمليات الجهاز السعري الذي يتحدد أساسا من خلال نظرية تكاليف الإنتاج
#
تشرح النظرية الكينزية في توزيع الدخل
1
عملية توزيع الدخل من خلال القدرة الادخارية لكلا المجموعتين من عناصر الإنتاج المستقبلين للجزء الأكبر من الدخل القومي
#
يعرف التضخم بأنه
1
الارتفاع المستمر في المستوى العام للأسعار

`;

const AgriPolicy = q.split('#').map((q, i): Question => {
    let _answers = q
            .trim()
            .split('\n')
            .filter((a) => a.trim().length > 0),
        questionText = _answers.shift() || 'failed to parse question',
        ans = Number(_answers.shift()?.trim());

    const answers: Answer[] = _answers.map(
        (a, ai): Answer => ({
            id: uuid(),
            text: a,
            correct: ai + 1 === ans,
        })
    );

    return question({ questionText, answers });
});

export default AgriPolicy;
