import { v4 as uuid } from 'uuid';
import { question } from './data';

const q = `

المسار أو المسلك الذي تمر من خلاله السلع والمنتجات الى المستهلك أو المستخدم النهائي هو 


السعر المرتفع للسلعة 
المهام الرئيسية للمصدر في النشاط التصديرية 

المفهوم العام للقنوات التسويقية في النشاط التصديري 
وكلاء التصدير 
# 




من المهام الرئيسية للمصدر في النشاط التصديرية 


عدم دراسة البدائل الممكنة للقنوات التسويقية لمنتجاته 
اختيار القنوات الأكثر ملائمه 
عدم فحص البدائل الممكنة للقنوات التسويقية لمنتجاته 
عدم التعرف على القنوات التسويقية المختلفة 
# 




يجرى تسويق المنتجات في الأسواق الخارجية بطرق غير مباشره ومنها 


تجار الجملة 
بيوت الاستيراد 
وكلاء التصدير 
تراخيص الإنتاج 
# 




يجرى تسويق المنتجات في الأسواق الخارجية بطرق مباشره ومنها 


حقوق الامتياز 
عقود الإدارة 
الوسطاء التجاريون 
تراخيص الإنتاج 
# 




يجرى تسويق المنتجات في الأسواق الخارجية بطرق غير مباشره ومنها 


الموزعون 
شركات الاستيراد 
امتلاك الشركات 
المشترين المصنعين 
# 




كلما كانت دورة البيع للمنتج بطيئة كان المسلك التسويقي 


ليس هناك علاقة 
أبطئ 
أقصر 
أطول 
# 




من العوامل المؤثرة على طول أو قصر القناة التسويقية 


اختيار القنوات الأكثر ملائمه 
دراسة البدائل الممكنة للقنوات التسويقية 
قدرة المنتج على البقاء سليما 
التعرف على القنوات التسويقية المختلفة 
# 




هناك بعض العوامل التي تجعل البيع في الأسواق الخارجية يختلف عن البيع في الأسواق المحلية 


ارتفاع درجة المخاطرة وانخفاض التكاليف التسويقية 
اللغة واحده في كل الأسواق 
عدم اختلاف نظم البيع 
اختلاف الأذواق وأنماط الاستهلاك 
# 




من المهام الرئيسية للمصدر في النشاط التصديرية 


ليس مما سبق 
عدم التعرف على القنوات التسويقية المختلفة 
اختيار القناة الأقل حجما 
فحص ودراسة البدائل الممكنة للقنوات التسويقية 
# 




في نموذج قنوات التسويق النمطي يوجد الموزع وهو بدوره يشتري من المصدر ثم يبيع الموزع الى 


المصدر 
المستهلك النهائي 
عدد محدود من تجار الجملة 

عدد محدود من تجار التجزئة 
# 




في نموذج قنوات التسويق النمطي يوجد تجار التجزئة وهم بدورهم يشت روا من تجار الجملة ثم يبي عوا الى 


المصدر 
المستهلك النهائي 
عدد محدود من تجار الجملة 
عدد محدود من تجار التجزئة 
# 




يجرى تسويق المنتجات في الأسواق الخارجية بطرق مباشره ومنها 


حقوق الامتياز 
تجار الجملة 
عقود الإدارة 
عقود التصنيع 
# 




من العوامل المؤثرة على طول أو قصر القناة التسويقية الخدمات المطلوبة للمنتج، فمثلا وجود خدمات ما بعد البيع بدرجة عالية، كان المسلك التسويقي 


أبطئ 
لا يتأثر 
قصير 
طويل 
# 




من العوامل المؤثرة على طول أو قصر القناة التسويقية المتطلبات والمعاملات الفنية للمنتج، فكلما كانت معقده، كان المسلك التسويقي 


أبطئ 
ليس هناك علاقة 
أقصر 
أطول 

# 




من العوامل المؤثرة على طول أو قصر القناة التسويقية قدره المنتج على البقاء سليما، فكلما كان هناك سرعه تلف للمنتج، كان المسلك التسويقي 


بطئ 
لا يتأثر 
قصير 
طويل 
# 




يتم تسويق المنتجات في الأسواق الخارجية بطرق غير مباشره، وإحدى هذه الطرق هو عباره عن اتفاق بين شركتين تقوم إحداها بتنظيم بعض أو كل أنشطه الشركة الأخرى 


تراخيص الإنتاج 
عقود الإدارة 
حقوق الامتياز 
المشروعات المشتركة 
# 




عقود الإدارة من احدى طرق التسويق للأسواق الخارجية بطريقه غير مباشره بالنسبة للاستثمارات المحددة التي تتطلبها، بانها تحقق عوائد 


ليس مما سبق 
لا يوجد تأثير 
صغيره 
كبيره 
# 




يتم تسويق المنتجات في الأسواق الخارجية بطرق مباشره عن طريق الوسطاء، وإحدى هذه الطرق هو شخص اعتباري أو طبيعي يقوم باسم المصدر، ونيابة عنه بالسعي لتوزيع السلعة في الأسواق الخارجية 


تجار التجزئة 
تجار الجملة 
الوكيل التصديري 
الموزع 
# 




يتم تسويق المنتجات في الأسواق الخارجية بطرق غير مباشره، وإحدى هذه الطرق يكون بموجبها يمكن بقدر من السرعة والسهولة دخول الأسواق الخارجية المستهدفة 


عقود التصنيع 
عقود الإدارة 
تراخيص الإنتاج 
امتلاك الشركات من الخارج 
# 




يتم تسويق المنتجات في الأسواق الخارجية بطرق غير مباشره، وإحدى هذه الطرق تتميز بتغلبها على العقبات الجمركية ومعوقات التصدير الى السوق الخارجي 


عقود التصنيع 
عقود الإدارة 
تراخيص الإنتاج 
امتلاك الشركات من الخارج 
# 




يتم تسويق المنتجات في الأسواق الخارجية بطرق مباشره، وتتميز هذه الطريقة بان يقوم المنتج المصدر بتنفيذ البرنامج التصدير ية الخاص به بالكامل 


عقود الإدارة 
عقود التصنيع 
التصدير المباشر بدون وسطاء 
التصدير المباشر بواسطة الوسطاء 
# 




يتم تسويق المنتجات في الأسواق الخارجية بطرق مباشره عن طريق الوسطاء، وإحدى هذه الطرق فيها تمارس التجارة الخارجية نشاط عامة استيرادا أو تصديرا وقد تقوم بشراء البضائع كعميل مباشر مع المصدر ثم تقوم ببيعها وتوزيعها في الأسواق 


هيئات الشراء الحكومية 
شركات الاستيراد 
تجاره الجملة 
وكلاء التصدير 
# 




يتم تسويق المنتجات في الأسواق الخارجية بطرق مباشره عن طريق الوسطاء، وإحدى هذه الطرق فيها يقومون بالشراء المباشر من المصدر مثل شركات الاستيراد بدلا من الاعتماد على الشراء من الموزعين أو المستوردين أو الوكلاء


المشترين المصنعين 
متاجر التجزئة 
تجار الجملة 
شركات الاستيراد 
# 




يتم تسويق المنتجات في الأسواق الخارجية بطرق غير مباشره، وإحدى هذه الطرق فيها تتم عمليه إنتاج المنتجات التصديريه وذالك بموجب اتفاق منح ترخيص يحصل بموجبه احد طرفي الاتفاق على الخبرة الفنية والتجارية وحق استخدام الماركة وبراءات الاختراع وذالك في مقابل مبلغ أو نسبه معينه يدفعها للطرف الأخر المانح للترخيص 


المشروعات المشتركة 
عقود التصنيع 
تراخيص الإنتاج 
حقوق الامتياز 
# 




يتم تسويق المنتجات في الأسواق الخارجية بطرق مباشره عن طريق الوسطاء، وإحدى هذه الطرق الشركات التي تشتري كميات كبيره وبشكل متكرر من السلع قد يفضلون التعامل مباشره مع المصدر وقد يتم ذالك على أساس تعاقدي أو بدون تعاقد


المشترين المصنعين 
متاجر التجزئة 
عقود التصنيع 
شركات الاستيراد 

# 




من أدوات التمويل السابق للشحن، تحدد الدول التي تقدم هذا النوع مثل دوله المكسيك من التمويل أسعار فائدته بما يتناسب وأسعار الفائدة التي تقدمها الدول الأخرى على مثل هذا النوع من التمويل 


جميع ما سبق 
خطابات الاعتماد المتبادلة 
الصناديق متجددة الموارد 
القروض 
# 




من صور التمويل للصادرات السابق للشحن ويتم استخدامه من خلال بعض الدول مثل ماليزيا والمكسيك لتمويل صادرتها ويتكون من ثلاث أطراف: المنتج الذي يستورد مدخلات، المصدر المباشر ،المستورد الأجنبي 


جميع ما سبق 
خطابات الاعتماد المتبادلة 
الصناديق متجددة الموارد 
القروض 
# 




يتمثل الشكل التقليدي في الخصم التجاري في التمويل الذي يتراوح من ثلاث الى خمس سنوات وهو تمويل 


متوسط الأجل 
ممتد الأجل 
طويل الأجل 
قصير الأجل 
# 




تتضمن عمليه الخصم التجاري قيامه كطرف ثالث بضمان الأوراق المالية )تجاريه وكمبيالات وسندات إذنيه( بدون أيه قيود 


القروض 
بنك المستورد 
المخصم 
المستورد 
# 




يعد خصم الكمبيالات التي يضمنها البنك واحده من اهم أدوات التمويل ......... بعد الشحن 


متوسطة الأجل 
ممتدة الأجل 
طويلة الأجل 
قصيرة الأجل 
# 




من أدوات التمويل أثناء وبعد الشحن، تتمثل في قيام الجهة الممولة بتقديم القروض والتسهيلات الائتمانية الى المستوردين 


الشراء التبادلي 
ائتمان المشتري الأجنبي 
الصفقات المتكافئة 
الخصم التجاري 
# 




وفقا لهذه الأداة تقوم الدولة التي تتمتع بميزه نسبيه وتنافسيه في احدى القطاعات بتشجيع تدفق الاستثمار المحلي والأجنبي الى تلك القطاعات ومن ثم زيادة الصادرات من تلك القطاعات الى الأسواق العالمية 


التمويل الاستثماري للصادرات 
التمويل أثناء وبعد الشحن 
التخصيم 
التمويل قبل الشحن 
# 




من أدوات التمويل الاستثماري للصادرات، تتمثل في قيام المُصدر بالتامين على تحصيل قيمه صادراته عند استحقاق موعد الائتمان الممنوح أثناء عمليه التصدير 


حفظ الصادرات 
A,B
ضمان الصادرات 
تأمين ائتمان للتصدير 
# 




يعد فشل أو رفض المستورد أن يتقيد باي شرط من شروط عقد التصدير إذا كان ذالك المستورد جهة أو مؤسسه حكومية سبق التعامل معها من 


حفظ الصادرات 
ضمان الصادرات 
مخاطر الدولة المستوردة المغطاة 
مخاطر المستورد المغطاة 
# 




نظرا لما يواجهه مديري التصدير بالأسواق العالمية من صعوبة الحصول على معلومات صحيحه ودقيقه وحديثه عن الشركات الأجنبية، ولتقليل مخاطر عدم السداد من قبل المستوردين الأجانب فيتم طلب 


حفظ الصادرات 
A,B
ضمان الصادرات 
تأمين ائتمان للتصدير 
# 




يقوم المصدرون في هذا الشكل من أشكال التمويل بالتعاون فيما بينهم في مجال تسويق صادراتهم مما يسهم في زيادة فرص التصدير لتلك الأسواق 


تمويل عمليات البيع 
تمويل عمليات تسويق الصادرات 

ضمان الصادرات 
تأمين ائتمان للتصدير 
# 




يعتبر قيام الحكومة بأنشاء مؤسسات متخصصة لتمويل الصادرات دون توفير الموارد المالية الكافية للقيام بهذا الدور 


من أدوات التمويل أثناء وبعد الشحن 
من أدوات التمويل قبل الشحن 
من مميزات الصادرات المصرية 
من المشكلات التي تؤثر سلبا على الصادرات المصرية 


# 




يعد من المؤسسات التي تقدم خدمات تمويل الصادرات بمصر، وتم إنشاؤه بموجب القانون رقم 1983 بغرض تشجيع الصادرات المصرية والمعاونة في قيام قطاع تصديري زراعي وصناعي وتجاري ومصرفي 


المؤسسة العربية لضمان الاستثمار 
الشركة المصرية لضمان الصادرات 
البنك المصري لتنميه الصادرات 
الجهاز المصرفي 
# 




يعد من المؤسسات التي تقدم خدمات تمويل الصادرات بمصر، وقام البنك المصري لتنميه الصادرات بإنشائها لضمان الصادرات بموجب القانون رقم 21 لسنه 1992، وذالك من اجل تنفيذ نظام تامين لضمان الصادرات ضد المخاطر التجارية وغير التجارية 


المؤسسة العربية لضمان الاستثمار 
الشركة المصرية لضمان الصادرات 
البنك المصري لتنميه الصادرات 
الجهاز المصرفي 
# 




رفض المشتري أو امتناعه عن استلام البضاعة المشحونة رغم قيام المصدر بالوفاء بجميع التزاماته تجاه المشتري من المخاطر المغطاة 


المخاطر المغطاة غير التجارية 
A,B
غير التجارية 
التجارية 
# 




تعمل المؤسسة على العربية لضمان الاستثمار على توفير خدمات الضمان ضد المخاطر غير التجارية ومن هذه المخاطر المغطاة غير التجارية 


إفلاس المشتري 
عدم عجز المشتري أو تأخره في سداد المبالغ المستحقة للمصدر 
استيلاء سلطات الدولة المستوردة أو دولة العبور العربي على السلع المشحونة أو حجزها أو مصادرتها 
عدم الغاء سلطات الدولة المستوردة لترخيص الاستيراد 
# 




يعد من المؤسسات التي تقدم خدمات تمويل الصادرات بمصر، هو مؤسسه ماليه عربيه مشتركه تهدف للإسهام في تنميه التجارة العربية وقد أنشئ في عام 1989 ويبلغ راس المال المدفوع 500 مليون دولار أمريكي 


المؤسسة العربية لضمان الاستثمار 
برنامج تمويل التجارة العربية 
البنك المصري لتنميه الصادرات 
الجهاز المصرفي 
# 




من أدوات تمويل الصادرات المصرية أثناء وبعد الشحن ،تعمل هذه الأداة في قطاعات رئيسيه مثل القطاع الزراعي والغذائي والمجمدات ، الصناعات الدوائية ، الصناعات الهندسية والنسيجية تم التركيز عليها 


إدخال خدمه الخصم التجاري للمصدر المصري 
اليه ائتمان المشتري الأجنبي 
اليه التخصيم 
اليات اعاده الخصم 
# 




من أدوات تمويل الصادرات المصرية أثناء وبعد الشحن، يساعد على حل مشكله التدفق النقدي التي قد يعاني منها يعض المصدرين المصريين 


اليه التخصيم 
اليات اعاده الخصم 
برامج الصناديق المتجددة 
توفير راس المال العامل 
# 




قامت وزاره التجارة الخارجية بوضع القواعد ومنها: الخصائص المالية للصفقة ، نوع السلعة التي تغطيها، وأجال التغطية وتكاليفها التي تعمل وفقا لأليه ائتمان المشتري الأجنبي ومنها 


إدخال خدمه الخصم التجاري للمصدر المصري 
اليه ائتمان المشتري الأجنبي 
اليه التخصيم 
اليات اعاده الخصم 
# 




تعد سندات التصدير من أدوات التمويل الاستثماري بمصر، حيث يقوم البنك الأهلي بطرح سندات لتمويل الصادرات طويله الأجلم ن 


7: 10 سنوات 
7: 10 شهور 
1: 3 شهور 
1: 3 سنوات 
# 




من أدوات التمويل الاستثماري بمصر، يتم ذالك من خلال حصول بنك تنميه الصادرات على قروض من بنوك مثل بنك التنمية الأفريقي وكذالك بنك الصادرات الأمريكي الياباني لتمويل الصادرات المصرية 


الحصول على تمويل دولاري طويل الأجل 
سندات التصدير 
الية ائتمان المشتري الأجنبي 
اليه التخصيم 



# 




تتولى الحكومة تدبير مبالغ لمواجهه جزء من أعباء الشركات لضمان مخاطر الصادرات في دعم أقساط الضمان للدول متوسطه المخاطر لتصبح1 % بدلام ن 


% 0.5
% 1
% 2
% 1.5
# 




من أدوات تامين وضمان الصادرات، حيث تم إعداد وثيقة تقوم بتحمل الدولة لنفقات الاشتراك بهذه الأداة بنسبه تتراوح من 50% الى 75% من التكلفة الكلية في حاله إخفاق المٌصدر في الحصول على تعاقدات فعليه 


اليه التخصيم 
ضمان مخاطر الصادرات 
ضمان المعارض 
سندات التصدير 
# 




من أدوات تمويل الصادرات المصرية قبل الشحن، ومن امثلتها توقيع وزاره الخارجية بروتوكول التعاون مع البنك الأهلي المصري في أبريل عام 2004 


اليه التخصيم 
اليات اعاده الخصم 
برامج الصناديق المتجددة 
توفير راس المال العامل 
# 




تشير العديد من الدراسات الى انه يمكن النظر الى مفهوم الميزة التنافسية 


مستوياتس ت 
مستويات خمس 
مستويات ثلاث 
مستويان 
# 




يمكن النظر الى مفهوم الميزة التنافسية لأكثر من مستوى وهذه المستوياته ي 


الدولة والصناعة والشركة 
الصناعة والشركة فقط 
الشركة والدولة فقط 
الدولة والصناعة فقط 
# 




تعتبر أحد مستويات الميزة التنافسية وفي هذا المستوي يرتكز الاهتمام حول انعكاس الميزة التنافسية على الرفاهية العامة للدول 


الميزة التنافسية على مستوى الفرد الواحد 
الميزة التنافسية على مستوى الشركة 
الميزة التنافسية على مستوى الصناعة 
الميزة التنافسية على مستوى الدولة 
# 




تعتبر أحد مستويات الميزة التنافسية وفي هذا المستوي قد تتمتع الدولة بميزه تنافسيه عالميه في صناعه معينه أو في بعض الصناعات 


الميزة التنافسية على مستوى الفرد الواحد 
الميزة التنافسية على مستوى الشركة 
الميزة التنافسية على مستوى الصناعة 
الميزة التنافسية على مستوى الدولة 
# 




تعتبر أحد مستويات الميزة التنافسية وفي هذا المستوي يتم التنافس في السوق العالمي يقوم فيما بين الشركات 


الميزة التنافسية على مستوى الفرد الواحد 
الميزة التنافسية على مستوى الشركة 
مستوى الصناعة 
مستوى الدولة 
# 




من مؤشرات الميزة التنافسية 


خفة الحركة والاعتمادية والتعليم 
الطلب المحلي 
معدل نمو الصادرات 
النصيب السوقي في الصادرات 
# 




من محددات الميزة التنافسية 


عدم تجهيز المقومات الضرورية لنشاط التصدير 
عدم المقدرة على متابعه متطلبات التصدير 
عدم تجهيز البيئة التحتية الملائمة لنشاط التصدير 
راس المال البشري ومواصفات الجودة السلعية 
# 




من محددات الميزة التنافسية 


معدل نمو الصادرات والواردات 
الطلب المحلي والمقدرة التكنولوجية 
الاعتمادية والتعليم 
خفة الحركة والتشابكات 
# 




هناك مقاييس لقياس درجة التنافسية ومن أمثلتها 



معدل نمو الواردات 
الخطوط العامة لمداخل التنافسية في الدول المتقدمة 
خفة الحركة 
النصيب السوقي للصادرات 
# 




من مؤشرات الميزة التنافسية وهو يعني قدرة المؤسسات والعاملين على استيعاب المعلومات والتقانات الجديدة 


التشابكات 
التعليم 
الاعتمادية 
خفه الحركة 
# 




من مؤشرات الميزة التنافسية وهي تعني قدرة المؤسسات على القيام بالتزامات متواصلة وتلبيتها مع مرور الزمن في مواجهة عوامل المخاطرة واللايقين 


التشابكات 
التعليم 
الاعتمادية 
خفه الحركة 
# 




من مؤشرات الميزة التنافسية وهي تعني مختلف أشكال الارتباط أو التواصل القائم بين الأسواق المحلية والدولية ومصادر المعلومات والتكنولوجيا 


التشابكات 
التعليم 
الاعتمادية 
خفه الحركة 
# 




من مؤشرات الميزة التنافسية وهي قدرة المؤسسات والعاملين على الاستجابة لمؤشرات السوق كما يعكسها الأداء الاقتصادي والتصديري 

خفه الحركة 
الاعتمادية 
التعليم 
التشابكات 
# 




من مؤشرات الميزة التنافسية ويشمل على نسبة الأنفاق على الدفاع القومي الى الموازنة الكلية 


التشابكات 
التعليم 
الاعتمادية 
خفه الحركة 
# 




من مؤشرات الميزة التنافسية ويشمل نسبة عجز الموازنة مقارنة بالناتج المحلي 


التشابكات 
التعليم 
الاعتمادية 
خفه الحركة 
# 




من مؤشرات الميزة التنافسية ويشمل عدد أجهزه التليفزيون والجرائد اليومية لكل ألف نسمه 


التشابكات 
التعليم 
الاعتمادية 
خفه الحركة 
# 




من مؤشرات الميزة التنافسية ويشمل متوسط معدل نمو الدخل للفرد ومتوسط معدل نمو الصادرات والواردات 


التشابكات 
التعليم 
الاعتمادية 
خفه الحركة 
# 




من محددات الميزة التنافسية ويقصد به العمالة المدربة الماهرة المتخصصة عالية الكفاءة والكفاءات العالية من العلماء والخبراء والمهندسين والفنيين…… 


مواصفات الجودة السلعية 
القدرة التكنولوجية 
الطلب المحلي 
رأس المال البشري 
# 




من المقاييس المستخدمة لقياس درجة التنافسية وهو يعبر عن التغير النسبي بالزيادة أو النقص في كميه أو قيمه الصادرات للدولة عامه 


مؤشر التنافسية الظاهرة لفولراث 
الميزة التنافسية الظاهرة 
معدل نمو الصادرات 
النصيب السوقي للصادرات 
# 




من المقاييس المستخدمة لقياس درجة التنافسية وهو يقاس بنسبه نصيب صادرات الدولة في الأسواق التصديرية 


مؤشر التنافسية الظاهرة لفولراث 
الميزة التنافسية الظاهرة 
معدل نمو الصادرات 
النصيب السوقي للصادرات 
# 




من المقاييس المستخدمة لقياس درجة التنافسية وهو أكثر المقاييس شمولا لكونه يأخذ في الاعتبار كلا من جانبي الصادرات والواردات معا كما يمكن تطبيقه على جانب الصادرات فقطأ و الواردات فقط 


مؤشر التنافسية الظاهرة لفولراث 
الميزة التنافسية الظاهرة 
معدل نمو الصادرات 
النصيب السوقي للصادرات 
# 




من المقاييس المستخدمة لقياس درجة التنافسية وهو يقيس الأداء التصديري للسلعة من دوله معينه مقارنه بالأداء التصديري العام للصادرات على مستوى الدولة وأيضا للصادرات من نفس السلعة على مستوى العالم 


مؤشر التنافسية الظاهرة لفولراث 
الميزة النسبيه الظاهرة 


معدل نمو الصادرات 
النصيب السوقي للصادرات 
# 




من الخطوط العامة لمداخل التنافسية في الدول المتقدمة 



الميزة القومية لا تكتسب 
الميزة القومية تورث 
الميزة تنافسيه وليست نسبيه 
الميزة التنافسية نسبيه 
# 




من محددات الميزة التنافسية وتشتمل على المجموع الكلي للمزايا والخواص للسلعة أو الخدمة وما يقترن بها من عمليات أو معاملات كالتغليق والتعبئة وظروف النقل ومدى المطابقة لمعايير الجودة العالمية أو تلك التي تفرضها الدول المستوردة 


راس المال البشري 
القدرة التكنولوجية 
الطلب المحلي 
مواصفات الجودة السلعية 
# 




من محددات الميزة التنافسية وهي الوسيلة التي يتم بها تحويل الموارد الى سلع وهي تعد شرطا ضروريا لتأهيل الدولة للمنافسة في الأسواق العالمية 


راس المال البشري 
القدرة التكنولوجية 
الطلب المحلي 
مواصفات الجودة السلعية 
# 




يقصد به السعر المدفوع أو الوجب دفعه ثمنا لهذا المنتج من قبل المستورد ودون تحميله باي تكاليف أو رسوم أو نفقات تزيد على ما يتحمله عند البيع 


هامش الإغراق 
الضرر 
سعر التصدير 
الإغراق 
# 




يقصد بها سعر المنتج في مجرى التجارة العادي في السوق المحلية لدولة المنشأ أو التصدير 


الإغراق 
سعر التصدير 
القيمة العادية
هامش الإغراق 
# 




يجوز لها تقدير القيمة العادية وفقا لتكلفه الإنتاج في دولة المنشأ مضافا اليها مبلغ مناسب من المصروفات البيعية والعمومية والإدارية وهامش ربح مناسب 


النقل الداخلي 
التامين البحري 
الشحن البحري 
سلطة التحقيق 
# 




يعرف بانه هو مقدار الإغراق كنسبة مئوية من سعر التصدير CIF 


هامش الإغراق 
الضرر 
سعر التصدير 
الإغراق 
# 




يقصد به انخفاض سعر بيع المنتح المستورد في السوق المحلي عن سعر بيع المنتج المثيل الذي تنتجه الصناعة المحلي على نفس المستوى التجاري 


منع الأسعار المحلية من الزيادة
الدعم 
تخفيض الأسعار 
الفرق السعري 
# 




يقصد به انحفاض أسعار بيع المنتج المحلي نتيجة تأثير الواردات التي تباع بأسعار مغرقه) منخفضه ( 


الدعم 
منع الأسعار المحلية من الزيادة 
تخفيض الأسعار 
الفرق السعري 
# 




يقصد به عدم حدوث الزيادة في الأسعار التي كان من الممكن أن تحدث لولا وجود الواردات المغرقة 


الدعم 
منع الأسعار المحلية من الزيادة 
تخفيض الأسعار 
الفرق السعري 
# 




يعرف بانه الأثار السلبية التي تقع على الصناعة المحلية نتيجة للممارسات الغير عادله في التجارة الدولية 


هامش الإغراق 
الضرر 
سعر التصدير 
الإغراق 
# 




يقسم الضرر الى 


نوع واحد 
خمسه أنواع 
ثلاثة أنواع 
نوعان 
# 




من أنواع الضرر، وهو يعني أن هناك ضرر وقع بالفعل على الصناعة المحلية 


ضرر مادي 
التهديد بالضرر 
الإعاقة المادية 
الأرباح 
# 




الضرر المادي، وهو يعني أن هناك ضرر وقع بالفعل على الصناعة المحلية ويتم بحثه من خلال 


سبعه عناصر 
خمسه عناصر 
ثلاثة عناصر 
عنصر 
# 




يعتبر معدل زيادة كبيره في الواردات المغرقة الى السوق المحلي مما يكشف عن احتمال حدوث زيادة كبيره في الاستيراد من 


عوامل الضرر المادي 
عوامل التهديد
عوامل الإعاقة
عوامل الدعم بالضرر المادية 
# 




من أنواع الضرر، وهي أنها تفسر على أن الواردات المغرقة تمنع قيام أو إنشاء صناعه جديده في الدولة المستوردة 


الأرباح 
الإعاقة المادية 
التهديد بالضرر 
ضرر مادي 
# 




يعتبر من أنواع الدعم، ويعرف بانه الدعم الذي يجب أن يمتنع الأعضاء كلية عن تقديمه 


الدعم المخصص للبيئة 
الدعم غير القابل لاتخاذ إجراء 
الدعم القابل لاتخاذ إجراء 
الدعم المحظور 
# 




يعرف بانه أي مساهمه ماليه مباشره أو غير مباشره مقدمه من دولة المنشأ أو من أي هيئة عامه بها من خلال برامج أو خطط وينتج عنها تحقيق فائدة للمنتج أو المصدر 


الوقاية 
الضرر 
الدعم 
الإغراق 
# 




تعرف بانها إمكانيه فرض تدابير ضد الزيادة غير المبررة في الواردات سوآءا بشكلها المطلق أو النسبي من الإنتاج وتسبب ضرر جسيما بالصناعة المحلية أو تهديد بحدوث ضرر جسيم 


الوقاية 
الضرر 
الدعم 
الإغراق 
# 




تعرف بانها زيادة مطلقه أو زيادة نسبيه بالنسبة للإنتاج المحلي وهي زيادة حدثت مؤخرا بصورة مفاجئة وكبيره وجوهريه 


الإعاقة المادية 
الضرر الخطير 
الزيادة المبررة 
الزيادة غير المبررة 
# 




يعرف بانه مستوى اعلى من الضرر المادي في حالات مكافحة الإغراق والإجراءات التعويضية 


الإعاقة المادية 
الضرر الخطير 
الزيادة المبررة 
الزيادة غير المبررة 
# 




يعرف بان السلع إذا كان سعر تصديرها الى السوق المحلي في بلد الاستيراد اقل من قيمتها العادية في بلد التصدير 


الضرر 
الوقاية 
الدعم 
الإغراق 
# 




يعرف بانه الأضعاف الكلي الكبير في مركز الصناعة المحلية أو التهديد بوقوعه استنادا على وقائع وليس مجرد ادعاءات أو تكهنات 


الضرر البسيط 
الضرر الخطير 
الزيادة المبررة 
الزيادة غير المبررة 
# 




من أنواع الدعم المحظور 


الدعم المخصص للبحوث والتطوير 
دعم التصدير 
الدعم المخصص للبيئة 
الدعم غير المخصص 
# 




من أنواعه الدعم، وهو الدعم الذي لا يكون محظورا ويسبب ضررا بالصناعة المحلية لعضو أخر من أعضاء منظمه التجارة العالمية 


الدعم المخصص للبيئة 
الدعم غير القابل لاتخاذ إجراء 
الدعم المحظور 
الدعم القابل لاتخاذ إجراء 
# 




هو الفرق بين القيمة العادية وسعر التصدير 


هامش الإغراق 
مقدار الإغراق 
الوقاية 
الدعم 
# 




طبقا لاتفاق مكافحة الإغراق يجب إثبات علاقة السببية عن طريق ما يعرف بانه حدوث الضرر تزامن مع زيادة الواردات المغرقة 


سعر التصدير 
بحث التزامن 
الدعم 
الزيادة غير المبررة 
# 




تعرف بانها زيادة الواردات سوآءا كانت مطلقه أو نسبيه وهي زيادة نسبة الواردات الى الإنتاج أو الاستهلاك 


أثر الواردات على اقتصاديات الصناعة المحلية بالنسبة لحجم الواردات 
اثر الواردات على أسعار السلع المنتجة في السوق المحلي 
الفرق السعري 
تخفيض الأسعار 
`;

const ans = [
    2, 3, 1, 2, 2, 2, 2, 1, 1, 2, 3, 3, 2, 2, 1, 3, 1, 2, 1, 4, 2, 3, 2, 2, 4,
    2, 3, 4, 3, 1, 3, 4, 1, 2, 2, 3, 1, 2, 3, 1, 2, 3, 4, 4, 3, 4, 4, 1, 2, 2,
    2, 4, 1, 2, 3, 4, 1, 3, 1, 3, 2, 4, 1, 3, 2, 4, 1, 1, 2, 1, 4, 3, 2, 1, 3,
    2, 3, 1, 4, 1, 2, 3, 3, 2, 1, 2, 2, 3, 1, 2, 4, 1, 3, 1, 3, 3, 1, 3, 3, 4,
];

const ITQuestions2 = q.split('#').map((q, i): Question => {
    // console.log(i+1, ans[i], `{question: "${q}", answer: ${ans[i]}},`)
    let _answers = q
            .trim()
            .split('\n')
            .filter((a) => a.trim().length > 0),
        text = _answers.shift();
    if (_answers.length > 4) {
        console.log(i + 1, ans[i], `{question: "${q}", answer: ${ans[i]}},`);
    }

    const answers: Answer[] = _answers.reverse().map(
        (a, ai): Answer => ({
            id: uuid(),
            text: a,
            correct: ai + 1 === ans[i],
        })
    );

    return question(uuid(), text ?? 'error extracting questions', answers);

    // return {
    //     id: uuid(),
    //     questionText: text ?? 'error extracting questions',
    //     answers: answers,
    // };
});

export default ITQuestions2;
