import { v4 as uuid } from 'uuid';
import { question } from './data';

export const q = `
تحظى مسألة تنمية . . . . باهتمام متزايد وتوضع على رأس أولويات السياسة الاقتصادية في مصر ،وبصفة خاصة في الآونة الأخيرة وذلك لمعالجة العجز في الميزان التجاري. 
الصادرات 
الواردات 
الضرائب 
المصروفات.



#

تعتبر تنمية الصادرات الزراعية أحد العناصر الهامة والرئيسية لتنمية مصادر . . . . ، حيث تقدر قيمة هذه الصادرات بحوالي 3 مليار دولار عام 2020 م.
النقد الأجنبي 
النقد المحلى 
النقد الدولي 
النقد القومي 



#

وفى إطار الاتجاه العالمي لإزالة معوقات التبادل التجاري بين مختلف الدول، تسعى كل دولة إلى زيادة حجم . . . . 
الإنتاج 
الصادرات 
الاستهلاك 
الواردات



#

تسعى السياسة الاقتصادية المصرية جاهدة لتنويع وتعظيم العائد من الصادرات بوجه عام، والصادرات . . . . بوجه خاص.
الزراعية 
الصناعية 
الخدمية 
التجارية.



#

تعاني التجارة الخارجية المصرية بصفة عامة من . . . . دائم ومستمر على مدار الفترة الماضية بسبب التزايد السكاني المتزايد ومحدودية الموارد الزراعية.
عجز 
فائض 
تعادل



#

يبنى التفسير الكلاسيكي للتجارة الدولية على مبدأ التكاليف النسبية الذي صاغه الاقتصادي الإنجليزي . . . . عام 1817
ادم سميث 
دافيد ريكاردو 
جون ستيوارت ميل



#

إن اختلاف النفقات هو الشرط الضروري والكافي للتبادل التجاري بين دولتين 
الكلية 
النسبية 
المتوسطة



#

ويرى . . . . أن الفائدة أو المنافع المتحصل عليها من التجارة الدولية تتأتى من التوظيف الأكثر كفاءة للقوى الإنتاجية في العالم.
ادم سميث 
دافيد ريكاردو 
جون ستيوارت ميل



#

يتم قياس الميزة النسبية باستخدام معامل تكلفة الموارد . . . . 
الأجنبية 
المحلية 
العالمية 
الحدود.



#

إذا كانت قيمة معامل تكلفة الموارد المحلية أقل من الواحد الصحيح فهذا يشير إلى أن الدولة . . . . عملة أجنبية من إنتاج السلعة محليا.
لا توفر 
توفر 
تخسر 
لا تخسر



#

يمكن للدولة أن يكون لها ميزة نسبية في إنتاج تلك السلعة إذا توافرت السلعة . . . . 
بوفرة 
بندرة 
قليلا



#

قام Balassa بتركيب الرقم القياسي للميزة النسبية . . . . 
الحقيقية 
التقليدية 
الظاهرية 
الخيالية.



#

كلما زادت قيمة الرقم القياسي للميزة النسبية الظاهرة عن 100 دل ذلك على . . . . ميزة نسبية ظاهرة لصادرات السلعة
عدم وجود 
وجود 
غياب 
عدم غياب.



#

وإذا انخفض الرقم القياسي للميزة النسبية الظاهرة عن 100 دل ذلك على . . . . الميزة النسبية للسلع الداخلة في حسابه.
زيادة 
تحسن 
تدهور



#

يقيس معامل الحماية الأسمى أثر . . . . 
السياسة الصناعية 
السياسة التجارية 
السياسة العلمية 
السياسة الزراعية.



#

معامل الحماية الأسمى يساوي السعر المزرعى مقسوما على السعر العالمي× . . . . 
سعر السلعة التوازني 
سعر الحدود التوازني 
السعر العالمي التوازني 
سعر الصرف التوازني


#
الميزة . . . . لها مكونات معناها إنتاج سلعة بتكلفة منخفضة وذات جودة عالية ووجود خدمات لتوصيل هذه السلعة للمستهلك في الوقت المناسب والشكل المناسب.
التنافسية 
النسبية 
الكلية



#

 . . . . هو سعر تصدير السلعة في دولة ما مقسوما على سعر تصدير السلعة في الدولة المنافسة × 100 
السعر العالمي 
السعر المتوسط 
السعر النسبي.



#

تستخدم مرونة . . . . على السلعة المصدرة في الدولة المستوردة كمؤشر للمركز أو القوة التنافسية للسلعة في سوق الدولة المستوردة لها.
العرض السعرية 
الطلب السعرية 
الإنتاج السعرية.



#

كلما كانت مرونة الطلب الخارجي على السلعة في سوق ما . . . . كلما دل ذلك على أن الدولة المصدرة تستطيع رفع سعر السلعة في أسواق الدول المستوردة.
مرتفعة 
منخفضة 
متزايدة 
متناقصة



#

إن النظام التجاري . . . . ينطوي على قواعد يضعها المجتمع الدولي، بصورة متعددة الأطراف.
المحلى 
الإقليمي 
الدولي



#

إن النظام التجاري الدولي يبني على . . . . دولية، تكون ملزمة للدول التي توقعها بعد مناقشتها.

مناقشات 
اجتماعات 
اتفاقيات



#

تعتبر منظمة . . . . العالمية العنصر الأساسي في النظام التجاري الدولي متعدد الأطراف 
العمل 
الاستهلاك 
الإنتاج 
التجارة



#

تعد منظمة . . . . العالمية الآن بمثابة الإطار المؤسسي الدولي الوحيد الذي يضع ويوضح، ويطور، ويشرف على تطبيق القواعد التي تحكم حركة التجارة الدولية بين دول العالم المختلفة.
العمل 
الاستهلاك 
الإنتاج 
التجارة.


#

اتفقت الدول الأعضاء في النظام التجاري العالمي على إجراء . . . . جمركية بعد التعرفةTariffication والربط Binding على مدى ست سنوات بدءا من عام 1995 
زيادات 
تخفيضات 
تثبيتات



#

يؤكد هذا الاتفاق لحرية التجارة الدولية على حق أي دولة عضو في منظمة التجارة العالمية في تبني أي تدابير تراها ضرورية للحفاظ على . . . . الإنسان، والحيوان ،والنبات.
أعداد 
خصائص 
صحة



#

اتبعت الدول النامية بعد الاستقلال الدول المتقدمة في نظام حرية التجارة العالمية لتحقيق . . . . من التجارة الدولية.
خسائر 
مكاسب 
استقرار



#

يمكن تعريف . . . . الاقتصادي الدولي على أنه درجة معينة من التكامل الاقتصادي الذي يقوم بين مجموعة من الدول المتجانسة اقتصاديا.
الاتحاد 
التجمع 
التكتل



#

تعريف التكتل الاقتصادي الدولي على أنه درجة معينة من التكامل الاقتصادي بهدف تعظيم المصالح وزيادة التجارة الدولية لتحقيق . . . . عائد لشعوب تلك الدول.
اقل 
أكبر 
تعادل.



#

من أهم . . . . النظام الاقتصادي العالمي الجديد هو الاتجاه المتزايد نحو تكوين التكتلات الاقتصادية العملاقة للحصول على أكبر مكاسب ممكنة من التجارة الدولية.
خصائص 
أنواع 
طرق.



#


من الدوافع التي تجعل مجموعة من الدول تهتم بتكوين تكتل اقتصادي فيما بينها هو . . . . 
التمتع بوفورات الإنتاج الكبير. 
التمتع بالانفراد بالإنتاج. 
التمتع بالإنتاج الصغير .



#

من الدوافع التي تجعل مجموعة من الدول تهتم بتكوين تكتل اقتصادي فيما بينها:
زيادة درجة المنافسة. 
تقليل درجة المنافسة. 
تثبيت درجة المنافسة.



#

من الدوافع التي تجعل مجموعة من الدول تهتم بتكوين تكتل اقتصادي فيما بينها:
توسيع حجم السوق 
تقليل حجم السوق 
تثبيت حجم السوق.



#

من الدوافع التي تجعل مجموعة من الدول تهتم بتكوين تكتل اقتصادي فيما بينها:
زيادة معدل التجارة الدولية البينية 
تقليل معدل التجارة البينية 
تثبيت معدل التجارة البينية.



#

من الدوافع التي تجعل مجموعة من الدول تهتم بتكوين تكتل اقتصادي فيما بينها:
تقليل نصيب التكتل الاقتصادي من التجارة العالمية 
تثبيت نصيب التكتل الاقتصادي من التجارة العالمية 
زيادة نصيب التكتل الاقتصادي من التجارة العالمية



#

من الدوافع التي تجعل مجموعة من الدول تهتم بتكوين تكتل اقتصادي فيما بينها:
تثبيت مستوى الرفاهية الاقتصادية 
زيادة مستوى الرفاهية الاقتصادية 
تقليل مستوى الرفاهية الاقتصادية



#

من الدوافع التي تجعل مجموعة من الدول تهتم بتكوين تكتل اقتصادي فيما بينها:
تثبيت مستوى التكاليف الإنتاجية
زيادة مستوى التكاليف الإنتاجية 
تقليل مستوى التكاليف الإنتاجية



#

من الدوافع التي تجعل مجموعة من الدول تهتم بتكوين تكتل اقتصادي فيما بينها:
تثبيت مستوى الكفاءة الإنتاجية 
زيادة مستوى الكفاءة الإنتاجية 
تقليل مستوى الكفاءة الإنتاجية



#


الضلع النقدي في نظام التجارة العالمية ويشير إلى المعاملات النقدية الدولية قصيرة الأجل وأهمية تحقيق الاستقرار فيها ويعبر عنه . . . . 
صندوق الإسكان الدولي 
صندوق التمويل الدولي 
صندوق النقد الدولي.



#

الضلع المالي في نظام التجارة العالمية يعبر عن المعاملات الاقتصادية طويلة الأجل والتي تمثل الاستثمارات الدولية ويشرف على هذا النوع من المعاملات مجموعة . . . . والذي يسعى إلى تأمين حركة تدفقات رؤوس الأموال العالمية.

الاستثمار الدولي 
العمل الدولي 
البنك الدولي.



#

الضلع التجاري أو ما يعرف بالتجارة الدولية متعددة الأطراف وقد كانت الاتفاقية العامة للتعريفة والتجارة (الجات) ترعى شئون التجارة العالمية من الفترة 1/1/1948-31/12/1994. ومع بداية عام 1995حلت محلها منظمة . . . . 
العمل الدولية 
الأم الدولي 
التجارة العالمية.



#

ويضيف . . . . أن اختلاف الندرة النسبية لعوامل الإنتاج ما بين دولة وأخرى هو شرط ضروري لوجود اختلاف في النفقات النسبية وبالتالي لقيام التجارة الخارجية.
جون ستيوارت ميل 
ديفيد ريكاردو 
هيكشر



#

معامل . . . . = إجمالي التكاليف للوحدة بالسعر المحلى / القيمة المضافة للوحدة بسعر الحدود 
أسعار الموارد المحلية 
تكلفة الموارد المحلية 
إنتاج العوامل المحلية.



#

التكامل الاقتصادي . . . . ويقصد به توسيع النطاق الجغرافي للاتحاد من خلال قبول أعضاء جدد من بين الدول المنتمية جغرافيا إلى الإقليم الاقتصادي.
الرأسي 
الأفقي 
المتوسط.



#

التكامل الاقتصادي . . . . ويقصد به التحرك من درجة إلى أخرى على درجات سلم التكامل الاقتصادي والذي يبدأ بمنظمة التجارة الحرة مرورا بالاتحاد الجمركي فالسوق المشتركة فالوحدة الاقتصادية انتهاءا بالتكامل الاقتصادي.
الأفقي 
الرأسي 
المتوسط.



#

التكامل الاقتصادي . . . . وهو يشير إلى درجات سلم التكامل الاقتصادي الثلاث الأولى (منظمة التجارة الحرة، الاتحاد الجمركي، السوق المشتركة)، حيث يتم إزالة القيود فقط.
الموجب 
السالب 
المتعادل.



#

التكامل الاقتصادي . . . . وهو يعكس الوحدة النقدية المالية والتكامل حيث تتخذ سلطات التكامل خطوات إيجابية نحو إنشاء آليات جديدة للتكامل مثل التنسيق وتوحيد السياسات الاقتصادية وإنشاء عملة موحدة وإنشاء بنك مركزي موحد وتوحيد النظم الضريبية وتشريعات العمل وغير ذلك.
الموجب 
السالب 
المتعادل.



#

 . . . . ويتكون هذا التكتل الاقتصادي بهدف تحرير التجارة بين دول الأعضاء ويتم الاتفاق بين دولتين أو أكثر على إزالة كافة العقبات التي تقف في سبيل التبادل التجاري بينهم وتلتزم كل دولة من الدول المشتركة بإلغاء الرسوم الجمركية والقيود الكمية المفروضة على الواردات من بقية الدول المشتركة.

منظمة الاستهلاك الحر 
منظمة الإنتاج الحر 
منطمة التجارة الحرة 



#

 . . . . وفيه يتم إلغاء الرسوم الجمركية والقيود الكمية فيما بين الدول الأعضاء، وتلتزم الدول الأعضاء بتعريفة جمركية موحدة يتم تطبيقها على السلع المستوردة من العالم الخارجي.
الاتحاد الضرائبي 
الاتحاد الجمركي 
الاتحاد الإنتاجي



#

وفيه يتم توحيد أسواق كل من المنتجات وعناصر الإنتاج فيما يمكن تسميته بتكامل الأسواق وهذا لا يكون ممكنا إلا إذا اتفقت الدول الأعضاء في السوق على ترتيبات من شأنها تنسيق السياسة الاقتصادية فيما يسمى بتكامل السياسات.

السوق المشتركة 
السوق المنفردة 
السوق العالمي.



#

من خلال الاتحاد الاقتصادي يتم إلغاء كافة القيود على التجارة الدولية وانتقال رؤوس الأموال والأشخاص بين الدول بالإضافة إلى تحقيق التنسيق في كافة السياسات الاقتصادية بغرض الوصول إلى الوحدة الاقتصادية العالمية.
الاتحاد الاقتصادي 
الاتحاد الإنتاجي 
الاتحاد الاستهلاكي



#

يعتبر . . . . أكبر التكتلات الاقتصادية في العالم وأصبح هذا التكتل الاقتصادي في نظر العديد من الخبراء أكبر قوة اقتصادية وأقوى تكتل اقتصادي على مستوى العالم
الاتحاد العالمي 
الاتحاد العربي 
الاتحاد الأوروبي.



#

من أهم أهداف التكتل الاقتصادي الأوروبي:
خلق سوق تجارية موحدة ذات قدرة إنتاجية أكثر كفاءة وطاقة استيعابية
خلق سوق تجارية متعددة ذات قدرة إنتاجية أكثر كفاءة وطاقة استيعابية
خلق سوق تجارية موحدة ذات قدرة إنتاجية اقل كفاءة وطاقة استيعابية



#


من أهم أهداف التكتل الاقتصادي الأوروبي:
تعميق الاقتصاد القائم على آليات السوق واحترام مبدأ المنافسة
تعميقا لاقتصاد الغير قائم على آليات السوق واحترام مبدأ المنافسة
تعميق الاقتصاد القائم على آليات السوق وعدم احترام مبدأ المنافسة



#


من أهم أهداف التكتل الاقتصادي الأوروبي:
عدم الانتقال من مرحلة التكامل والتنسيق إلى مرحلة الاندماج الفعلي بما يسهل من عملية الاستخدام الأمثل للموارد
الانتقال من مرحلة التكامل والتنسيق إلى مرحلة الاندماج الفعلي بما يسهل من عملية الاستخدام الأمثل للموارد
الانتقال من مرحلة التكامل والتنسيق إلى مرحلة الانفصال الفعلي بما يسهل من عملية الاستخدام الأمثل للموارد



#


من أهم أهداف التكتل الاقتصادي الأوروبي:
انخفاض قدرة التكتل الأوروبي في لعب دورا أكثر فعالية في كافة المجالات الاقتصادية والسياسية
ثبات قدرة التكتل الأوروبي في لعب دورا أكثر فعالية في كافة المجالات الاقتصادية والسياسية
زيادة قدرة التكتل الأوروبي في لعب دورا أكثر فعالية في كافة المجالات الاقتصادية والسياسية



#


من أهم أهداف التكتل الاقتصادي الأوروبي:
تحقيق الوحدة النقدية الأوروبية والاستقرار النقدي في أوروبا وإقامة البنك المركزي الأوروبي
عدم تحقيق الوحدة النقدية الأوروبية والاستقرار النقدي في أوروبا وإقامة البنك المركزي الأوروبي
تراجع الوحدة النقدية الأوروبية وعدم الاستقرار النقدي في أوروبا وإقامة البنك المركزي الأوروبي



#


من أهم أهداف التكتل الاقتصادي الأوروبي:
العمل على زيادة معدلات التضخم وزيادة معدلات النمو وخفض نسبة البطالة وخفض معدلات الفائدة
العمل على خفض معدلات التضخم وزيادة معدلات النمو وخفض نسبة البطالة وخفض معدلات الفائدة
العمل على خفض معدلات التضخم وخفض معدلات النمو وخفض نسبة البطالة وخفض معدلات الفائدة 



#


يعتبر التكتل الاقتصادي . . . . من أكبر التكتلات الاقتصادية في العالم بعد التكتل الاقتصادي الأوروبي من ناحية الحجم والإمكانيات.
لأمريكا الجنوبية 
لأمريكا الشمالية 
للدول العربية.



#


من أهداف التكتل الاقتصادي لأمريكا الشمالية (نافتا) انه يسعى إلى تحقيق مجموعة من الأهداف أهمها:
زيادة معدلات نمو الناتج المحلى الإجمالي للدول الأعضاء
تقليل معدلات نمو الناتج المحلى الإجمالي للدول الأعضاء
تثبيت معدلات نمو الناتج المحلى الإجمالي للدول الأعضاء



#


من أهداف التكتل الاقتصادي لأمريكا الشمالية (نافتا) انه يسعى إلى تحقيق مجموعة من الأهداف أهمها:
إلغاء الحواجز الجمركية وتحرير التجارة وزيادة الاستثمارات
عدم إلغاء الحواجز الجمركية وعدم تحرير التجارة وزيادة الاستثمارات
إلغاء الحواجز الجمركية وتحرير التجارة وزيادة الاستثمارات



#


من أهداف التكتل الاقتصادي لأمريكا الشمالية (نافتا) انه يسعى إلى تحقيق مجموعة من الأهداف أهمها:
علاج مشكلات البطالة في دول التكتل من خلال زيادة الطاقة الإنتاجية وبالتالي تعظيم فرص العمل أمام الراغبين فيه
علاج مشكلات البطالة في دول التكتل من خلال زيادة الطاقة الإنتاجية وبالتالي تعظيم فرص العمل أمام الراغبين فيه 
علاج مشكلات البطالة في دول التكتل من خلال زيادة الطاقة الإنتاجية وبالتالي تعظيم فرص العمل أمام الراغبين فيه 



#


من أهداف التكتل الاقتصادي لأمريكا الشمالية (نافتا) انه يسعى إلى تحقيق مجموعة من الأهداف أهمها:
تحقيق التكامل الاقتصادي بين دول التكتل الاقتصادي القائم على المزايا النسبية والمزايا التنافسية لكل دولةعدم تحقيق التكامل الاقتصادي بين دول التكتل الاقتصادي القائم على المزايا النسبية والمزايا التنافسية لكل دولة
تقليل التكامل الاقتصادي بين دول التكتل الاقتصادي القائم على المزايا النسبية والمزايا التنافسية لكل دولة 



#


من أهداف التكتل الاقتصادي لأمريكا الشمالية (نافتا) انه يسعى إلى تحقيق مجموعة من الأهداف أهمها:
تقليل قدرة التكتل الاقتصادي لأمريكا الشمالية على التعامل مع التكتلات الاقتصادية العملاقة الأخرى وتحقيق ميزة تنافسية
زيادة قدرة التكتل الاقتصادي لأمريكا الشمالية على التعامل مع التكتلات الاقتصادية العملاقة الأخرى وتحقيق ميزة تنافسية
تثبيت قدرة التكتل الاقتصادي لأمريكا الشمالية على التعامل مع التكتلات الاقتصادية العملاقة الأخرى وتحقيق ميزة تنافسية



#


السوق المشتركة لدول . . . . تعبر عن أكبر تكتل اقتصادي في القارة الأفريقية، ويبلغ عددها بعد انضمام مصر إليها واحد وعشرون دولة
شرق وجنوب أفريقيا 
غرب وجنوب أفريقيا 
شمال وجنوب أفريقيا.



#

تسعى السوق المشتركة( الكوميسا) لتحقيق الأهداف التالية:
تحقيق معدل نمو اقتصادي ثابت ومستمر لدول الأعضاء 
تحقيق معدل نمو اقتصادي منخفض ومستمر لدول الأعضاء
تحقيق معدل نمو اقتصادي ثابت وغير مستمر لدول الأعضاء



#


تسعى السوق المشتركة( الكوميسا) لتحقيق الأهداف التالية:
خلق بيئة غير مواتية للاستثمار المحلى والأجنبي
خلق بيئة مواتية للاستثمار المحلى والأجنبي
خلق بيئة مواتية للاستثمار المحلى دون الأجنبي 



#


تسعى السوق المشتركة( الكوميسا) لتحقيق الأهداف التالية:
تشجيع المشروعات المشتركة في الأنشطة الاقتصادية
عدم تشجيع المشروعات المشتركة في الأنشطة الاقتصادية
وقف المشروعات المشتركة في كافة الأنشطة الاقتصادية



#


تسعى السوق المشتركة(الكوميسا) لتحقيق الأهداف التالية:
تنمية تطوير العلوم والتكنولوجيا وتحقيق السلام والأمن والاستقرار للدول
عدم تنمية تطوير العلوم
والتكنولوجيا وتحقيق السلام والأمن والاستقرار للدول
توقف تنمية تطوير العلوم والتكنولوجيا وتحقيق السلام والأمن والاستقرار للدول



#


تسعى السوق المشتركة ( الكوميسا ) لتحقيق الأهداف التالية:
عدم تنمية تطوير العلوم والتكنولوجيا وتحقيق السلام والأمن والاستقرار للدول
تقليل تنمية تطوير العلوم والتكنولوجيا وعدم تحقيق السلام والأمن والاستقرار للدول
تنمية تطوير العلوم والتكنولوجيا وتحقيق السلام والأمن والاستقرار للدول

`;

const ans = [
    1, 1, 2, 1, 1, 2, 2, 3, 2, 2, 1, 3, 2, 3, 4, 4, 1, 3, 2, 2, 3, 3, 4, 4, 2,
    3, 2, 3, 2, 1, 1, 1, 1, 1, 1, 2, 3, 2, 3, 3, 3, 3, 2, 2, 2, 2, 1, 3, 2, 1,
    1, 3, 1, 1, 2, 3, 1, 2, 2, 1, 3, 1, 1, 2, 1, 1, 2, 1, 1, 3,
];

const ITQuestions1 = q.split('#').map((q, i): MultiSelectQuestion => {
    // console.log(i+1, ans[i], `{question: "${q}", answer: ${ans[i]}},`)
    let _answers = q
            .trim()
            .split('\n')
            .filter((a) => a.trim().length > 0),
        questionText = _answers.shift() || 'failed to parse question';

    const answers: Answer[] = _answers.map(
        (a, ai): Answer => ({ id: uuid(), text: a, correct: ai + 1 === ans[i] })
    );

    return question({ questionText, answers });
    // return {
    //     id: uuid(),
    //     questionText: text ?? 'error extracting questions',
    //     answers: answers,
    // };
});

export default ITQuestions1;
