import { v4 as uuid } from 'uuid';
import { selectionQuestion } from './data';

export const q = `

العلاقة بين البيئة والمشروع هي علاقة . . . . 
2
تكامليه
تبادليه
عكسية
طرديه


#

مناخ الاستثمار الذي يعمل من خلاله المشروع، بالإضافة إلى الناحية القانونية التي تتعلق ببيئة المشروع
1
آثار البيئة الاستثمارية
اثار البيئة الطبيعية
اثار البيئة التكنولوجية
اثار البيئة السياسية


#

يعبر . . . . عن البيئة التي يعمل فيها المشروع بكل مكوناتها الاقتصادية والسياسية والاجتماعية .
2
أثر المشروع على البيئة
أثر البيئة على المشروع
أثر البيئة والمشروع على المجتمع
غير ذلك


#

لأثار المشروع على البيئة توجد . . . . احتمالات تنشأ من طبيعة المنتجات التي يقدمها المشروع.
1
ثلاث
أربع
خمس
ست


#

احتمال وجود آثار ضارة بالبيئة لا يمكن معالجتها ولا السيطرة عليها، يؤدى إلى
2
قبول المشروع
رفض المشروع
إضافة تكاليف استثمارية كبيرة
تركيب معدات خاصة


#

احتمال وجود آثار ضارة بالبيئة يمكن معالجتها يؤدى إلى
4
تغيير المشروع
رفض المشروع
قلة التكاليف الاستثمارية
تركيب معدات خاصة



#

من أهم المصطلحات الأساسية لتقييم الأثر البيئي .
2
مخاطر المشروع
مصادر التلو ث
معوقات المشروع
الموارد الاقتصادية


#

سلسلة من المواصفات القياسية لتقييم الأداء البيئي للمؤسسة لتصبح المؤسسة أكثر فاعلية تجاه المحافظة على البيئة والحدمن التلوث والوصول الأداء بيئي متميز يحافظ على أمن الأرض.
4
معايير الجودة
مواصفات تقرير التقييم
المواصفات العالمية
المواصفات القياسية


#

كل ما يلي يوضح الآثار البيئية الرئيسية التي قد تنتج عن بعض المشاريع بالنسبة للهواء ما عدا . . . . 
2
زيادة انبعاثات ملوثات الهواء
التعارض مع شبكات الصرف الحالية
انتشار الروائح الكريهة
تغيرات في ديناميكية الهواء


#

كل ما يلي يوضح الآثار البيئية الرئيسية التي قد تنتج عن بعض المشاريع بالنسبة للمياه ما عدا . . . . 
1
تأثير على المزارع الفريدة النوعية
تغيرات في توزيع القنوات المائية
إعاقة وانسداد مأخذ المياه (الري)
إعاقة مسارات مياه الفيضان


#

كل ما يلي يوضح الآثار البيئية الرئيسية التي قد تنتج عن بعض المشاريع بالنسبة للتربة ما عدا . . . . 
4
توازن ميول جوانب التربة
حدوث إحلال للتربة
حدوث انتقال للأيونات السامة والمعادن الثقيلة
الانبعاثات الضارة


#

من الآثار البيئية الرئيسية التي قد تنتج عن بعض المشاريع على البيئة البيولوجية بالنسبة (للحياة النباتية) ما عدا . . . . 
3
تغييرات في إنتاجية وتنوع المحاصيل الموجودة
إمكانية انقراض الفصائل النباتية النادرة
أثار انخفاض جودة المياه على الكائنات الحية الدقيقة
تحسين الخدمات الزراعية



#

من الآثار البيئية الرئيسية التي قد تنتج عن بعض المشاريع على البيئة البيولوجية بالنسبة (للحياة الحيوانية) ما عدا . . . . 
1
تحسين الخدمات الزراعية
تواجد فصائل جديدة من الكائنات الحيوانية
إعاقة أو تغييرمسارات حجرة الكائنات الحيوانيه
تغييرات في الأنواع السمكية


#

من الآثار الاجتماعية والاقتصادية التي قد تنتج عن بعض المشاريع . . . . 
2
إعاقة مسارات مياه الفيضان
تغيير في أسعار الأراضى
زيادة الطلب على الوقود والغاز
الوصول للخدمات الطبية


#

من الآثار البيئية الرئيسية التي قد تنتج عن بعض المشاريع بالنسبة لحركه المرور والانتقال . . . . 
3
تحسين الانتقال للمدارس والجهات الحكوميين
زيادة المرور في المناطق التاريخية .
تحسين الترابط بين القرى
تحسين خدمات إطفاء الحرائق


#

من الآثار البيئية الرئيسية التي قد تنتج عن بعض المشاريع بالنسبة للخدمات العامة والمرافق . . . . 
1
زيادة الطلب على الوقود والغاز
زيادة انبعاثات ملوثات الهواء
تغيرات في توزيع القنوات المائية
انتشار الطحالب


#

من الآثار البيئية الرئيسية التي قد تنتج عن بعض المشاريع بالنسبة لصحه الأنسان . . . . 
4
تحسين خدمات الطوارئ
زيادة التعرض الأمراض المستوطنة
ظهور بعض الأمراض الجديدة
B&C معا


#

هي مجموعة الأطر المؤسسية والنظم الاقتصادية والاجتماعية والقانونية المؤثرة على توجهات القرارات الاستثمارية
2
مقومات الاستثمار
مناخ الاستثمار
الخطط الاستثمارية
قوانين الاستثمار



#

هي الدراسة التي يتم إجراؤها للمشروع لتحديد الآثار المحتملة أو الناجمة عن المشروع، والإجراءات والوسائل المناسبة لمنع الآثار السلبية أو تخفيضها وتحقيق أو زيادة المردودات الإيجابية للمشروع على البيئة بما يتوافق مع المقاييس البيئية المعمول بها.
3
تقييم الأثرالاجتماعى
تخطيط المشروع
تقييم الأثرالبيئى
تقييم المشروع



#

هو الفحص المنظم للآثار غير المتعمدة التي تنجم عن مشروع أو برنامج تنموي، وذلك بهدف تقليص أو تخفيف حدة الآثار السلبية وتعظيم الآثار الإيجابية
1
تقييم الأثر البيئى
تقييم المشروع
تخطيط المشروع
تقييم الأثر الاجتماعى



#

جميع ما يلي يعد من أهداف تقييم الأثر البيئي ما عدا . . . . 
4
حماية البيئة والحفاظ على صحة الإنسان
المراقبة البيئية المستمرة لمشروعات التنمية
تحسين عملية صناعة اتخاذ القرار
بناء الثقة في القيادات المحلية



#

قانون حماية البيئة يستند في تعريفه للمنشآت التي تخضع لتقييم الآثار البيئية على المبادئ الرئيسية التالية ما عدا . . . . 
2
نوعية النشاط المنشأة
مساحة المنشأ ة
موقع المنشأة
نوعية الطاقة المستخ دمة لتشغيل المنشأة


#

تصنف المشروعات تبعا لتأثيرها على البيئة ل . . . . 
2
فئتان
ثلاث فئات
أربع فئات
خمس فئات


#

فئة لا تحتاج إلى إعداد دراسات التقييم البيئي وإنما يجب الالتزام بالتنظيمات والاشتراطات الفنية والصحية لهذه الأنشطة التي تم أخذها في الاعتبار في أثناء مرحله إعداد المخطط العام للمدينة أو القرية منها . . . . 
3
مراكز بيع مواد البناء
محطات الوقود والغسيل والتشحيم
المساجد - المدارس
مدافن النفايات البلدية


#

فئة تحتاج إلى تعبئه استمارة التقييم البيئي للمشاريع التي تُعد من قِبل أحد المكاتب الاستشارية المعتمدة والمؤهلة من قبل الرئاسة العامة للأرصاد وحماية البيئة منها . . . . 
1
مجمعات الأسواق التجارية
المحلات المهنية
محلات بيع وتوزيع الغاز
المحلات التي لها علاقة بالصحة العامة




#

فئة (مشاريع) تحتاج إلى إعداد دراسة تقييم بيئي شامل واقتراح الحلول الكفيلة لتجنب أو تخفيف الآثار البيئية في أثناء اختيار الموقع والتصميم والتنفيذ والتشغيل منها . . . . 
4
المدراس
المراكز الترفيهية
سوبر ماركت
شبكات الصرف الصحي
من خطوات تقييم الأثر البيئي ويتطلب اعداد قائمة توضح هذا النشاط بكافة عناصره من حيث التخطيط والاعداد والمواد 


#

المستخدمة وكيفية التخلص من المخلفات 
2
تحليل الأثر
التمييز والاختبار
البحث عن بدائل
الإشراف


#

من خطوات تقييم الأثر البيئي التي تركز على المكونات البيئية وأهميتها وتأثيرها بالمشروع.
1
تحديد الأهداف المؤثرة والشروط المرجعية
تقييم الدراسات الخاصة بالآثار البيئية
تجنب الآثار والتعويض
التدقيق


#

تحديد الحقائق وتقييمها من حيث قوة هذا الأثر وأهمية قيمته وحقيقته .
4
الإشراف
تحليل الأثر
البحث عن البدائل
تقييم الأثر


#

إجراء يتم ممارسته خلال العمل بالنشاط التطويري لمنع أو لتقليل او إصلاح الأثر البيئي السلبي من خلال استبدال او إيجاد مصدر بديل (الإجراء التخفيفي)
1
البحث عن البدائل
تجنب الآثار والتعويض
تقييم الدراسات الخاصة بالآثار البيئية
تقييم الأثر


#

هي عملية الحد او التخفيف من المؤثرات البالغة على البيئة، وكيفية التعرض للمؤثرات التي لا يمكن تجنبها، مع الوضع في الاعتبار بان التعويض يؤدي الى زيادة التكلفة
2
تقييم الاثر
تجنب الآثار والتعويض
تحديد الأهداف المؤثرة والشروط المرجعية
البحث عن البدائل


#

تكون باتباع خطة ادارية تستند الى تقرير تقييم الأثار البيئية والذي يبين مسؤولية كل من مقدم المشروع والحكومة
3
تحديد الأهداف المؤثرة والشروط المرجعية
الإشراف
المراقبة والإدارة البيئية
التدقيق






#

هو ضمان ان جميع الجوانب الهامة المتعلقة بالمشروع ذكرت في الشروط المرجعية(متطلبات وزارة البيئة)
4
التدقيق
البحث عن البدائل
تجنب الآثار والتعويض
تقييم الدراسات الخاصه بالآثار البيئيه


#

القيام بنشاطات الترخيص واتمام عملية عقود البناء وتكون مقترحة في تقرير تقييم الأثر البيئي 
1
إقرار المشروع وشروط التراخيص
تحديد الأهداف المؤثرة والشروط المرجعية
تجنب الآثار والتعويض
تقييم الدراسات الخاصه بالآثار البيئيه


#

عبارة عن نشاط حكومي تقوم به الوزارة او سلطة البيئة للتاكد من مطابقة الشروط للترخيص
2
تقييم الدراسات الخاصه بالآثار البيئيه
الإشرا ف
التمييز والإختبار
تحديد الأهداف المؤثرة والشروط المرجعية


#

مهم في كل مراحله من بداية التفكير بالمشروع حتى اقامته
4
البحث عن البدائل
تحليل الأثر
تجنب الآثار والتعويض
التدقيق


#

هي تلك المشروعات التي توفر خدمة أو سلعة تعد حاجة أو رغبة اجتماعية حيوية دون أن تقصد تحقيق الأرباح من وراء ذلك
1
المشروعات الاجتماعية
المشروعات التجارية
المشروعات الخاصة
المشروعات العامة


#

من أنواع المشروعات الاجتماعية
4
مشاريع الاستثمارالخا ص
مشاريع الاستثمارالعام
مشاريع الاستثمارالقطاعى
مشاريع الاستثمار المادي


#

من أنواع المشروعات الاجتماعية
3
مشاريع الاستثمارالخا ص
مشاريع الاستثمارالعام
مشاريع الاستثمار البشري
مشاريع الاستثمار القطاعى


#

من امثله المشروعات التي تنصب على الاستثمار المادي
2
مشروعات التعليم
مشروعات النقل والإسكان
مشروعات الصحة
مشروعات البحث العلمي


#

من امثله المشروعات التي تنصب على الاستثمار البشري
1
مشروعات التعليم والصحة
مشروعات النقل
مشروعات الاسكان
مشروعات الصرف الزراعي


#

من خصائص المشروعات الاجتماعية
4
تنشأ بهدف الربح
وجود تنافس في استهلاك منتجاتها
تجانس مخرجاتها
عدم وجود سوق لمخرجاتها


#

من خصائص المشروعات الاجتماعية
2
تنشأ بهدف الربح
عدم وجود تنافس في استهلاك منتجاتها


#

من خصائص المشروعات الاجتماعية
3
تنشأ بهدف الربح
وجود تنافس في استهلاك منتجاتها
عدم تجانس مخرجاتها
وجود سوق لمخرجاتها


#

من خصائص المشروعات الاجتماعية
1
إلغاء دوافع الربح في نشاطها
وجود تنافس في استهلاك منتجاتها
تجانس مخرجاتها
وجود سوق لمخرجاتها


#

تعد من الطرق الشائعة في تقييم المشروعات الاجتماعية
4
الطريقة الكمية
الطريقة الوصفية
الطريقة التقديرية
الإحساسات والأحكام العامة


#

تعد من الطرق الشائعة في تقييم المشروعات الاجتماعية
3
الطريقة الكمية
الطريقة الوصفية
الاستعانة بمؤشرات مهنيه لمشاريع قائمه
الاستعانة بمؤشرات تقديريه


#

تعد من الطرق الشائعة في تقييم المشروعات الاجتماعية
1
الاسناد الى أحكام مبنيه على الخبرة 
الطريقة الوصفية
الطريقة التقديرية
الطريقة الكمية


#

تعد من الطرق الشائعة في تقييم المشروعات الاجتماعية
4
الطريقة الكمية
الطريقة الوصفية
الطريقة التقديرية
المنافع والتكاليف الاجتماعية


#

طريقه الإحساسات والأحكام العامة من الطرق الشائعة في تقييم المشروعات الاجتماعية، غالبا ما تكون غير قائمة على أسس
1
اقتصاديه
غير علميه
عشوائية
علميه


#

طريقه الإسناد الى أحكام مبنيه على الخبرة، غالبا ما تكون
3
علميه
إحصائية
تقديريه
حسابيه


#

طريقه الإسناد الى أحكام مبنيه على الخبرة، وذلك من جانب الافرا د
2
غير المختصين
المختصين
الهواه
المتدربين


#

المنافع والتكاليف المباشرة تتعلق ب
1
تحقيق الأهداف الرئيسية للمشروع
المنتجات الجانبية للمشروع
التقييم من خلال نظام السوق
كيفية تمويل المشروع




#

المنافع والتكاليف غير المباشرة تتعلق ب
2
تحقيق الأهداف الرئيسية
المنتجات الجانبية للمشروع
التقييم من خلال نظام السوق
كيفية تمويل المشروع


#

المنافع والتكاليف الملموسة يمكن تقييمها من خلال السوق اي
2
لها قيمه ثابته
لها قيمه سوقيه
لها مرونة دخليه
تدخل في انتاج خدمه وسطيه


#

من خطوات معيار فعالية التكاليف
1
تحديد الاهداف
تحديد المعوقات
تحديد الموارد
تحديد التكاليف


#

مقياس من مقاييس الفعالية، وهو يعبر عنه بالمهارات والمعارف المكتسبة من برامج تدريب العاملين على تكنولوجيا حديثه
3
عمل منجز
منتجات مصنعه
منافع محققه
أثر محقق


#

مقياس من مقاييس الفعالية، وهو يعبر عنه الذي يحدثه تشغيل المتعلمين العاطلين من أثر على المجتمع، نتيجة انخفاض معدلات الجريمة، وزيادة الديمقراطية، وكذلك الاستفادة بخبراتهم .
4
عمل منجز
منتجات مصنعه
منافع محققه
أثر محقق


#

تقوم الأسس الفلسفية/ الأيديولوجية على
1
التقييم الموضوعى
التقييم الشهرى
التقييم الشكلي
التقييم المادى




#

يعتبر من أسس تقييم المشروعات، يصلح هذا الأسلوب لتقييم المشروعات الحكومية والعامة التي تستهدف تحقيق مصلحة عامة
1
تقييم الأثر النهائي للمشروع
التقييم الشخصى
التقييم الموضعى
تقييم المنافع أو المخرجات النهائية للمشروع


#

يعتبر من أسس تقييم المشروعات، يهتم بما حققته بعض الفئات أو بعض أصحاب المصالح من مكاسب
4
تقييم الأثر النهائي للمشروع
التقييم الشخصى
التقييم الموضعى
تقييم المنافع أو المخرجات النهائية للمشروع


#

منهج ينصب على ما إذا كانت هذه الأهداف قد تحققت أم لا؟
2
مناهج التقييم على أساس إداري
مناهج تقييم الأهدا ف
مناهج التقييم على أساس المستهلكين
مناهج قائمه على الخبرة


#

مناهج تقوم على أساس توفير معلومات التقييم للمساعدة في اتخاذ القرارات
1
مناهج التقييم على أساس إداري
مناهج تقييم الأهداف
مناهج التقييم على أساس المستهلكين
مناهج قائمه على الخبرة


#

مناهج تعكس اهتمام المستخدمين النهائيين عموما للسلع والخدمات التي يوفرها المشرو ع
3
مناهج التقييم على أساس إداري
مناهج تقييم الأهداف
مناهج التقييم على أساس المستهلكين
مناهج قائمه على الخبرة


#

تعد من أقدم مناهج التقييم وتقوم على الأحكام الشخصية المهنية، وتؤدي عملية التقييم إما بشكل رسمي أو غير رسمي سواء قام بها شخص واحد أو فريق عمل .
4
مناهج التقييم على أساس إداري
مناهج تقييم الأهداف
مناهج التقييم على أساس المستهلكين
مناهج قائمه على الخبرة



#

مناهج أهم عيوبها الاعتماد الكبير على الخبرات الشخصية، وعدم توافر معايير قياسية سواء ضمنية أو منشورة
3
مناهج التقييم على أساس إداري
مناهج تقييم الأهداف
منهج التقييم على أساس المشاركة
مناهج قائمه على أساس التعلم


#

مشاركة أي شخص في منافعها لن يؤدى إلى حرمان أو تخفيض منافع أشخاص آخرين إذ أن تلك المنافع تكون متاحة للجميع وبدون تعارض.. يطلق على هذا المبدأ
1
مبدأ الاستبعاد
مبدأ المعارضة
مبدأ الاستغلال
مبدأ التمييز


#

من مجالات قياس فعالية البرامج للمشاريع التي لا تهدف للربح
3
مؤشرات ايجابيه
منتجات وسطيه
أثر محقق
منتجات بديله


#

مناهج تقييم المشروعات وفقا للأسس النظرية والعلمية
3
اربعه مناهج
خمسه مناهج
ست مناهج
ثمانية مناهج


#

إجمالي التغييرات الإيجابية والسلبية الناشئة عن أحد المشروعات التي تهدف لصنعه على فئة مستهدفة من المجتمع
2
الأثر الاقتصادى
الأثر الاجتماعى
الأثر السياسى
الأثر المالى


#

يركز على التأثيرات الخاصة بمقترحات المشروعات ومعرفة عواقب المشروعات المقترحة على الإنسان، ولفت الانتباه إلى تخفيف تلك العواقب
1
تقييم الأثر الاجتماعى
تقييم الأثر الاقتصادى
تقييم الأثر السياسى
تقييم الأثر المالى



#

يرى البعض التأثيرات الاجتماعية في علاقتها بتغيرات البيئية ذات طابع
2
واسع
محدو د
منتشر
غير محدود


#

من الخصائص الرئيسية والمرتبطة بالتأثيرات الاجتماعية ويعبر عنها النماذج الجديدة للتوظيف/ الدخل
2
التغيير السكانى
التغيير الاقتصادى
التغيير البيئي
التغيير المؤسسى


#

من الخصائص الرئيسية والمرتبطة بالتأثيرات الاجتماعية ويعبر عنها التغيير في هيكل الحكومة المحلية أو القيادة التقليدية، تقسيم الناطق بالقوانين، امتلاك الأر ض
4
التغيير السكانى
التغيير الاقتصادى
التغيير البيئي
التغيير المؤسسى


#

يمكن أن تقسم الأنواع الأساسية للتأثيرات الاجتماعية الى
2
أربعه فئات متداخله
خمس فئات متداخله
ست فئات متداخله
عشر فئات متداخله


#

من الأنواع الأساسية للتأثيرات الاجتماعية وهي تؤثر على طريقة تصرفات الإنسان وعلاقة العائلة، الأصدقاء
1
تأثيرات على طريقه المعيشة
التأثيرات الثقافية
التأثيرات المجتمعية
تأثيرات الترفيه


#

من الأنواع الأساسية للتأثيرات الاجتماعية وهي تؤثر على البنية الأساسية، الخدمات، المنظمات المتطوعة وأنشطة الشبكا ت
3
تأثيرات على طريقه المعيشة
التأثيرات الثقافية
التأثيرات المجتمعية
تأثيرات الترفيه



#

من الأنواع الأساسية للتأثيرات الاجتماعية وهي تؤثر على الحالة النفسية والبدنية والاجتماعية
3
تأثيرات على طريقه المعيشة
التأثيرات الثقافية
التأثيرات الصحية
تأثيرات الترفيه


#

من الأنواع الأساسية للتأثيرات الاجتماعية وهي تؤثر على العادات المرتبطة، واللغة، المعتقدات الدينية وعناصر أخرى لتي بها التميز العرقي أو الاجتماعي . 
2
تأثيرات على طريقه المعيشة
التأثيرات الثقافية
التأثيرات الصحية
تأثيرات الترفيه


#

مرحلة من دورة حياة المشروع تبدأ بالإعلان عن المشروع والذي يمكن أن يكون له تأثيرات اجتماعية
4
الاغلاق والتنازل
الانشاء / التنفيذ
التشغيل والصيانة
التخطيط أو السياسة المتطورة


#

مرحلة من دورة حياة المشروع دائما ما تأخذ التأثير الاجتماعي الأكبر، من وجهة النظر الاجتماعية هو عمل تمزيقى
2
الاغلاق والتنازل
الانشاء / التنفيذ
التشغيل والصيانة
التخطيط أو السياسة المتطورة


#

هذه المرحلة تتعلق بتجهيز وتهيئة الأرض ثم بناء المنشأة وشق الطرق والمنافع، وينتج عنها مخاطر تؤثر على جودة الحياة للسكان المحليين
2
الاغلاق والتنازل
الانشاء / التنفيذ
التشغيل والصيانة
التخطيط أو السياسة المتطورة


#

هذه المرحلة غالبا تشكل توترا في البنية الأساسية للمجتمع ويمكن أن تشير بانفجار ودورة انكسارية
2
الاغلاق والتنازل
الانشاء / التنفيذ
التشغيل والصيانة
التخطيط أو السياسة المتطورة


#

هذه المرحلة من المشروع تستمر لسنوات عديدة. في كثير من الحالات، تكون فترة نسبيا ثابتة مقارنة بالتغيير الاجتماعي الذي يحدث أثناء الإنشاء، يحتاج لعمالة إضافية وهناك وافدون جدد
3
الاغلاق والتنازل
الانشاء / التنفيذ
التشغيل والصيانة
التخطيط أو السياسة المتطورة


#

هذه المرحلة لها تأثير اجتماعي مميز، وخاصة عندما تكون المنشأة هي الدعامة الأساسية لقاعدة الاقتصاد المحلى أو لمستخدم الوحيد لمجتمع منقب عن الهدف الواحد
1
الاغلاق والتنازل
الانشاء / التنفيذ
التشغيل والصيانة
التخطيط أو السياسة المتطورة


#

تتضمن الفائدة التي تعود من عمل تقييم تأثير اجتماعي منتظم
2
ارتفاع التكلفة
تجنب التأخير والعوائق
ارتفاع التأثير على الأفرا د
عدم تعزيز الفوائد للمتضررين


#

تتضمن الفائدة التي تعود من عمل تقييم تأثير اجتماعي منتظم
3
ارتفاع التكلفة
ارتفاع التأثير على الأفرا د
تحسين المشروعات المقترحة
عدم تحسين العلاقات بالمجتمع وزيادة الخوف


#

تتضمن الفائدة التي تعود من عمل تقييم تأثير اجتماعي منتظم
1
تقليل التكلفة
ارتفاع التأثير على الأفرا د
عدم تجنب العوائق
عدم تعزيز الفوائد للمتضررين


#

من خطوات عمليه تقييم التأثير الاجتماعي، ويتم بها تحليل وتوقع التأثيرات المحتملة المشروع المقترح والبدائل
4
المشاركة العامة
تعريف البدائل
دراسة النطا ق
تقدير التأثيرات المحتملة


#

من خطوات عمليه تقييم التأثير الاجتماعي، ويتم بها تطوير وتنفيذ خطة لاشتراك العامة بفعالية ولاشتراك كل المعنيين والمهتمين والمتأثرين
1
المشاركة العامة
تعريف البدائل
دراسة النطاق
تقدير التأثيرات المحتملة


#

من خطوات عمليه تقييم التأثير الاجتماعي، ويتم بها توثيق تأثير المشروع المقترح على ترابط البيئة البشرية/ المساحة، والشروط والاتجاهات الاجتماعية الحالية
4
المشاركة العامة
تعريف البدائل
دراسة النطاق
ظروف دراسة خط الاساس


#

يعتبر حاسم لكسب فهم أفضل للتأثيرات الاجتماعية وكيفية إدارتها مع ذلك بالممارسة.
2
ممارسة المشروع
التحليل المسبق للمشروع
تشغيل المشروع
انشاء المشروع


#

يرون ان مخاطره الغلق البكر يفوق أهمية الفائدة الكامنة من عمل الدراسة
3
الحكومات
متخذي القرار
المطورون
المجتمعات


#

من خطوات عمليه تقييم التأثير الاجتماعي، ويتم بها تحديد الأهمية للتأثيرات الاجتماعية المعرفة إلى أولئك المتأثرين بها .
4
التخفيف
المراقبة
التغيير في البدائل
التنبؤ وتقييم ردود الأفعال على التأثيرات


#

من خطوات عمليه تقييم التأثير الاجتماعي، ويتم بها تطوير وتطبيق خطته بهدف التفادي أولا ، وثانيا للتقليل، وثالثا للتعويض عن الآثار المعاكسة
1
التخفيف
المراقبة
التغيير في البدائل
التنبؤ وتقييم ردود الأفعال على التأثيرات


#

من خطوات عمليه تقييم التأثير الاجتماعي، ويتم بها تمييز التأثيرات اللاحقة للمشروع المقترح، متضمنا الرتبة الثانية/ ثالثة للتأثيرات .
4
التخفيف
المراقبة
التغيير في البدائل
تقدير التأثيرات الغير مباشره والمتراكمة


#

تخضع عمليه تقييم الأثار البيئية للمشروعات ل
2
ثلاث مبادئ رئيسيه
أربعة مبادئ رئيسيه
ست مبادئ رئيسيه
عشرة مبادئ رئيسيه



#

استنادا الى مبادئ تقييم الأثار البيئية للمشروعات، تم تصنيف المشروع الى
1
ثلاث قوائم
أربعة قوائم
خمس قوائم
سبع قوائم


#

احدى تصنيفات المشروعات، وتضم المنشآت والمشروعات ذات التأثيرات البيئية الضئيلة
1
القائمة (أ)
القائمة (ب)
القائمة (ج)
القائمة السوداء



#

احدى تصنيفات المشروعات، وتضم المنشآت والمشروعات التي يمكن أن تحدث آثار بيئية مهمة
2
القائمة (أ)
القائمة (ب)
القائمة (ج)
القائمة السوداء


#

احدى تصنيفات المشروعات، وتضم المنشآت والمشروعات التي يمكن أن تحدث آثار بيئية خطيرة وتحتاج إلى دراسة بيئية متكاملة
3
القائمة (أ)
القائمة (ب)
القائمة (ج)
القائمة الرمادية


#

من مراحل تقييم الأثر البيئي، ويعرف الجمع المخطط والمنهجي للبيانات البيئية من اجل الوفاء بأهداف واحتياجات بيئية محددة
3
التخفيف
الوصف
الرصد البيئى
التقرير



#

من خطوات تقييم الأثر البيئي، يتولى جهاز شئون البيئة أو الفرع الإقليمي مراجعة وتقييم المستندات أو إبداء ملاحظاته وإرسالها إلى إدارة شئون البيئة بالمحافظة متضمنة الاقتراحات الممكنة لأجراء ما يلزم اتخاذها لضمان حماية البيئة وذلك خلال . . . . يوما من استلام المستندات كاملة
2
6
60
30
66


#

هو المسئول عن إدارة نظام تقييم الأثر البيئي ومراجعة الدراسات وتقديم الرأي والمشورة للجهات الإدارية المختصة
3
مقدمو المشروعات
معدو الدراسة
جهاز شئون البيئة
رئاسة المدينة الصناعية

`;

const getImage = (text: string): [boolean, string, string] => {
    let [, a, b] = /^!\[(.*)\]\((.*)\)$/.exec(text) || [];
    return [!!b, a, b];
};
const ProjEval2 = q.split('#').map((q, i): SelectionQuestion => {
    let _answers = q
            .trim()
            .split('\n')
            .filter((a) => a.trim().length > 0),
        questionText = _answers.shift() || 'failed to parse question',
        ans = Number(_answers.shift()?.trim()),
        [hasImage, imageAlt, image] = getImage(_answers[0]);
    if (hasImage) _answers.shift();

    const answers: Answer[] = _answers.map(
        (a, ai): Answer => ({
            id: uuid(),
            text: a,
            correct: ai + 1 === ans,
        })
    );

    return selectionQuestion({ questionText, answers, image, imageAlt });
});

export default ProjEval2;
