import { v4 as uuid } from 'uuid';
import { question } from './data';

export const q = `

الحوادث المتعلقة بسلامة الغذاء قد ترجع الي
3
تلوث المواد الخام
عدم مراعاة الاشتراطات الصحية أثناء الأعداد والتجهيز
جميع ما سبق


#
تشير المخاطر الكيميائية لسلامة الغذاء الي
3
بقايا مواد التنظيف والتطهير
المبيدات الحشرية
جميع ما سبق


#
تلوث الغذاء هو
1
وصول أي من الملوثات إلى الغذاء أو البيئة المحيطة بالغذاء
وجود عيوب ظاهرية بالغذاء
أي تغير يحدث في الغذاء يؤثر علي خواصه


#
يحدد من المسئول عن عملية التنظيف والتطهير ومدي تكراريتها والمواد المستخدمة
1
برنامج التنظيف والتطهير
السياسة الصحية
دليل الجودة


#
من وسائل مكافحة الحشرات الطائرة داخل مصانع الأغذية
2
الصواعق الكهربائية
المصائد الضوئية
مساحق التعفير


#
نظام تحليل المخاطر ونقاط التحكم الحرجة هو
1
نظام وقائي ورقابي لتأكيد سلامة الغذاء
نظام لإدارة الجودة الشاملة
جميع ما سبق


#
يتكون فريق سلامة الغذاء من
4
إدارة الجودة
إدارة الإنتاج
إدارة الصيانة
جميع ما سبق




#
من البرامج التمهيدية لسلامة الغذاء
3
التنظيف والتطهير
مكافحة الآفات
جميع ما سبق


#
يعتبر وجود قطع زجاج أو أشياء غريبة في الغذاء من مصادر الخطر
1
الفيزيائية
البيولوجية
الكيميائية


#
من البرامج الأولية المتعلقة بالتشريعات الخاصة بنظام الهاسب والتي يجب تطويرها بالمنشأة قبل تطبيق نظام الهاسب بها وهي
4
إجراءات تتعلق بالمنشأة وإجراءات مراقبة الموردين
إجراءات المواصفات القياسية للمنتجات وإجراءات تنظيف معدات الإنتاج
إجراءات التنظيف والتطهير للمنشاة وإجراءاته الشؤون الصحية للأفراد
جميع ما سبق


#
يجب أن تلتزم إدارة الشركة باتخاذ كل الاحتياطيات اللازمة للتأكد من تطبيق العناصر الأتية لبرنامج الممارسات الشخصية الجيدة
4
السيطرة على الأمرا ض
الاعتبارات الصحية الشخصية
الملابس والالتهابات والأربطة المفتوحة
جميع ما سبق


#
يجب أن تكون الأرضيات في صالات الإنتاج
4
من مواد غير سامة وغير ممتصة ومن النوع المقاوم للماء
في حالة جيدة وذات ميل تجاه بالوعات الصرف
المواد المستخدمة في وصلات الأرضيات غير منفذة
جميع ما سبق


#
	مناطق الإنتاج التي يتم بها تجهيز منتجات الأغذية عالية الخطورة يجب أن تكون ذات
1
ضغط إيجابي
ضغط سلبي
منخفضة الضغط
جميع ما سبق خطأ






#
الخواص الواجب توافرها في مواد التنظيف المستخدمة في مصانع الأغذية
3
سهلة الامتزاج بالماء
لها قدرة علي استحلاب الدهون
جميع ما سبق


#
العوامل التي تحدد اختيار مادة التنظيف في مصانع الأغذية
3
نوعيه المياه المستخدمة
نوع نظام التنظيف المستخدم
جميع ما سبق


#
نظام تنظيف يتم من خلاله عمل دورة مغلقة لمحاليل التنظيف والتطهير دون تفكيك خطوط الإنتاج
1
CIP
COP
SOP


#
للتحقق من كفاءة تنظيف وتطهير الأسطح يتم
3
اخد مسحة من السطح وتحليلها ميكروبيولوجيا
الكشف عن المواد العضوية المتبقيةاخد مسحة من السطح وتحليلها ميكروبيولوجيا
جميع ما سبق


#
في مناطق التخزين يجب أن تكون هناك مسافة ....... سم بين الرف السفلي والأرضيات
2
100 سم
15 سم
يمكن التخزين علي الأرضيات مباشرة


#
اشتراطات يجب تطبيقها على العاملين في التصنيع الغذائي
3
تغطية الشعر بغطاء راس - لا يسمح باستخدام طلاء الأظافر
عدم ارتداء أي مجوهرات أو إكسسوارات
جميع ما سبق


#
يجب أن تتوافر مع المواد الكيميائية المستخدمة في عمليات التنظيف
1
(MSDS) بطاقة المادة الكيميائية
موافقة وزارة الصحة
جميع ما سبق


#
يجب تدوير المخزون في مخازن الأغذي ة علي أساس
3
ما تم تخزينه أولاً يتم إخراجه أولا
الأقرب في انتهاء فترة الصلاحية يخرج أولا
Aاو B يمكن استخدام



#
من الاشتراطات الأساسية لغرف التبريد والتجميد ما يلى
4
-18م) ≥مؤشرات بيان درجة الحرارة ظاهرة ( التبريد +1:+4م /التجميد   
توافر ستائر بلاستيك على الأبواب من الداخل لعدم تسريب درجة التبريد أثناء فتح الأبواب
توافر سُترات واقية من البرد للعاملين
جميع ما سبق


#
يجب أن يترك حول المحيط الداخلي لكل مخزن مسافة ...... سم ويطلق على هذه المسافة خط محيط التفتيش
1
50
100
150
25


#
عبارة عن إزالة لأسباب التلوث المرئية
1
التنظيف
التطهير
التعقيم
التهوية


#
يحدد جدول التنظيف والتطهير في المنشآت الغذائية
4
مكان التنظيف ومن المسئول
مواد التنظيف والتطهير
معدل التنظيف والتطهير
جميع ما سبق


#
تقوم مراقبة المخازن بالتفتيش على المخازن للتأكد من
4
وجود كارت التعريف ( كارت الصنف) علي الأصناف بالمخازن طبقا لنوعها
اكتشاف أي تلف أو تدهور بالمخزون
متابعة وضع المنتجات في مكانها المخصص
جميع ما سبق


#
هو الحالة المرضية التي تحث نتيجة تناول غذاء إما لكونه ملوثا بالميكروبات الممرضة أو نواتجها السامة أو نتيجة تناول ملوثات كيميائية
1
تسمم الغذاء
فساد الغذاء
انخفاض جودة الغذاء
جميع ما سبق




#
الحوادث المتعلقة بسلامة الأغذية على المستوي العالمي لوجود مصادر خطر بيولوجية أو كيميائية أو طبيعية ترجع الي واحد أو أكثر من العوامل التالية
4
تلوث المواد الخام
عدم مراعاة الاشتراطات الصحية في عمليات التجهيز، التصنيع، التعبئة، التخزين والنقل
التلوث من الأسطح غير النظيفة الملامسة للغذاء وعدم كفاءة برامج التنظيف والتطهير
جميع ما سبق


#
مكونات طبيعية تض ر بصحة الإنسان مثل أجزاء الحشرات أو مخلفات الإنسان )كالشعر( أو المجوهرات، أو خشب، أو حصى، أو شظايا معدنية، أو قطع زجاج... إلخ
1
مصادر خطر فيزيائية
مصادر خطر كيميائية
مصادر خطر بيولوجية
مصادر خطر إشعاعية


#
موا د كيميائية تضر بصحة الإنسان مثل بقايا المبيدات والأسمدة ومواد التنظيف والتطهير والشحوم والمواد المضافة أو الحافظة وبقايا المضادات الحيوية والأدوية البيطرية... إلخ
2
مصادر خطر فيزيائية
مصادر خطر كيميائية
مصادر خطر بيولوجية
مصادر خطر إشعاعية


#
كائنات حية ممرضة أو منتجة للسموم وتشمل البكتريا والفطريات والفيروسات والطفيليات وغيرها... إلخ
3
مصادر خطر فيزيائية
مصادر خطر كيميائية
مصادر خطر بيولوجية
مصادر خطر إشعاعية


#
إجراء أو نشاط أو فعل يمكن استخدامه لمنع أو إزالة مخاطر سلامه الغذاء أو خفضها الى المستوي المقبول
1
اجراء سيطرة
الحد الحرج
نقطة تحكم حرجة
إجراء تصحيحي


#
مستوي مخاطر سلامة الغذاء والذي يجب ألا يتم تجاوزه في المنتج النهائي
1
المستوي المقبول
الحد الحرج
نقطة تحكم حرجة
إجراء السيطرة


#
وجود عامل بيولوجي أو كيميائي أو فيزيائي بالغذاء (أو يتعلق بالغذاء ) ويمكن أن يسبب تأثير ضار بصحة الإنسان(بما فيها الحساسية)
1
مصدر خطر
نقطة تحكم حرجة
حد حرج


#
والتي تفصل بين ما هو مقبول وغير مقبول  Measurable value القيمة القابلة للقياس
1
الحد الحرج
المستوي المقبول
نقطة تحكم حرجة
الإجراءات القياسية للتشغيل


#
الحد الحرج لعمليه التبريد
2
15 م
4 م
10 م
25 م


`;

const getImage = (text: string): [boolean, string, string] => {
    let [, a, b] = /^!\[(.*)\]\((.*)\)$/.exec(text) || [];
    return [!!b, a, b];
};
const Qualtiy2 = q.split('#').map((q, i): Question => {
    let _answers = q
            .trim()
            .split('\n')
            .filter((a) => a.trim().length > 0),
        questionText = _answers.shift() || 'failed to parse question',
        ans = Number(_answers.shift()?.trim()),
        [hasImage, imageAlt, image] = getImage(_answers[0]);
    if (hasImage) _answers.shift();

    const answers: Answer[] = _answers.map(
        (a, ai): Answer => ({
            id: uuid(),
            text: a,
            correct: ai + 1 === ans,
        })
    );

    return question({ questionText, answers, image, imageAlt });
});

export default Qualtiy2;
