import { v4 as uuid } from 'uuid';
import { multiChoiceQuestion, parseTest } from './data';

export const q = `
#multichoice#
#qt#

تحقيق رغبات المستهلك في المنتج الغذائي . . . . 
2
مرا قبة الجودة
جودة الغذاء
سياسة الجودة
خطة الجوده

#q#
المحافظة على الجودة في مستوى قبولها لدى المستهلك  . . . . 
1
مرا قبة الجودة
جودة الغذاء
سياسة الجودة
خطة الجوده


#q#
الشروط والتوجيهات التي تحددها المنشأ ة أو المؤسسة في مجال الجودة والمعدة مسبقا بواسطة الإدارة العليا . . . . 
3
مرا قبة الجودة
جودة الغذاء
سياسة الجودة
خطة الجوده

#q#
جميع الإجراءات المخططة والمنطقية اللازمة لتوفير الثقة المناسبة للمنتج لتلبية احتياجات محددة . . . . 
3
مرا قبة الجودة
جودة الغذاء
توكيد الجودة
خطة الجوده

#q#
وثيقة تفصيلية للإجراءات العملية النوعية للجودة والموارد المخصصة لها وترتيب تسلسل أنشطتها لتحقيق جودة منتج معين . . . . 
4
مرا قبة الجودة
جودة الغذاء
توكيد الجودة
خطة الجوده




#q#
الهيكل التنظيمي والمسئوليات والطرق والعمليات وإجراءات العمل والموارد المخصصة لتوضيح مسئوليات . . . . 
2
مرا قبة الجودة
نظام الجودة
توكيد الجودة
خطة الجوده


#q#
وثيقة معتمدة لتطبيق اشتراطات وخصائص وأنواع لمنتج معين وهى تصدر لتحديد التعامل مع الأخرين . . . . 
1
المواصفة 
نظام الجودة
سلسلة الجودة
 خطة الجوده

#q#
هي تسلسل مفهوم الجودة من خلال جميع الأشخاص والعمليات بالمصنع بدء ا من الموردين إلى العملاء ونهاية بالمستهلك . . . . 
3
 المواصفة 
نظام الجودة
سلسلة الجودة
 خطة الجوده

#q#
الفحص الدوري المنتظم للوقو ف على مدى الالتزام بأنشطة الجودة كما هو مخطط لها من ترتيبات وهل هذه الترتيبات تحقق الغرض منها . . . . 
4
المواصفة 
نظام الجودة
سلسلة الجودة
 مراجعة الجودة


#q#
وثيقة لو صف طريمة الصناعة القياسية وكيفية التحكم في ظروفها من حيث خطوات الصناعة، المصنع الآلات ، العمال ، الاختبارات المعملية في مصانع الأغذية لأنتاج غذاء آمن صحيا . . . . 
2
سجلات الجودة 
ممارسة التصنيع الجيد
الاعتماد
دليل الجودة

#q#
عملية يتم فيها مطابقة لمتطلبات المواصفات الدولية حيث تقوم الجهات المرخص لها بذالك والمعتمدة من هيئة (ايزو) بتقييم الشركة للتأكد من أن نظام الجودة مطبق فعليا ويتم منحها شهادة الجودة . . . . 
3
سجلات الجودة 
ممارسة التصنيع الجيد
الاعتماد
دليل الجودة



#q#
الوثيقة الأساسية المستخدمة للإرشاد والتطبيق لنظام إدارة الجودة وتصف هذه الوثيقة كل عناصر نظام الجودة الذى يحتاجه المشروع لتلبية احتياجات الجودة . . . . 
4
	سجلات الجودة 
ممارسة التصنيع الجيد
الاعتماد
دليل الجودة

#q#
سجلات مصممة لتوضيح نتائج الجودة المحددة للمنتج النهائي وأثناء التصنيع وللتحقق من التنفيذ الفعال لنظام إدارة الجودة كما توفر السجلات أيضآ وصول المنتج إلى المستوى المطلوب . . . . 
1
سجلات الجودة 
ممارسة التصنيع الجيد
الاعتماد
دليل الجودة

#q#
وثيقة لنظام إدارة الجودة يوضح فيها احتياجات تدريب العاملين في المجالات التي تحتاج إلى مهارة معينة . . . . 
2
سجلات الجودة 
وثائق التدريب
الاعتماد
غذاء امن

#q#
هو الغذاء الخالي من الملوثات والمخاطر والذي لا يسبب أذى أو مرض للأنسان على المدى البعيد أو القريب وذالك بناء على نتائج تحاليل معملية وتجارب على الحيوانات . . . . 
4
امان الغذاء
تلوث الغذاء
فترة الصلاحية
غذاء امن
#q#
هي جميع الإجراءات اللازمة لإنتاج غذاء صحى غير ضار بصحة الإنسان . . . . 
1
امان الغذاء
تلوث الغذاء
فترة الصلاحية
غذاء امن

#q#
هو وصول أي من الملوثات السابق ذكرها إلى الغذاء أو البيئة المحيطة بالغذاء . . . . 
2
امان الغذاء
تلوث الغذاء
فترة الصلاحية
غذاء امن

#q#
هي فترة زمنية يحتفظ فيها المنتج الغذائي بصفاته الأساسية ويظل حتى نهايتها مستساغا ومقبولا وصالحا للاستهلاك الآدمي وذلك تحت ظروف محددة للتعبئة والنقل والتخزين . . . . 
3
امان الغذاء
تلوث الغذاء
فترة الصلاحية
غذاء امن

#q#
هو التاريخ الذى يحدد نهاية فترة الصلاحية . . . . 
1
تاريخ انتهاء الصلاحية
تلوث الغذاء
فترة الصلاحية
غذاء امن

#q#
أماكن جيدة لجمع المعلوما ت عن رضاء العملاء وكذالك عن العملاء المحتملين حيث يمكن سؤالهم عن احتياجاتهم وتوقعاتها . . . . 
1
مراكز الاتصال
تلوث الغذاء
فترة الصلاحية
غذاء امن


#q#
منظمة الصحة العالمية . . . . 
1
W.H.O
H.O.W
CODEX
E.O. S

#q#
الهيئة المصرية العامة للمواصفات والجودة . . . . 
4
W.H. O
UPC
CODEX
E.O. S



#q#
لجنة دستور الغذاء  . . . . 
3
W.H. O
UPC
CODEX
E.O. S
 
#q#
نظم التشفير الخطى والأكثر شيوعا ويتم استخدامه ف ي الدول الأوروبية وكثير من دول العالم كما أنه من المتبع في مصر . . . .
4
EAN- ١١
EAN-٣١
UPC
EAN-١٣

#q#
هو فعل لاستبعاد سبب عدم المطابقة الذى تم اكتشافه أو أي وضع غير مرغوب فيه . . . . 
4
مراكز الاتصال
الفعل
فترت الصلاحية
الفعل الصحيحى

#q#
دورة التحسين (دائرة دايمينج) تعريف باسم  . . . . 
1
PDCA
UPC
PDAC
ACDP
#q#
تثبيت الصفات الطبيعية والكميائية (التركيبية ) والحيوية والحسية وغيرها لاى مادة غذائية مطروحة للاستهلاك المباشر او التصنيعى . . . . 
2
مراقبة الجودة
المواصفات القياسية 
توكيد الجودة 
خطة الجودة 
#q#
أى مادة تستخدم او تدخل فى تصنيع او تجهيز المادة الغذائية بما فى ذلك المواد المضافة والتى تظل موجودة فى المنتج النتهائى .
1
المكون
المواصفات القياسية 
الجودة
فترة الصلاحية

#q#
الحوادث المتعلقة بسلامة الغذاء قد ترجع الى: . . . . 
3

تلوث المواد الخام 
عدم مرعاة الاشتراطات الصحية اثناء الاعداد والتجهيز
جميع ما سبق

#q#
تشير المخاطر الكميائية لسلامة الغذاء الى :  . . . . 
3
بقايا مواد التنظيف والتطهير 
المبيدات الحشرية 
جميع ما سبق

#q#
يحدد من المسئول عن عملية التنظيف والتطهير ومدى تكرارتيها و المواد المستخدمة  . . . . 
1
برنامج التنظيف والتطهير
السياسة الصحية 
دليل الجودة

#q#
من وسائل مكافحة الحشرات الطائرة داخل المصانع الاغذية : . . . . 
4
الصواعق الكهربائية 
المصائد الضوئية 
مساحق االتعفير
جميع ما سبق

#q#
نظام تحليل المخاطر ونقاط التحكم الحرجة هو :  . . . . 
3
نظام وقائى ورقابى لتأكيد سلامة الغذاء
نظام الادارة الجودة الشاملة 
جميع ما سبق

#q#
من البرامج التمهيدية لسلامة الغذاء  . . . . 
3
التنظيف و التطهير 
مكافحة الافات 
جميع ما سبق
#q#
يعتبر وجود قطع زجاج او اشياء غريبة فى الغذاء من مصادر الخطر : . . . . 
1
الفيزيائية 
البيولوجية 
الكميائية 
جميع ما سبق


#q#
من برامج الاولية المتعلقة بالتشريعات الخاصة بنظام الهاسب والتى يجب تطويرها بالمنشاة قبل تطبيق نظام الهاسب بها وهى :  . . . . 
4
اجراءات تتعلق بالمنشاة واجراءات مراقبة الموردين
اجراءات المواصفات القياسية للمنتجات و اجراءات تنظيف معدات الانتاج 
اجراءات التنظيف والتطهير للمنشاة و اجراءاتة الشؤون الصحية للافراد
جميع ما سبق
#q#
يجب ان تلتزم ادارة الشركة باتخاذ كل الاحتياطيات اللازمة للتاكد من تطبيق العناصر الاتية لبرنامج الممارسات الشخصية الجيدة . . . . 
4
السيطرة على الامراض
الاعتبارات الصحيحة الشخصية 
الملابس والالتهابات و الاربطة المفتوحة 
جميع ما سبق
#q#
يجب ان تكون الارضيات فى صالات الانتاج:  . . . . 
4
من مواد غير سامه وغير ممتصة ومن النوع المقاوم للماء
فى حالة جيدة وذات ميل تجاه بالوعات الصرف
المواد المستخدمة فى صلات الارضيات غير منفذة 
جميع ما سبق
#q#
مكونات طبيعية تضر بصحة الانسان (كالشعر ) او المجوهرات او خشب او حصى او شظايا معدنية او قطع زجاج ..الخ  . . . . 
1
مصادر خطر فيزيائية 
مصادر خطر كيميائية  
مصادر خطر بيولوجية 
مصادر خطر اشعاعية 
#q#
مواد كيميائية تضر بصحة الانسان مثل بقايا المبيدات و الاسمدة ومواد التنظيف والتطهير والشحوم والمواد المضافة او الحافظة وبقايا المضادات الحيوية والاداوات البيطرية  . . . . الخ
2
مصادر خطر فيزيائية 
مصادر خطر كيميائية  
مصادر خطر بيولوجية 
مصادر خطر اشعاعية 
#q#
كائنات حية ممرضة اومنتجة للسموم وتشمل البكتريا و الفطريات و الفيروسات والطفيليات وغيرها  . . . . الخ
3
مصادر خطر فيزيائية 
مصادر خطر كيميائية  
مصادر خطر بيولوجية 
مصادر خطر اشعاعية 


#q#
اجراء او انشاط او فعل يمكن استخدامه لمنع او ازالة مخاطر السلامه الغذاء او حفضها   الى المستوى المقبول  . . . . 
1
اجراء سيطرة
الحد الحرج 
نقطة تحكم حرجة
اجراء تصحيحى 
#q#
مستوى مخاطر سلامة الغذاء والذى يجب الا يتم تجاوزه فى المنتج النهائى  . . . . 
1
المستوى المقبول 
الحد الحرج 
نقطة تحكم حرجة
اجراء سيطرة
#q#
وجود عامل بيولوجى او كيميائى او فيزيائى بالغذاء (اويتعلق بالغذاء) ويمكن ان يتسبب تاثير ضار بصحة الانسان (بما فيها الحساسية) . . . . 
1
مصدر خطر
نقطة تحكم حرجة
الحد الحرج 
مصادر خطر اشعاعية 
#q#
   والتى تفصل بين ما هو مقبول  . . . . Measurable value القيمة القابلة للقياس  
3
الحد الحرج 
المستوى المقبول 
نقطة تحكم حرجة
الاجراءات القياسية للتشغيل 
#q#
الحد الحرج لعملية التبريد  . . . . 
2
15 م
4 م
10 م
25 م



#q#
الرسم التوضيحي لدائرة  . . . . 
3
![](b.png)
دميج 
مديج 
ديمنج 
جمديج


#q#
المربع واحد يدل على
1
![](b.png)
D
P
C
A


#q#
المربع الثاني يدل على
2
![](b.png)
D
P
C
A

#q#
المربع الثاني يدل على
3
![](b.png)
D
P
C
A

#q#
المربع الرابع يدل على
4
![](b.png)
D
P
C
A


#q#
يدل هذا الشكل على المعاملة الغذاء بواسطة 
3
![test alt](c.png)
البسترة
التعميم
الإشعاع
الكيماوي

#q#
رقم 13 تعنى انة مكون من 13 رقم  مقسمة الى  . . . . 
2
5 مجموعات  
4 مجموعات  
6 مجموعات  
2 مجموعات 

#q#
اول ثلاث ارقام على الشمال تمثل كود 
1
كود البلد
كود المصنع 
كود المنطقة 
كود المنتج
#q#
الاربعة الارقام التالية تمثل كود 
2
كود البلد
كود المصنع 
كود المنطقة 
كود المنتج
#q#
الخمسة ارقام التالية تمثل كود  . . . . 
4
كود البلد
كود المصنع 
كود المنطقة 
كود المنتج
#q#
اخر رقم يعبر عن كود  . . . . 
3
كود البلد
كود المصنع 
كود المراجعة 
كود المنتج
#q#
توكيد الجودة  . . . . 
1
نظام ادارة بيروقراطى
نظام ادارة ديموقراطى
نظام ادارة راس مالى
غير ذالك

#q#
توكيد الجودة  . . . . 
1
اجراءات غير مرنة
اجراءات مرنة
اجراءات متوازنة
غير ذالك
#q#
الادارة الشاملة للجودة . . . . 
1
يهتم بالتحسين المستمر 
لا يهتم بالتحسين المستمر 
مطلوب بدرجة متوسطة بالتحسين المستمر
غير ذالك
#q#
توكيد الجودة  . . . . 
2
يهتم بالتحسين المستمر 
لا يهتم بالتحسين المستمر 
مطلوب بدرجة متوسطة بالتحسين المستمر
غير ذالك
#q#
الادارة الشاملة للجودة . . . . 
2
نظام ادارة بيروقراطى
نظام ادارة ديموقراطى
نظام ادارة راس مالى
غير ذالك
#q#
الباركود للمنتجات الغذائية فى مصر هو  . . . . 
1
622
633
262
362
#q#
استخدام مصطلح حلال لا يطلق على  . . . . 
1
الضفادع 
السمن 
الرنجة
لحوم الماعز



#q#
 هيئة الايزو هى وكالة متخصصة فى التقييس مقرها  . . . . 
2
مصر 
جنيف
كوبا
امريكا
#q#
تتكون اللجنة التنفذية للجنة دستور الاغذية تتكون من  . . . . 
1
1 رايس و 3 نواب و6 اعضاء تنتخبهم اللجنة من بين اعضاء
1 رايس و 2 نواب و4 اعضاء تنتخبهم اللجنة من بين اعضاء
1 رايس و 3 نواب و8 اعضاء تنتخبهم اللجنة من بين اعضاء
لا توجد اجابة
#q#
عند استعمال الترتيب الابجدى يتبع الترتيب التالى  . . . . 
1
ابجد هوز حطى كلمن سعفص قرشت تخذ ضظع
ابجد هوز حطى كلمن 
سعفص قرشت تخذ ضظع
لا توجد اجابة
#q#
هو تنفيذ مجموعة مخططة من الملاحظات او القياسات للتاكد من ان مقاييس التحكم تعمل كمال هو مخطط لها . . . . 
2
الجودة
Monitoring الرصد 
Control measures
لا توجد اجابة


`;

const Qualtiy1 = parseTest('إدارة جودة — 1', q);
export default Qualtiy1;
