import { v4 as uuid } from 'uuid';
import { selectionQuestion } from './data';

export const q = `

جودة الغذاء
1
هي تحقيق رغبات المستهلك في المنتج الغذائي

هي المحافظة على الجودة في مستوى قبولها لدى المستهلك

هي جميع الإجراءات المخططة والمنطقية اللازمة لتوفير الثقة المناسبة للمنتج لتلبية احتياجات محددة

#
مراقبة الجودة
1
هي المحافظة على الجودة في مستوى قبولها لدى المستهلك 
هي وثيقة تفصيلية للإجراءات العملية النوعية للجودة والموارد المخصصة لها وترتيب تسلسل أنشطتها لتحق يق جودة منتج معين
هي تسلسل مفهوم الجودة من خلال جميع الأشخاص والعمليات بالمصنع بدءا من الموردين إلى العملاء ونهاية بالمستهلك

#
سياسة الجودة
1
هي الشروط والتوجيهات التي تحددها المنشأة أو المؤسسة في مجال الجودة والمعدة مسبقا بواسطة الإدارة العليا
وهى تعنى الفحص الدوري المنتظم للوقوف على مدى الالتزام بأنشطة الجودة كما هو مخطط لها من ترتيبات وهل هذه الترتيبات تحقق الغرض منها
هي الشروط والتوجيهات التي تحددها المنشأة أو المؤسسة في مجال الجودة والمعدة مسبقا بواسطة الإدارة العليا

#
توكيد الجودة
1
هي جميع الإجراءات المخططة والمنطقية اللازمة لتوفير الثقة المناسبة للمنتج لتلبية احتياجات محددة
هي جميع الإجراءات اللازمة لإنتاج غذاء صحى غير ضار بصحة الإنسان
الهيئة المصرية العامة للمواصفات والجودة

#
خطة الجودة
1
هي وثيقة تفصيلية للإجراءات العملية النوعية للجودة والموارد المخصصة لها وترتيب تسلسل أنشطتها لتحقيق جودة منتج معين
لجنة دستور الغذاء 
هو التاريخ الذى يحدد نهاية فترة الصلاحية

#
نظام الجودة
1
هو الهيكل التنظيمي والمسئوليات والطرق والعمليات وإجراءات العمل والموارد المخصصة لتوضيح مسئوليات
هي تحقيق رغبات المستهلك في المنتج الغذائي
هي عملية اعتماد الشركة على أنها مطابقة لمتطلبات المواصفات الدولية حيث تمو الجهات المرخص لها بذا لك والمعتمدة من هيئة ال الجودة مط بق فعليا فتعتمد الشركة ويتم منحها شهادة تسمى بال شهادة الجودة (ISO) بتقييم الشركة للتأكد من أن نظام

#
المواصفة
1
هي وثيقة معتمدة لتطب يق اشتراطات وخصائص وأنواع لمنتج معين وهى تصدر لتحديد التعامل مع الأخرين 
هي تسلسل مفهوم الجودة من خلال جميع الأشخاص والعمليات بالمصنع بدءا من الموردين إلى العملاء ونهاية بالمستهلك
هو التاريخ الذى يحدد نهاية فترة الصلاحية

#
سلسلة الجودة
1
هي تسلسل مفهوم الجودة من خلال جميع الأشخاص والعمليات بالمصنع بدءا من الموردين إلى العملاء ونهاية بالمستهلك
هي جميع الإجراءات المخططة والمنطقية اللازمة لتوفير الثقة المناسبة للمنتج لتلبية احتياجات محددة
وهى تعنى الفحص الدوري المنتظم للوقوف على مدى الالتزام بأنشطة الجودة كما هو مخطط لها من ترتيبات وهل هذه الترتيبات تحقق الغرض منها

#
مراجعة الجودة
1
وهى تعنى الفحص الدوري المنتظم للوقوف على مدى الالتزام بأنشطة الجودة كما هو مخطط لها من ترتيبات وهل هذه الترتيبات حق الغرض منها
هي الوثيقة الأساسية المستخدمة للإرشاد والتطبيق لنظام إدارة الجودة وت صف هذه الوثيقة كل عناصر نظام الجودة الذى يحتاجه المشروع لتلبية احتياجات الجودة
هي جميع الإجراءات اللازمة لأنتاج غذاء صحى غير ضار بصحة الإنسان

#
ممارسة التصنيع الجيد
1
وهى وثيقة لوصف طريقة الصناعة القياسية وكيفية التحكم في ظروفها من حيث خطوات الصناعة، المصنع الآلات ، العمال ، الاختبارات المعملية في مصانع الأغذية لإنتاج غذاء آمن صحيا
هو وصول أي من الملوثات السابق ذكرها إلى الغذاء أو البيئة المحيطة بالغذاء
من نظم التشفير الخطى والأكثر شيوعا ويتم استخدامه في الدول الأوروبية وكثير من دول العالم كما أنه من المتبع في مصر

#
الاعتماد
1
هي عملية اعتماد الشركة على أنها مطابقة لمتطلبات المواصفات الدولية حيث تمو الجهات المرخص لها بذالك والمعتمدة من هيئة ال تسمى بال شهادة الجودة (ISO) بتقييم الشركة للتأكد من أن نظام الجودة مط بق فعليا فتعتمد الشركة ويتم منحها شهادة
هي وثيقة لنظام إدارة الجودة يوضح فيها احتياجات تدريب العاملين في المجالات التي تحتاج إلى مهارة معينة
هو التاريخ الذى يحدد نهاية فترة الصلاحية

#
دليل الجودة
2
هي وثيقة لنظام إدارة الجودة يوضح فيها احتياجات تدريب العاملين في المجالات التي تحتاج إلى مهارة معينة
هي الوثيقة الأساسية المستخدمة للإرشاد والتطبيق لنظام إدارة الجودة وتصف هذه الوثي قة كل عناصر نظام الجودة الذى يحتاجه المشروع لتلبية احتياجات الجودة
من نظم التشفير الخطى والأكثر شيوعا ويتم استخدامه في الدول الأوروبية وكثير من دول العالم كما أنه من المتبع في مصر

#
سجلات الجودة
3
هي وثي قة لنظام إدارة الجودة يوضح فيها احتياجات تدريب العاملين في المجالات التي تحتاج إلى مهارة معينة
هي وثيقة لنظام إدارة الجودة يوضح فيها احتياجات تدريب العاملين في المجالات التي تحتاج إلى مهارة معينة
هي سجلات مصممة لتوضيح نتائج الجودة المحددة للمنتج النهائي وأثناء التصنيع وللتحقق من التنفيذ الفعال لنظام إدارة الجودة كما توفر السجلات أيضآ وصول المنتج إلى المستوى المطلوب

#
وثائق التدريب
1
هى وثيقة لنظام إدارة الجودة يوضح فيها احتياجات تدريب العاملين في المجالات التي تحتاج إلى مهارة معينة
هو فعل لاستبعاد سبب عدم المطابقة الذى تم اكتشافه أو أي وضع غير مرغوب فيه
هي جميع الإجراءات المخططة والمنطقية اللازمة لتوفير الثقة المناسبة للمنتج لتلبية احتياجات محددة

#
غذاء أمن
3
هي جميع الإجراءات المخططة والمنطقية اللازمة لتوفير الثقة المناسبة للمنتج لتلبية احتياجات محددة 
هو وصول أي من الملوثات السابق ذكرها إلى الغذاء أو البيئة المحيطة بالغذاء 
هو الغذاء الخالي من الملوثات والمخاطر والذي لا يسبب أذى أو مرض للأنسان على المدى البعيد أو القريب وذالك بناء على نتائج تحاليل معملية وتجارب على الحيوانات

#
أمان الغذاء
3
هو وصول أي من الملوثات السابق ذكرها إلى الغذاء أو البيئة المحيطة بالغذاء
هو الغذاء الخالي من الملوثات والمخاطر والذى لا يسبب أذى أو مرض للأنسان على المدى البعيد أو القريب وذالك بناء على نتائج تحاليل معملية وتجارب على الحيوانات
هي جميع الإجراءات اللازمة لإنتاج غذاء صحى غير ضار بصحة الإنسان



#
تلوث الغذاء
1
هو وصول أي من الملوثات السابق ذكرها إلى الغذاء أو البيئة المحيطة بالغذاء
هو الغذاء الخالي من الملوثات والمخاطر والذى لا يسبب أذى أو مرض للأنسان على المدى البعيد أو القريب وذالك بناء على نتائج تحاليل معملية وتجارب على الحيوانات
هي جميع الإجراءات اللازمة لأنتاج غذاء صحى غير ضار بصحة الإنسان

#
فترة الصلاحية
1
هي فترة زمنية يحتفظف يها المنتج الغذائي بصفاته الأساسية ويظل حتى نهايتها مستساغا ومقبولا وصالحا للاستهلاك الآدمي وذلك تحت ظروف محددة للتعبئة والن قل والتخزين
هو التاريخ الذى يحدد نهاية فترة الصلاحية
هي جميع الإجراءات اللازمة لأنتاج غذاء صحى غير ضار بصحة الإنسان

#
تاريخ انتهاء الصلاحية
2
هي فترة زمنية يحتفظ فيها المنتج الغذائي بصفاته الأساسية ويظل حتى نهايتها مستساغا ومقبو لا وصالحا للاستهلاك الآدمي وذلك تحت ظروف محددة للتعبئة والنقل والتخزين
هو التاريخ الذى يحدد نهاية فترة الصلاحية
هو وصول أي من الملوثات السابق ذكرها إلى الغذاء أو البيئة المحيطة بالغذاء

#
مراكز الاتصال
3
لجنة دستور الغذاء 
الهيئة المصرية العامة للمواصفات والجودة
وتعتبر مراكز الاتصال أماكن جيدة لجمع المعلومات عن رضاء العملاء وكذالك عن العملاء المحتملين حيث يمكن سؤالهم عن احتياجاتهم وتوقعاتها
#

W. H. O اختصار ل
3
لجنة دستور الغذاء
وهى وثيقة لو صف طريقة الصناعة القياسية وكيفية التحكم في ظروفها من حيث خطوات الصناعة ، المصنع ، الآلات ، العمال ، الاختبارات المعملية في مصانع الأغذية لإنتاج غذاء آمن صحيا
منظمة الصحة العالمية
#
(E. O. S)
3
منظمة الصحة العالمية 
لجنة دستور الغذاء 
الهيئة المصرية العامة للمواصفات والجودة
#
اختصارل : (CODEX)
1
لجنة دستور الغذاء 
منظمة الصحة العالمية 
منظمة الصحة العالمية

#
النظام الأوروبي 13 – EAN
1
من نظم التشفير الخطى والأكثر شيوعا ويتم استخدامه في الدول الأوروبية وكثير من دول العالم كما أنه من المتبع في مصر
من نظم التشفير الدائري والأكثر شيوعا ويتم استخدامه في الدول الأوروبية وكثير من دولالعالم كما أنه من المتبع في مصر
من نظم التشفير المنقط والأكثر شيوعا ويتم استخدامه في الدول الأوروبية وكثير من دول العالم كما أنه من المتبع في مصر

#
الفعل التصحيحي
3
هو فعل التصحيح سبب عدم المطابقة الذى تم اكتشافه أو أي وضع غير مرغوب فيه
هو فعل القبول سبب عدم المطابقة الذى تم اكتشافه أو أيوضع غير مرغوب فيه
هو فعل لاستبعاد سبب عدم المطابقة الذى تم اكتشافه أو أي وضع غير مرغوب فيه

#
الرسم التوضيحي لدائرة . . . . 
3
![](a.png)
دميج 
مديج 
ديمنج 
جمديج

#
المربع واحد يدل على
1
![](b.png)
D
P
C
A

#
المربع الثاني يدل على
2
![](b.png)
D
P
C
A
#
المربع الثاني يدل على
3
![](b.png)
D
P
C
A
#
المربع الرابع يدل على
4
![](b.png)
D
P
C
A

#
يدل هذا الشكل على المعاملة الغذاء بواسطة 
3
![](c.png)
البسترة
التعميم
الإشعاع
الكيماوي

#
هي اختصار EAN ال
1
European Article Number ل 
EGYPT Article Number ل 
Euro Article Number ل 
Epean Article Number ل 



#
رقم 13 تعنى أنه مكون من 13 رقم مقسمة إلى . . . . مجموعات
2
5 مجموعات
4 مجموعات
6 مجموعات
2 مجموعات

#
أول ثلاثة أرقام على الشمال تمثل كود
1
كود البلد
كود المصنع
كود المنطقة
كود المنتج

#
الأربعة أرقام التالية تمثل كود
2
كود البلد
كود المصنع
كود المنطقة
كود المنتج
#
الخمسة أرقام التالية تمثل كود
4
كود البلد
كود المصنع
كود المنطقة
كود المنتج
#
أخر رقم يعبر عن كود
4
كود البلد
كود المصنع
كود المراجعة
كود المنتج

#
توكيد الجودة
1
نظام إدارة بيروقراطي
نظام إدارة ديموقراطى
نظام إدارة رأس مالي




#
توكيد الجودة
1
إجراءات غير مرنة
إجراءات مرنة
إجراءات متوازنة

#
الإدارة الشاملة للجودة
2
إجراءات غير مرنة
إجراءات مرنة
إجراءات متوازنة.

#
الإدارة الشاملة للجودة
1
يهتم بالتحسين المستمر
لا يهتم بالتحسين المستمر
مطلوب بدرجة متوسطة بالتحسين المستمر
#
توكيد الجودة
2
يهتم بالتحسين المستمر
لا يهتم بالتحسين المستمر
مطلوب بدرجة متوسطة بالتحسين المستمر

#
الإدارة الشاملة للجودة
2
نظام إدارة بيروقراطي
نظام إدارة ديموقراطى
نظام إدارة رأس مالي

#
الباركود للمنتجات الغذائية في مصر هو
1
622
633
366
362

#
استخدام مصطلح "حلال" لا يطلق على
1
الضفادع
السمن
الرنجة
لحوم الماعز



#
هيئة الأيزو هي وكالة متخصصة في التقييس مقرها
2
مصر
جنيف
كوبا
أمريكا

#
تتكون لجنة دستور الأغذية من
1
اللجنة التنفيذية: تتكون من رئيس اللجنة ونواب الرئيس الثلاثة ، 6 أعضاء تنتخبهم اللجنة من بين أعضائها
اللجنة التنفيذية: تتكون من رئيس اللجنة ونواب الرئيس الاثنين ، 4 أعضاء تنتخبهم اللجنة من بين أعضائها
اللجنة التنفيذية: تتكون من رئيس اللجنة ونواب الرئيس الثلاثة، 8 أعضاء تنتخبهم اللجنة من بين أعضائها

#
عند استعمال الترتيب الأبجدي يتبع الترتيب التالي
1
أبجد هوز حطي كلمن سعفص قرشت ثخد ضظغ
أبجد هوز حطي كلمن
سعفص قرشت ثخد ضظغ
#
Monitoring الرصيد: 
1
هو تنفيذ مجموعة مخططة من الملاحظات أو القياسات للتأكد من أن مقاييس التحكم تعمل كما هو مخطط لها
هى رسم تخطيطي منهجي يمثل تتابع وانسياب خطوات الصناعة
الموجودة في خطة الهاسب Control measures هي الدليل المتحصل عليه على "سلامة الغذاء" والذى يدل على أن مقاييس التحكم 


`;

const getImage = (text: string): [boolean, string, string] => {
    let [, a, b] = /^!\[(.*)\]\((.*)\)$/.exec(text) || [];
    return [!!b, a, b];
};
const Qualtiy1 = q.split('#').map((q, i): SelectionQuestion => {
    let _answers = q
            .trim()
            .split('\n')
            .filter((a) => a.trim().length > 0),
        questionText = _answers.shift() || 'failed to parse question',
        ans = Number(_answers.shift()?.trim()),
        [hasImage, imageAlt, image] = getImage(_answers[0]);
    if (hasImage) _answers.shift();

    const answers: Answer[] = _answers.map(
        (a, ai): Answer => ({
            id: uuid(),
            text: a,
            correct: ai + 1 === ans,
        })
    );

    return selectionQuestion({ questionText, answers, image, imageAlt });
});

export default Qualtiy1;
