import{r as u,j as o}from"./react-2785220f.js";import{c as M}from"./react-dom-ee953f5b.js";import{c as h}from"./@reduxjs-4d3d6157.js";import{v as m}from"./uuid-a960c1f4.js";import{T as D,a as k}from"./@azure-6e10cfef.js";import{d as B}from"./device-detector-js-8f92b5ad.js";import"./firebase-86d04f59.js";import{i as F,P as R,_ as S,p as _,G as L}from"./@firebase-3a88a537.js";import"./scheduler-04ce0582.js";import"./tslib-87ab7759.js";import"./idb-81bdbf9b.js";(function(){const s=document.createElement("link").relList;if(s&&s.supports&&s.supports("modulepreload"))return;for(const i of document.querySelectorAll('link[rel="modulepreload"]'))r(i);new MutationObserver(i=>{for(const n of i)if(n.type==="childList")for(const a of n.addedNodes)a.tagName==="LINK"&&a.rel==="modulepreload"&&r(a)}).observe(document,{childList:!0,subtree:!0});function e(i){const n={};return i.integrity&&(n.integrity=i.integrity),i.referrerPolicy&&(n.referrerPolicy=i.referrerPolicy),i.crossOrigin==="use-credentials"?n.credentials="include":i.crossOrigin==="anonymous"?n.credentials="omit":n.credentials="same-origin",n}function r(i){if(i.ep)return;i.ep=!0;const n=e(i);fetch(i.href,n)}})();const U=h("questions/add",t=>({payload:{question:t}})),H=h("questions/remove",t=>({payload:{questionId:t}})),Z=h("questions/update",(t,s)=>({payload:{questionId:t,...s}})),y=h("questions/set",(t,s)=>({payload:{questions:t,shuffle:s}})),P=h("questions/shuffle",(t,s)=>({payload:{questions:t,shuffle:s}})),q=h("questions/answers/selectOne",(t,s)=>({payload:{questionId:t,answerId:s}})),G=h("questions/answers/unselectOne",t=>({payload:{questionId:t}})),O=h("questions/answers/unselectAll"),K=h("questions/answers/shuffleOne",(t,s,e)=>({payload:{questionId:t,question:s,shuffle:e}}));h("questions/answers/shuffleAll",(t,s)=>({payload:{questions:t,shuffle:s}}));const V=(t,s)=>{if(s.type===U.type)return[...t,s.payload.question];if(s.type===H.type)return t.filter(e=>e.id!==s.payload.questionId);if(s.type===Z.type)return t.map(e=>e.id===s.payload.questionId?{...e,...s.payload}:e);if(s.type===y.type){const{shuffle:e,questions:r}=s.payload;return e?[...r].sort(()=>Math.random()-.5):[...r]}if(s.type===P.type){const{shuffle:e,questions:r}=s.payload;if(!e){const i=t.reduce((n,a)=>({...n,[a.id]:a.answers}),{});return r.map(n=>({...n,answers:i[n.id]}))}return[...t].sort(()=>Math.random()-.5)}if(s.type===q.type)return t.map(e=>e.id===s.payload.questionId?{...e,correct:e.answers.some(r=>r.correct&&r.id===s.payload.answerId),selectedId:s.payload.answerId,answers:e.answers.map((r,i)=>({...r,selected:r.id===s.payload.answerId}))}:e);if(s.type===G.type)return t.map(e=>{var r;return e.id===((r=s==null?void 0:s.payload)==null?void 0:r.questionId)?{...e,answers:e.answers.map((i,n)=>({...i,selected:!1}))}:e});if(s.type===O.type)return t.map(e=>({...e,selectedId:void 0,correct:void 0,answers:e.answers.map(r=>({...r,selected:!1}))}));if(s.type===K.type){let{questionId:e,question:r,shuffle:i}=s.payload;return i?t.map(n=>{if(n.id===e){const a=[...n.answers];for(let c=a.length-1;c>0;c--){const l=Math.floor(Math.random()*(c+1));[a[c],a[l]]=[a[l],a[c]]}return{...n,answers:a}}return n}):t.map(n=>n.id===e?r:n)}return[]},$={subject:"",questions:[],unbluredQuestion:"",sidebarOn:!1,testModeOn:!1,correctAnswers:!1,shuffleQuestions:!1,shuffleAnswers:!1,blurAnswers:!1};function g({id:t,questionText:s,answers:e,image:r,imageAlt:i}){return{id:t||m(),questionText:s,answers:e,get correctAnswers(){return this.answers.filter(n=>n.correct&&n.selected).length},image:r,imageAlt:i}}const W=`

عرف . . . . الإرشاد الزراعي بأنه جهاز تعليمي غير مدرسي يتعلم فيه الكبار والشباب بالممارسة لمواجهة احتياجاتهم وتسهيل حل مشكلاتهم
1
كيلس وهيرن
ناب
بيراد فيلد
شانج


#
الأهداف التي يمكن عن طريقها الوصول إلى الأهداف العامة فمثلاً هدف رفع الكفاءة الإنتاجية النباتية يتطلب رفع إنتاجية المحاصيل المختلفة
2
الأهداف الأساسية الشاملة
الأهداف التنفيذية
الأهداف العامة
الأهداف التأكيدية


#
عبارة عن أهداف محددة تهتم بالنواحي الاقتصادية والاجتماعية والأخلاقية الخاصة بالسكان الريفيين، ولكنها ترتبط بشكل مباشر بالإرشاد الزراعي
3
الأهداف الأساسية الشاملة
الأهداف التنفيذية
الأهداف العامة
الأهداف التأكيدية


#
تعتبر خصائص الأهداف الإرشادية كل مما يلي ما عدا
4
واضحة المعالم ومحددة
مشتركة البناء
تتوافق مع نظام المجتمع
كسب ثقه جمهور المسترشدين


#
من مبادئ الإرشاد الزراعي كل ما يلي ما عدا
1
تطبيق المبادئ والأسس
وضع الأهداف الإرشادية المناسبة
البدء في العمل مع الزراع
مبدأ لا مركزيه الإدارة


#
أحد فروع المعرفة الذي يهتم بتنمية الخبرات والمعارف وقدرات المرأة الريفية هو
1
الاقتصاد المنزلي
علم الاقتصاد الزراعي
علم البيئة
علم الاجتماع الريفي


#
يساعد المرشد الزراعي على فهم الجماعات والعوامل التي تؤثر عليها وتدفعها الى العمل الفعال من خلال الطرق الإرشادية
4
علم الاقتصاد الزراعي
الاقتصاد المنزلي
علم البيئة
علم النفس


#
هي إرسال رسالة إلى المرسل تفيد استلام رسالته وفهمها
4
الاتصال
المستقبل
قناة الاتصال
التغذية الراجعة


#
كل مما يلي من أدوار الإرشاد الزراعي ما عدا
2
المساهمة في تنميه الموارد البشرية
البدء في العمل مع الزراع
توعيه المرأة الريفي ة
نشر وتبني المبتكرات


#
	يرتبط الاتصال . . . . باستخدام الأفراد مجموعة من الحركات
3
الاتصال اللفظي
مهارة الاستماع
الاتصال الغير اللفظي
مهارة الاتصال الكتابي


#
تعتمد مهارة . . . . علي نقل الرسالة بواسطة استخدام الكلمات مشافهة من قبل المرسل
1
مهارة التحدث
مهارة الاستماع
مهارة القرأه
نبرات الصوت


#
يعتمد الاتصال غير اللفظي على
4
مهارة الاتصال الكتابي
مهارة الاستماع
مهارة القرأه
نبرات الصوت




#
العوامل المؤثرة في الاتصال هي
4
مهارة التحدث
مهارة الاستماع
مهارة الاتصال الكتابي
الخبرة المشتركة


#
يقصد ب . . . . تقارب خبرات المرسل والمستقبل في موضوع الحديث
2
الكفاية اللغوية
الخبرة المشتركة
الكفاية الاتصالية
الضجة والتشويش


#
هي الظروف المادية والتقنية المحيطة بالموقف الاتصالي
1
التشويش
الكفاية الاتصالية
الخبرة المشتركة
الكفاية اللغوية


#
يقصد ب . . . . الموقف النفسي أو الحالة الشعورية التي يشعر بها كل من المرسل والمستقبل اتجاه بعضها بناء على خبرة سابقة
1
الافتراضات السابقة
الكفاية اللغوية
الخبرة المشتركة
الكفاية الاتصالية


#
يُعرف الذكاء . . . . أنه القدرة على معرفة الذات والتواصل معها.
3
الذكاء اللغوي
الذكاء الاجتماعي
الذكاء الذاتي
الذكاء الوجداني


#
هي المنطقة التي يعرفها الفرد على ذاته ويعرفها الآخرين عنه 
1
المنطقة المكشوفة
منطقة الأسرار
المنطقة المظلمة
المنطقة العمياء




#
من خصائص نمط الشخصية مدعي المعرفة أنه
1
يحتقر الآخرين
يشكوك إلي الآخرين
يقضي زمنا طويلا في التحدث
يفتقد إلي الثقة بالنفس


#
من صفات فريق العمل الفعال كل مما يلي ما عدا
4
تبادل المعلومات بين أعضاء الفريق
التمتع بدافعية عالية بالأداء الجاد
المساعدة والدفاع عن أعضاء الفريق
يعاملون الأخرين بتعا ل


#
هي ما تستطع بمفردها أن تنتقل وتوصل الرسالة الإرشادية
1
الطريقة الإرشادية
جميع ما سبق
المعينة الإرشادية
غير ذلك


#
هي تلك المعينات التي تعتمد على حاسة البصر في نقل، وتوضيح، وتفسير المعلومات، والأفكار.
1
المعينات البصرية
المعينات السمعية والبصرية
المعينات السمعية
غير ذالك


#
من طرق الاتصال بالجماعات
1
المسابقات
الملصقات
المتاحف
المعارض


#
تعتبر . . . . من طرق الاتصال بالأفراد
1
الزيارات الحقلية
المحاضرة
الندوة
الحلقة الدراسية




#
من مكونات الإرشاد الإلكتروني
3
الجانب المادي
الجانب البشري
أ، ب معا
غير ذلك


#
كل مما يلي من مواصفات الإرشاد الإلكتروني ما عدا
4
التأهل العالمي والمستمر
يعتمد المرشد علي استخدام التقنيات الحديثة
حصول المزارع علي المعلومات في أي وقت
البنيه التحتية للتنظيمات الإرشادية


#
من العوامل المؤثرة على استخدام الإرشاد الإلكتروني
3
رفع كفاءة المرشد 
الشعور بالارتياح لدى المزارع
نوع التكنولوجيا المستخدمة
 الاستفادة من عنصر الوقت


#
الإرشاد الإلكتروني أهمية كبيرة تتمثل في
3
يعتمد المرشد على استخدام تقنيات الاتصال الحديثة
يتعلم المزارع عن طريق النشاط الذاتي والممارسة
يكون لها السبق في التنمية
 يسود في الدول المتقدمة


#
كل مما يلي من فوائد الإرشاد الإلكتروني ما عدا
4
مساعدة الزراع علي المشاركة
إمكانية الاتصال مع القيادات المحلية
الاستفادة من عنصر الوقت
التأهيل العالي والمستمر للمرشد الزراعي


#
يقدم الإرشاد . . . . نوع جديد من الثقافة وهي الثقافة الرقمية
1
الإرشاد الإلكتروني
الإرشاد التقليدي
 أ، ب معا
غير ذلك




#
كل مما يلي من عيوب الإرشاد الزراعي الإلكتروني ما عدا
1
التكاليف المادية المنخفضة
يتطلب بنية تحتية اتصاليه
ضياع حقوق النشر والملكية الفكرية
يحتاج لمراقبة المسترشدين أثناء القيام بالأنشطة التعليمية


#
هو انتقال المستحدثات الزراعية المناسبة والصالحة للتطبيق في الريف من المراكز البحثية ووصولها للريفيين في وقت زمني محدد
1
الانتشار
التبني
المستحدث
الانتباه


#
من صفات الفكرة المستحدثة
2
يتطلب بنية تحتية اتصاليه
انسجام الفكرة مع القيم السائدة
يكون لها السبق في التنمية
يسود في الدول المتقدمة


#
هي الدرجة التي يتم فيها تجريب المستحدث على نطاق ضيق
3
الميزة النسبية
انسجام الفكرة مع القيم السائدة
القابلية للتقسيم
درجة تعقيد الفكرة المستحدثة


#
هي الدرجة التي تتفوق بها الفكرة المستحدثة عن غيرها عن الأفكار السابقة .
1
الميزة النسبية
انسجام الفكرة مع القيم السائدة
القابلية للتقسيم
درجة تعقيد الفكرة المستحدثة


#
ثالث مراحل عملية التبني
4
مرحلة الوعي
مرحلة التجريب
مرحلة الاهتمام
مرحلة التقييم




#
مبدأ . . . . يضم جميع جوانب المشروع أو المجتمع أو الأنشطة
2
الواقعية
الشمول
التكامل
ترتيب الأولويات


#
مبدأ . . . . يقوم على إعادة ترتيب الحاجات والمشكلات
4
الواقعية
الشمول
التكامل
ترتيب الأولويات


#
من مزايا البرنامج الإرشادي المكتوب
4
يراعي اهتمامات المسترشدين
يهيئ الجو لاكتشاف القدرات
تحديد الحاجات والمشكلات
يساعد المؤسسات الاخرى علي تفهم مشكلات المنطقة


#
من خصائص البرنامج الإرشادي الجيد
2
يؤدي الى معرفة الاحتياجات التدريبية للعاملين
يهيئ الجو لاكتشاف القدرات
يؤدي الى توحد في الفهم بين كل العاملين والمشتركين
توجيه العاملين على تنفيذ ما ورد به من أهداف وإجراءات


#
البيانات . . . . توضح مدى استخدام الزراع للأساليب والأفكار الزراعية الجديدة
2
البيانات الاجتماعية
البيانات التكنولوجية
البيانات الاقتصادية
البيانات التشغيلية


#
تقوم . . . . على ترجمة بيانات الوضع الراهن إلى معلومات قابلة الاستعمال والاستفادة منها
1
تحليل الموقف
جمع البيانات
تحديد الحاجات والمشكلات
تحديد الأهداف




#
عبارة عن مقارنة بين وضعين هما وضع سابق ووضع راهن ويتم قياس التقدم الحادث في سلوك الزراع وأفكارهم
3
وضع خطة العمل
إعادة النظر في البرنامج
 تقدير مدى التقدم الحادث
 تنفيذ خطة العمل


#
هي عبارة عن الخطوة الأخيرة في العمل في البرامج الإرشادية
3
وضع خطة العمل
 تقدير مدي التقدم الحادث
 إعادة النظر في البرنامج
 تنفيذ خطة العمل


#
تتضمن خطة العمل تنفيذ البرنامج كل مما يلي ما عدا
4
المشاكل المراد معالجتها
 وصف موجز لنوع العمل
 الأهداف المراد تحقيقها 
تقييم الفرد للأخرين


#
يمكن تقسيم التقييم وفقا للوقت إلى
1
التقييم القبلي
تقييم الفرد
التقييم الذاتي
تقييم المجموعة


#
التقييم . . . . هو الذي يحدث أثناء تنفيذ وتطبيق البرنامج
1
التقييم البنائي
 التقييم الشخصي
 التقييم الأولي
 التقييم النهائي


#
هو ذلك النوع من التقييم الذي يتم فيه تحديد الاحتياجات التعليمية وتحديد المستوي الذي يمكن أن تبدأ منه عملية التعلم
1
التقييم الأولي
التقييم الشخصي
التقييم البنائي
التقييم النهائي




#
هو التقييم الذي يهتم بقياس الأهداف العامة
4
التقييم الأولي
التقييم الشخصي
التقييم البنائي
التقييم النهائي


#
تشمل خطوات عملية التقييم الإرشادي
1
تحديد المشكلة
تقييم الفرد للأخرين
وصف موجز لنوع العمل
تحديد نقاط الضعف واقتراح التحسينات


#
تعتبر . . . . أقل المستويات التعليمية دقة للتقييم الإرشاد ي
1
الملاحظة اليومية العرضية
دراسة الحالة
الملاحظة المنتظمة
الدراسات الإرشادية


#
يسمى بالتقييم المتزامن، والتقييم التراكمي اللاحق ، والتقييم التكويني
2
تقييم ذاتي
تقييم نهائي
تقييم قبلي
تقييم مستمر


#
 تجمع بين أكثر من نوع واحد من طرق معاملة الرسالة
1
طرق مختلطة
طرق إيضاحيه
طرق كتابيه
طرق كلامية


#
كل مما يلي من مجالات التقييم الإرشادي ما عدا
4
تقييم الجهاز الإرشادي 
تقييم تخطيط البرنامج الإرشادي
 تقييم الطرق والوسائل 
تقييم الفرد للأخرين




#
يمكن تقسيم التقييم وفقا للقائم بعملية التقييم
1
تقييم ذاتي
 تقييم نهائي
 تقييم قبلي
 تقييم مستمر


#
يمكن تقسيم التقييم وفقا للغرض إلي
4
تقييم مستمر 
تقييم قبلي
 تقييم بعدي 
تقييم نهائي او شخصي


#
يفضل الاعتماد على مقياس . . . . في حالة قصور ميزانية الإرشاد الزراعي
2
معدل الاتصال 
التكلفة النسبية للتبني 
معدل التبني
 جميع ما سبق


#
التحدث بلغة متخصصه لا يتقنها المرسل أو المستقبل
2
الغموض اللغوي
 الغموض التقني
 الغموض الثقافي
 غموض المعني


#
كل مما يلي من عوائق وصول المعنى ما عدا
3
الغموض 
عدم الملائمة
 حال المستقبل 
الأحكام المسبقة


#
من عوائق وصول المعنى من جانب المرسل
4
الأحكام المسبقة 
الاستدلال الزائف 
التعميم الخاطئ 
الاستطراد




#
  يهدف إلى الكشف عن مواطن القوة والضعف أثناء وبعد الأداء
4
تقدير الذات 
تعزيز الذات
 لوم الذات 
نقد الذات


#
القدرة على ملاحظة الفروق بين الأشخاص في أمزجتهم وطبائعهم ودوافعهم ومقاصدهم
2
الذكاء العاطفي 
الذكاء الاجتماعي 
الذكاء اللغوي 
الذكاء الذاتي


#
القدرة على تنظيم حالة المرء النفسية ومنع الآسي أو الألم من شل القدرة على التفكير ، والقدرة على التعاطف والشعور بالأمل
1
الذكاء العاطفي 
الذكاء الاجتماعي 
الذكاء اللغوي 
الذكاء الذاتي


#
معلومات لا يعرفها الفرد عن ذاته ، ولكنها ظاهرة للآخرين
1
المنطقة العمياء
 منطقة الأسرار
 المنطقة المكشوفة 
المنطقة المجهولة


#
هي منطقة غير معروفة للفرد ولا للآخرين ، وتمثل جميع أبعاد شخصياتنا
4
المنطقة العمياء 
منطقة الأسرار 
المنطقة المكشوفة 
المنطقة المجهولة


#
كل مما يلي من تصنيف نمط الإدراك ما عدا
4
السمعي 
البصري 
الحسي 
الكتابي




#
كل مما يلي من تصنيف السلوك التفاعلي ما عدا . . . . 
4
العنيد 
الثرثار 
مدعي المعرفة 
العصبي


#
عملية تتم بين طرفين أو أكثر ويتم من خلالها تبادل الآراء والأفكار حول موضوع معين دون وجود عوائق
1
الحوار 
الاتصال 
الاستماع 
الاستعلاء


#
يحاول أن يتصيد سلبيات المتحدث من خصائص
2
العنيد 
المتعالي 
مدعي المعرفة 
الباحث عن الأخطاء


`,z=t=>{let[,s,e]=/^!\[(.*)\]\((.*)\)$/.exec(t)||[];return[!!e,s,e]},X=W.split("#").map((t,s)=>{var d;let e=t.trim().split(`
`).filter(p=>p.trim().length>0),r=e.shift()||"failed to parse question",i=Number((d=e.shift())==null?void 0:d.trim()),[n,a,c]=z(e[0]);n&&e.shift();const l=e.map((p,f)=>({id:m(),text:p,correct:f+1===i}));return g({questionText:r,answers:l,image:c,imageAlt:a})}),J=`
بصفه عامة يمكن القول أن الاقتصاد هو
1
علم إدارة الموارد الاقتصادية
علم إدارة الأزمات
علم إدارة الموارد الاجتماعية
علم إدارة الموارد الاجتماعية والأزمات
#


يبحث علم الاقتصاد تفسير سلوك الفرد فيما يتعلق باستخدام المواد الاقتصادية بهدف تحقيق
3
الرفاهية الاجتماعية للمجتمع
الاستقرار السياسي
الرفاهية الاقتصادية للمجتمع
الاستقرار الاقتصادي
#

من وحدات القرار الاقتصادي
3
الأسر
الخدمات العامة
المنشآت التجارية
جميع ما سبق

#

يمكن التمييز بين استخدامات للموارد في
2
التجارة
الاستهلاك والإنتاج
التصدير
غير ذلك
#


البيانات الاقتصادية . . . . وذلك لتأثيرها بالبعد الزمني
4
ثابتة
مستقرة
متحركة
ليست ثابتة
#

البيانات الاقتصادية تتأثر ب
1
المعطيات النفسية والاجتماعية
بالمعطيات الاجتماعية
بالمعطيات النفسية
بالمعطيات الداخلية
#

من طبيعة التحليل الاقتصادي
3
بعض العوامل الأخرى ثابتة
بعض العوامل الأخرى متغيرة
بقاء كافة العوامل الأخرى على حالها
كافة العوامل الأخرى متغيرة
#
هو  Model النموذج
2
علاقة بين عوامل مختلفة
ذلك النظام من العلاقات بين مجموعة المتغيرات لبيان ظاهرة معينة
علاقة بين عناصر الإنتاج
علاقات متعددة ومختلفة
#
المتغيرات الداخلية هي
1
التي تتحدد من داخل النموذج
التي تتحدد من خارج النموذج
تلك التي تؤثر في النموذج ولا تتأثر
يتحدد خارج علاقات النموذج
#
المتغيرات الخارجية هي
4
التي تتحدد داخل علاقات النموذج
التي تؤثر بالنموذج وتتأثر به
التي يتحدد من داخل النموذج
تلك التي تؤثر في النموذج ولا تتأثر به
#
السياسة الاقتصادية هي
1
مجموعة الأهداف والأساليب والبرامج التي يلجأ اليها المجتمع بغية معظمة الرفاهية الاقتصادية
مجموعة الوسائل والإجراءات التي يلجأ اليها المجتمع بغية تحقيق الاستقرار السياسي
مجموعة الوسائل التي يلجأ اليها المجتمع بغية تحقيق الاستقرار الاقتصادي
مجموعة الأهداف والأساليب والبرامج التي يلجأ اليها المجتمع بغية معظمة الإنتاج
#
السياسة الزراعية هي
1
ذلك الشطر من السياسة الاقتصادية الذي يجري تطبيقه في القطاع الزراعي من البنيان الاقتصادي القومى
ذلك الشطر من السياسة الاقتصادية الذي يجري تطبيقه في قطاع الخدمات من البنيان الاقتصادي القومى
ذلك الشطر من السياسة الاقتصادية الذي يجري تطبيقه في القطاع الصناعي من البنيان الاقتصادي القومى
ذلك الشطر من السياسة الاقتصادية الذي يجري تطبيقه في المجتمع
#
من أهداف السياسة الزراعية
3
تناقص الدخل المزرعي
ثبات الأحوال الاجتماعية
زيادة الكفاءة الاقتصادية
انخفاض الكفاءة
#
تقاس الكفاءة الاقتصادية ب
1
أسعار وكميات السلع المنتجة منسوبة الي أسعار وكميات الموارد المختلفة
أسعار السلع المنتجة
كميات السلع المنتجة
كميات السلع المنتجة منسوبة الي أسعار السلع المنتجة
#
تعني الكفاءة الاقتصادية القصوى
3
جميع الموارد المستخدمة ليست في أحسن استخدام لها
تناقص الموارد المستخدمة
جميع الموارد المستخدمة في أحسن استخدام لها
كفاءة الموارد المستخدمة

#
الزارعة غالبا ما تتميز ب
1
وجود فائض في العمال الزراعيين
وجود فائض في العمال الصناعيين
عدم وجود فائض في العمال الزراعيين
وجود توازن بين حجم القوي العاملة الواجب وجودها والموجودين فعلا
#
يعتبر متوسط الدخل في الزراعة
4
مساوي لبقية قطاعات الاقتصاد الأخرى
أكبر من مستواه من مثله في بقية قطاعات الاقتصاد الأخرى
لا يقارن ببقية قطاعات الاقتصاد الأخرى
أقل من مستواه من مثله في بقية قطاعات الاقتصاد الأخرى
#
تغير الدخل المزرعي من عام لأخر ناتج عن
4
أسعار المحاصيل الزراعية
التغيرات في العرض والطلب
التغيرات السنوية التي تحدث في الإنتاج نفسه
جميع ما سبق
#
لرفع وتثبيت الدخل المزرعي تتبع السياسة الزراعية وسائل عديدة منها
3
البعد عن الإرشاد الزراعي
عدم تعاون الزراعيين مع بعض
دراسة وتحليل أسعار المحاصيل الزراعية
عدم صرف معونات للمزارعين
#
مثال للأهداف الاجتماعية والسياسية البعيدة الأثر للسياسية الزراعية
1
تطور خدمة المجتمع والخدمة الصحية الريفية
عدم تحسين فرص التعليم
البعد عن الإرشاد الزراعي
عدم صرف معونات للمزارعين

#
من وسائل تحقيق أهداف السياسة الزراعية
1
إنهاء الجهاز السعري القائم
التخطيط السليم
التوجيه السليم
غير ذلك
#
لتحقيق هدف عدالة توزيع الدخل من خلال
2
التنظيم السليم
تعديل الضرائب والإعانات والمنح
إنهاء الجهاز السعري القائم
التوجيه السليم
#
قيام جهاز سعري يحقق كفاءة الإنتاج عن طريق
3
التنظيم السليم
التخطيط السليم
إجراءات التوزيع المباشر
الضبط السليم
#
السياسة الزراعية تستهدف
4
عدالة توزيع الدخل داخل قطاع الزراعة
تحسين الأحوال الاجتماعية
عدم زيادة الكفاءة الاقتصادية
أ، ب معا
#
من إجراءات تحسين الأحوال الاجتماعية
1
تطور وسائل الترفيه
معالجة السياسة الزراعية
تقييد حرية الفرد
زيادة الكفاءة

#
الفرق بين النظرية الاقتصادية والسياسة الاقتصادية أن النظرية الاقتصادية
3
تقدم تفسيرا لتأثيرات الظواهر الاقتصادية
تخدم في المجال الرياضي
تخدم في مجال تفسير الظواهر الاقتصادية
غير ذلك
#
تعد نظرية السياسة الاقتصادية الحرة
2
تجميعا لآراء الاقتصاديين الفرنسيين
تجميعا لآراء الاقتصاديين الأمريكيين
تجميعا لآراء الاقتصاديين الإيطاليين
تجميعا لآراء الاقتصاديين المصريين
#
الاقتصاديين الأمريكيين نادوا ب
1
مبدأ حرية المنافسة في الحياة الاقتصادية
مبدأ حرية المنافسة في الحياة الاجتماعية
مبدأ حرية المنافسة في الحياة الليبرالية
جميع ما سبق
#
يجمع بين نظرية السياسة الاجتماعية ونظرية السياسة الاقتصادية الحكومية
4
مفهوم تعديل الأسعار
مفهوم إعادة توزيع الدخول فقط
مفهوم إعادة توزيع الدخول والأسعار
مفهوم إعادة توزيع الدخول والثروات
#
نظرية السياسة الاجتماعية
2
تستطيع تقديم الدليل علي تحقيق الرفاهية المثلي لأفراد المجتمع
لا تستطيع تقديم الدليل علي تحقيق الرفاهية المثلي لأفراد المجتمع
تستطيع تقديم جانبا من الرفاهية المثلي
لا تستطيع تقديم جانبا من الرفاهية المثلي


#
سياسة النمو الاقتصادي هي
4
سياسات تخفيض أو ترشيد الاستهلاك
سياسات زيادة الإنتاج
سياسات حفز الاستثمار
جميع ما سبق
#
يقصد بالنمو الاقتصادي
3
الزيادة في الدخل الجاري
الزيادة في الدخل القومي الحقيقي
الزيادة في الدخل الفردي الحقيقي
غير ذلك
#
يصاحب التنمية الاقتصادية
1
تغيير بنياني للاقتصاد موضع الاعتبار
تغير بنياني للاقتصاد موضع الاعتبار
تغير في الدخل الجاري
غير ذلك
#
حسب قانون ساي في راي الكلاسيكيين
3
الطلب يحدد العرض 
الطلب ليس له علاقة بالعرض
العرض يحدد الطلب
العرض منفصل عن الطلب
#
وفقا لأراء كينز في التوظيف الكامل فان
1
الطلب هو الذي يحدد العرض
العرض منفصل عن الطلب
العرض هو الذي يحدد الطلب
الطلب ليس له علاقة بالعرض

#
عند كينز هو الذي يتحكم فيEffective Demand الطلب الفعال 
4
الإنتاج
مستويات التوظف
الدخل القومي
جميع ما سبق
#
تعتمد أفكار النيو كلاسيك على
4
تجانس الإنتاج وحده
اختصار عناصر الإنتاج الي العمل ورأس المال
الاهتمام بنظريات توزيع الدخل
جميع ما سبق
#
طبقا للنظرية الكلاسيكية يتحدد سعر الفائدة في السوق
1
بتعادل الطلب على الاستثمار وعرض القروض
بتعادل الطلب على الادخار وعرض النقود
بتعادل قوي الطلب مع قوي العرض
بتعادل الطلب على الاستهلاك وعرض النقود
#
تضخم الطلب يحدث عندما
1
الطلب الكلي أكبر من الإنتاج
الإنتاج أكبر من الطلب الكلي
الطلب الكلي يتساوى مع الإنتاج
الإنتاج أصغر من الطلب الكلي
#
تضخم التكاليف يطلق عليه
1
تضخم البائعين
تضخم المنتجين
تضخم المشترين
التضخم الناشئ عن دفع التكاليف الي أسفل

#
يمكن تتبع آثار مشكلة التضخم علي
3
معدلات زيادة الناتج المحلي
معدلات زيادة الإنتاج
معدلات زيادة الناتج القومي
معدلات زيادة الاستهلاك
#
أول المستفيدين من التضخم هم
2
الشركات الحكومية
الشركات المنتجة الخاصة
الأفراد
غير ذلك
#
من الأثار السلبية للتضخم
3
يزيد من القوة الشرائية للدخل
ليس له علاقة بالدخل
يقلل من القوة الشرائية للدخل
يقلل منالاستثمار
#
ينشأ الأثر السلبي للتضخم أساسا بسبب
1
التفاوت الكبير بين معدلات الزيادة في أسعار السلع المختلفة
تحسن وضع قطاع الأعمال
يحسن مركز أصحاب الثروة
يحسن مركز المدينين
#
من إثر التضخم على توزيع الناتج
3
تدهور مركز أصحاب الثروة من العقارات
تدهور وضع قطاع الأعمال لزيادة اربحيتهم
تحمل أصحاب الثروة النقدية لعبء انخفاض قيمتها الحقيقية
تدهور مركز المدينين

#
نتيجة لمشكلة البطالة يحدث
1
قصور الإنتاج
زيادة الطلب الكلي
زيادة عرض موارد الإنتاج
زيادة الطلب النقدي
#
من أثر البطالة على محور الإنتاج . . . . 
2
زيادة الناتج الحقيقي
حدوث قصورا في عملية التراكم الرأسمالي
عدم حدوث قصورا في عملية التراكم الرأسمالي
عدم حدوث قصورا في تكوين المدخرات
#
من أثر البطالة على محور عرض موارد الإنتاج . . . . 
4
انخفاض معدلات الإنتاجية
انخفاض معدلات الأجور
ثبات معدلات الإنتاجية
زيادة معدلات الأجور
#
أثبت فيليبس أن انخفاض معدلات البطالة يؤدى الى . . . . 
1
زيادة معدلات الأجور
انخفاض معدلات الأجور
انخفاض معدلات التضخم
تدهور معدلات الأجور
#
أثبت فيليبس أن العلاقة بين معدلي زيادة الأجور والبطالة بالمملكة المتحدة
1
علاقة عكسية
علاقة تبادلية
علاقة طردية
لا يوجد علاقة
#

من أهداف السياسة الزراعية
1
زيادة وثبات الدخل المزرعى
#

النموذج هو
1
ذلك النظام من العلاقات بين مجموعة المتغيرات لبيان ظاهرة معينه
#
المتغيرات الداخلية هي
1
تلك التي تتحدد من داخل النموذج، أي تؤثر فيه وتتأثر به
#
المتغيرات الخارجية هي
1
تلك التي تؤثر في النموذج ولا تتأثر به بمعنى إنها تتحدد خارج علاقات نموذج
#
الاقتصاد هو
1
علم إدارة الموارد الاقتصادية مشتملة على المورد البشرى كعنصرإنتاج من ناحية وكعنصر مستهدف رفاهيته من ناحية أخرى
#
السياسة الزراعية هي
1
مجموعة الأهداف والأساليب والبرامج والإجراءات التي يلجأالمجتمع إلى طبيقها في القطاع الزراعي بغية معظمة رفاهيته الاقتصادية
#
السياسة الاقتصادية هي
1
مجموعة الأهداف والأساليب والبرامج والوسائل والإجراءات التي يلجأ إليها المجتمع بغية معظمة الرفاهية الاقتصادية لمختلف أفراد ذلك المجتمع
#
تعنى الكفاءة الاقتصادية لقصوى أن
1
جميع الموارد مستخدمة في أحسن استخدام لها وانه يمكن بإحداث تغيير في طريقة استخدامها الحصول على زيادة في الإنتاج
#
سياسة النمو الاقتصادي
1
هي تلك البرامج والإجراءات التي تتخذها الحكومات لزيادة معدل النموالاقتصادي
#
التنمية الاقتصادية
1
هي تحقيق زيادة سريعة تراكمية ودائمة في الدخل الفردي الحقيقي عبر فترة ممتدة من الزمن
#
النمو الاقتصادي
1
الزيادة في الدخل الفردي الحقيقي
#
التوظيف الكامل عند الاقتصاديين الكلاسيك هو
1
حجم العمالة التي يحققها تعادل كل من الطلب على العمل مع عرض العمل في كل سوق على انفراد
#
سياسة توزيع الدخل عند آدم سميث هي
1
جزء من عمليات الجهاز السعري الذي يتحدد أساسا من خلال نظرية تكاليف الإنتاج
#
تشرح النظرية الكينزية في توزيع الدخل
1
عملية توزيع الدخل من خلال القدرة الادخارية لكلا المجموعتين من عناصر الإنتاج المستقبلين للجزء الأكبر من الدخل القومي
#
يعرف التضخم بأنه
1
الارتفاع المستمر في المستوى العام للأسعار

`,Y=J.split("#").map((t,s)=>{var a;let e=t.trim().split(`
`).filter(c=>c.trim().length>0),r=e.shift()||"failed to parse question",i=Number((a=e.shift())==null?void 0:a.trim());const n=e.map((c,l)=>({id:m(),text:c,correct:l+1===i}));return g({questionText:r,answers:n})}),ee=`

هي وسائل وأدوات غير موجودة في المجتمع أو برامج غير موجودة تصلح للمجتمع
1
البرامج الإنشائية
البرامج الإحصائية
البرامج الإصلاحية
البرامج التنفيذية


#
هي الوسائل والأدوات الموجودة الحالية والتي يجرى عليها عمليات الإصلاح
3
البرامج الإنشائية
البرامج الإحصائية
البرامج الإصلاحية
البرامج التنفيذية


#
لتحقيق الرفاهية الاقتصادية والتقدم لابد أن يحتفظ المجتمع بأكبر قدر من المعادن النفسية
1
المذهب الفكري التجارى
الاتجاه الحر
الاتجاه التعاوني
الاتجاه الحر ذو الطابع الاشتراكي



#
سبب المشاكل على الكرة الرضية هي السعي وراء الربح والبيع بسعر التكلفة (إلغاء النقود (
3
المذهب الفكري التجارى
الاتجاه الحر
الاتجاه التعاونى
الاتجاه الحر ذو الطابع الاشتراكى



#
قطاع الزراعة هو الأساس لتحقيق الرفاهية الاقتصادية، ويجب أن يكون هو القطاع الوحيد المنتج
2

المذهب الفكري التجارى
الاتجاه الحر من الطبيعيين
الاتجاه التعاونى
الاتجاه الحر ذو الطابع الاشتراكى



#
يرون أن تدخل الدولة في الحياة الاقتصادية يكون خيراً ونادوا بضرورة التدخل الحكومي في الأعمال والشئون الاقتصادية والأشراف على إدارة المشروعات الكبرى وخصوصا التي تميل إلى الاحتكار في مجال النشاط الفردي
4
المذهب الفكري التجارى
الاتجاه الحر من الطبيعيين
الاتجاه التعاونى
الاتجاه الحر ذو الطابع الاشتراكى



#
تستهدف تقليل الفوارق بين الطبقات وتشمل برامج تستهدف نقل الدخل من الطوائف الأغنى إلى الطوائف الأفقر عن طريق (الزكاه، الضمان الاجتماعي، معاش)
1
السياسة التوزيعية
السياسة التنظيمية
السياسة الكمية
السياسة النوعية



#
تضم مجموعة من القواعد تلُزم الأفراد عند ممارستهم النشاط الإنتاجي ( كل فرد له حقوق وعلية واجبات)
2
السياسة التوزيعية
السياسة التنظيمية
السياسة الكمية
السياسة النوعية
 



#
هي قصيرة الأجل تحدث تغيرات بسيطة في ميزان المدفوعات أو العمالة أو التوازن النقدي وهي تعديلات جزئية قطاع أو أكثر
3
السياسة التوزيعية
السياسة التنظيمية
السياسة الكمية
السياسة النوعية



#
سياسات في المدى القصيرة وتهدف إلى إحداث تغيير جزئي (طبيعي) في التركيب الاجتماعي الموجود في المجتمع
4
السياسة التوزيعية
السياسة التنظيمية
السياسة الكمية
السياسة النوعية



#
سياسات طويلة الأجل تهدف لإحداث تعديل كمي أو نوعي في المتغيرات (المقومات) الرئيسية الموجودة في المجتمع، والهدف منها تحقيق الاستقرار الاقتصادي
4
السياسة التوزيعية
السياسة التنظيمية
السياسة الكمية


#
السياسة الإصلاحية
1
هو الدخل الذي يأخذ في الاعتبار مستويات الأسعار
الدخل الحقيقي
الدخل النقدي
الدخل التوازني
الدخل القومي







#
هي مجموعة البرامج الإنشائية والإصلاحية التي يجرى تنفيذها في مجال القطاع الزراعي بهدف تحقيق الرفاهية الاقتصادية لسكان القطاع الزراعي
1
السياسة التوزيعية
السياسة التنظيمية
السياسة الكمية
السياسة الاقتصادية الزراعية



#
السيطرة المباشرة على السعر المزرعى للمنتجات المحلية وكذلك فرض ضرائب على صادرات السلع الزراعية
3
السياسة التوزيعية
السياسة التنظيمية
التدخل الحكومي المباشر
التدخل الحكومي غير المباشر



#
استخدام سياسة سعر الصرف للتأثير على الصادرات الزراعية
4
السياسة التوزيعية
السياسة التنظيمية
التدخل الحكومي المباشر
التدخل الحكومي غير المباشر




#
هو تعادل الأنفاق الكلى مع الناتج الكلى
3
الدخل الحقيقي
الدخل النقدي
التوازن
الدخل القومى




#
هو مختلف التوليفات التي تحقق نفس القدر من الإنتاج
3
منحنيات السعر
منحنى المنفعة
منحنى الناتج المتماثل
منحنى الطلب




#
هي عبارة عن دالة في عناصر الإنتاج
1
دالة الإنتاج الزراعى
دالة التكاليف الزراعى
دالة الدخل
دالة السعر



#
هو طريقة كمية لحل مشاكل الوحدة الإنتاجية كاختيار التوليفة المثلى من منتجاتها المعظمة للربح أو المدنية للخسارة(التكاليف)
1
نموذج البرمجة
نموذج النقل
نموذج التوازن
نموذج تحليل المخرجات والمدخلات 





#
عبارة عن جدول للمدخلات وللمخرجات يعتمد على إعطاء وصفا للحسابات القومية الاجتماعية وتسجيلاً كاملاً للمشتريات أو مبيعات مختلف قطاعات الاقتصاد القومي المكونة له
4
نموذج البرمجة
نموذج النقل
نموذج التوازن
نموذج تحليل المخرجات والمدخلات 



#
دور الأسعار الزرعية في القطاع الزراعي
3
توجيه الاستهلاك
توجيه الإنتاج
A, B العباره
اختيار التوليفة المثلى




#
يتوسع الزراع في إنتاج السلع الأكث راربحية بينما يقللون من السلع الأقل أربحية
2
توجيه الاستهلاك
توجيه الإنتا ج
توزيع الدخل
التأثير على الإنتاج الزراعي



#
العمل على زيادة السلع البديلة
1
توجيه الاستهلاك
توجيه الإنتاج
توزيع الدخل
التأثير على الإنتاج الزراعي



#
يؤثر مستوى الأسعار الزراعية على توزيع الدخل القومي بين القطاع الزراعي وغيره من القطاعات
3
توجيه الاستهلاك
توجيه الإنتاج
توزيع الدخل
التأثير على الإنتاج الزراعى



#
تتدخل الدولة لتحديد الأسعار في حالة وجود احتكار لسلعة ما أو خدمة لتحديد السعر وجعل السوق سوق منافسة كاملة
1
التحديد المباشر للأسعار
التحكم في الإنتا ج
السيطرة على توزيع السلع
توجيه الاستهلاك


#
تحديد المساحة الأرضية، والغرض منه هو تحديد الإنتاج من سلعة معينة أو قد يكون في نفس الوقت تدعيم الإنتاج من سلعة أخرى
2
التحديد المباشر للأسعار
التحكم في الإنتاج
السيطرة على توزيع السلع
توجيه الاستهلاك



#
التحكم في مستلزمات الإنتاج مثل الأسمدة – المبيدات – التقاوي
2
التحديد المباشر للأسعار
التحكم في الإنتاج
السيطرة على توزيع السلع
توجيه الاستهلاك



#
من طرقها السيطرة على الصادرات والواردات
3
التحديد المباشر للأسعار
التحكم في الإنتاج
السيطرة على توزيع السلع
توجيه الاستهلاك



#
هو تحقيق الاستقرار الزراعي للمزارع عن طريق تقليل التقلبات التي تحدث للأسعار والدخول المزرعية
1
هدف السياسة السعرية
هدف السياسة النقدية
هدف السياسة التوزيعية
هدف السياسة المالية



#
أهداف تدخل الدولة في السياسة التسويقية الزراعية
1
الحد من تعدد الوسطاء
العمل زيادة التكاليف التسويقية
زيادة عدد الوسطاء
زيادة الفاقد



#
أي التوزيع العادل للناتج المتحصل عليه أي إعطاء كل ذي حق حقه مهما تباين الحقوق
1
الكفاءة التوزيعية
الكفاءة الديناميكية
الكفاءة الاستاتيكيه
الكفاءة



#
الإنتاج المتحصل عليه يعكس تفضيلات أفراد المجتمع بصفى عامة الى جانب أنه يعكس الإمكانيات الفنية المتاحة لاستخدام الموارد
3
الكفاءة التوزيعية
الكفاءة الديناميكية
الكفاءة الاستاتيكيه
الكفاءة




#
ويتصل بها كافة مشاكل توازن الاقتصاد الكلى وإدارته خاصة مشكلتي التضخم وعجز ميزان المدفوعات وتتحقق إذا ماتم التوصل الى نوع من التوازن بين كل من الطلب الكلى والعرض الكلى لاقتصادما
2
الكفاءة التوزيعية
الكفاءة الديناميكية في المدى القصير
الكفاءة الاستاتيكيه
الكفاءة الديناميكية في المدى الطويل



#
ويتصل بها المشاكل التي تعوق سرعة انتقال منحنى الإمكانيات الإنتاجية للمجتمع بمرور الوقت، والذي يتأثر عاملين رئيسيين هما (معدل الاستثمار، وإنتاجية هذا الاستثمار)
4
الكفاءة التوزيعية
الكفاءة الديناميكية في المدى القصير
الكفاءة الاستاتيكيه
الكفاءة الديناميكية في المدى الطويل




#
أسس نجاح السياسة الاقتصادية
2
عدم وجود سلطة تنفيذية
وجود سلطة تنفيذية
إهمال بعض المتغيرات الاقتصادية الكلية
عدم استمرار متابعة تقييم السياسة الاقتصادية



#
أسس نجاح السياسة الاقتصادية
2
عدم وجود سلطة تنفيذية
استمرار متابعة تقييم السياسة الاقتصادية
إهمال بعض المتغيرات الاقتصادية الكلية
عدم استمرار متابعة تقييم السياسة الاقتصادية



#
هو عبارة عن منحنى يوضح مستوى التدخل للدولة في النشاط الاقتصادي لتحقيق الرفاهية الاقتصادية
1
نموذج الرفاهية الأمثل
نموذج الرضا الأمثل
نموذج الطلب
نموذج التوازن



#
وعبارة عن نموذج يحدد المنطقة أو الحدود الخاصة بالإنتاج في ظل القيود الاقتصادية والاجتماعية
2
نموذج الرفاهية الأمثل
نموذج الرضا الأمثل
نموذج الطلب
نموذج التوازن



#
إلغاء نظام التوريد الإجباري وتحرير أسعار وتسويق الحاصلات الزراعية
3
السياسة التوزيعية
السياسة التنظيمية
الإصلاح الاقتصادي
السياسة النوعية



#
إلغاء الدعم على مستلزمات الإنتاج، بهدف الحد من عجز الموازنة العامة ويتم ذلك تدريجيا وفق خطة زمنية
3
السياسة التوزيعية
السياسة التنظيمية
الإصلاح الاقتصادي
السياسة النوعية



#
التحول من التخطيط المركزي (نظام الدورة الزراعية الإلزامية) الى التخطيط التأشيرى (توقعات)
3
السياسة التوزيعية
السياسة التنظيمية
الإصلاح الاقتصادي
السياسة النوعية



#
نظام الدورة الزراعية الإلزامية يوجد في
1
التخطيط المركزى
التخطيط التأشيري
البحث والإرشا د
السياسة النوعية



#
قصر دور البنك الرئيسي للتنمية والائتمان الزراعي تدريجيا على تمويل الأنشطة الزراعية هي أحد مكونات الإصلاح الاقتصادي وهي
4
تعزيز دور القطاع الحكومي
تحرير أسواق المدخلات والمخرجات
تعزيز دور القطاع الخاص
الإصلاح المؤسسي والتشريعي



#
إجراء تعديلات تشريعية تفيد تنظيم العلاقة بين أطراف التعامل في النشاط الزراعي مثل )قانون المالك والمستأجرهي أحد مكونات الإصلاح الاقتصادي وهي
4
تعزيز دور القطاع الحكومي
تحرير أسواق المدخلات والمخرجات
تعزيز دور القطاع الخاص
الإصلاح المؤسسي والتشريعي



#
إصلاح القطاع العام وتنمية القطاع الخاص هي أحد مكونات الإصلاح الاقتصادي وهي
4
تعزيز دور القطاع الحكومي
تحرير أسواق المدخلات والمخرجات
تعزيز دور القطاع الخاص
الإصلاح المؤسسي والتشريعي



#
تشجيع القطاع الخاص على استصلاح وتملك الأراضي والاستزراع وإلغاء القيود في مجال استيراد وتصدير الحاصلات البستانية هي أحد مكونات الإصلاح الاقتصادي وهي
3
تعزيز دور القطاع الحكومي
تحرير أسواق المدخلات والمخرجات
تعزيز دور القطاع الخاص
الإصلاح المؤسسي والتشريعي


#
تحرير سعر الصرف هي أحد مكونات الإصلاح الاقتصادي وهي
3
تعزيز دور القطاع الحكومي
تحرير أسواق المدخلات والمخرجات
تعزيز دور القطاع الخاص
الإصلاح المؤسسي والتشريعي



#
الغاء نظام التوريد الإجباري وتحرير أسعار وتسويق الحاصلات الزراعية هي أحد مكونات الإصلاح الاقتصادي
2
تعزيز دور القطاع الحكومي
تحرير أسواق المدخلات والمخرجات
تعزيز دور القطاع الخاص
الإصلاح المؤسسي والتشريعي



#
من الغاء الدعم على مستلزمات الإنتاج هي أحد مكونات الإصلاح الاقتصادي وهي
2
تعزيز دور القطاع الحكومي
تحرير أسواق المدخلات والمخرجات
تعزيز دور القطاع الخاص
الإصلاح المؤسسي والتشريعي



#
التحول من التخطيط المركزي (نظام الدورة الزراعية الإلزامية) الي التخطيط التاشيري هي أحد مكونات الإصلاح الاقتصادي وهي
2
تعزيز دور القطاع الحكومي
تحرير أسواق المدخلات والمخرجات
تعزيز دور القطاع الخاص
الإصلاح المؤسسي والتشريعي



#
يعتقدون في إصلاح نواحي الخلق استنادا الى العادات والتقاليد والأخلاق التي ينادي بها الدين (الإصلاح الأدنى للمجتمع تمهيدا لإصلاحه اقتصاديا)
4
المذهب الفكري التجارى
الاتجاه الحر من الطبيعيين
الاتجاه التعاونى
الاتجاه الحر ذو الطابع الديني



#
ينادون بإحلال الملكية الاجتماعية محل الملكية الفردية
4
المذهب الفكري التجارى
الاتجاه الحر من الطبيعيين
الاتجاه التعاوني
الاتجاه الحر ذو الطابع الاشتراكي ( الماركسي)








#
ينادون بالتدخل الحكومي لأقصى درجات التدخل (المجتمع يستولي على جميع الموارد) 
4
 المذهب الفكري التجارى
الاتجاه الحر من الطبيعيين
الاتجاه التعاونى
الاتجاه الحر ذو الطابع الاشتراكي ( الماركسي)



#
هي زيادة الدخل الفردي الحقيقي على مر الزمن
1
الرفاهية الاقتصادية
الدخل النقدي
الدخل التوازنى
الدخل القومى



#
تنقسم السياسة الاقتصادية من حيث طبيعة الأداء
1
السياسة التوزيعية
السياسة التشريعية
السياسة الكمية
السياسة النوعية



#
تنقسم السياسة الاقتصادية من حيث طبيعة الأداء
1
السياسة التنظيمية
السياسة التشريعية
السياسة الكمية
السياسة النوعية



#
تنقسم السياسة الاقتصادية من حيث حجم الأداء
4
السياسة التنظيمية
السياسة التشريعية
السياسة التوزيعية
السياسة النوعية



#
تنقسم السياسة الاقتصادية من حيث حجم الأداء
4
السياسة التنظيمية
السياسة التشريعية
السياسة التوزيعية
السياسة الكمية



#
تتعادل قوى الادخار المخطط مع الاستثمار المخطط
1
توازن الدخل
توازن قطاع النقود
التوازن سوق المال
توازن سوق السلعة





#
تعادل عرض النقود مع الطلب عليها
2
توازن الدخل
توازن قطاع النقود
التوازن سوق المال
توازن سوق السلعة



#
تعادل قوى العرض والطلب على هذه السلعة
4
توازن الدخل
توازن قطاع النقود
التوازن سوق المال
توازن سوق السلعة



#
تعادل قوى عرض العمل والطلب عليه
3
توازن الدخل
توازن قطاع النقود
التوازن سوق المال
توازن سوق السلعة

 

`,te=ee.split("#").map((t,s)=>{var a;let e=t.trim().split(`
`).filter(c=>c.trim().length>0),r=e.shift()||"failed to parse question",i=Number((a=e.shift())==null?void 0:a.trim());const n=e.map((c,l)=>({id:m(),text:c,correct:l+1===i}));return g({questionText:r,answers:n})}),se=`


تحظى مسألة تنمية . . . . باهتمام متزايد وتوضع على رأس أولويات السياسة الاقتصادية في مصر،وبصفة خاصة في الآونة الأخيرة وذلك لمعالجة العجز في الميزان التجاري.
1
الصادرات
الواردات
الضرائب
المصروفات



#

تعتبر تنمية الصادرات الزراعية أحد العناصر الهامة والرئيسية لتنمية مصادر . . . . ، حيث تقدر قيمة هذه الصادرات بحوالي 3 مليار دولار عام 2020 م
1
النقد الأجنبي
النقد المحلى
النقد الدولي
النقد القومي



#

وفى إطار الاتجاه العالمي لإزالة معوقات التبادل التجاري بين مختلف الدول، تسعى كل دولة إلى زيادة حجم
2
الإنتاج
الصادرات
الاستهلاك
الواردات



#

تسعى السياسة الاقتصادية المصرية جاهدة لتنويع وتعظيم العائد من الصادرات بوجه عام، والصادرات . . . . بوجه خاص 
1
الزراعية
الصناعية
الخدمية
التجارية



#

تعاني التجارة الخارجية المصرية بصفة عامة من . . . . دائم ومستمر على مدار الفترة الماضية بسبب التزايد السكاني المتزايد ومحدودية الموارد الزراعية
1
عجز
فائض
تعادل



#

يبنى التفسير الكلاسيكي للتجارة الدولية على مبدأ التكاليف النسبية الذي صاغه الاقتصادي الإنجليزي . . . . عام 1817
2
ادم سميث
دافيد ريكاردو
جون ستيوارت ميل



#

إن اختلاف النفقات هو الشرط الضروري والكافي للتبادل التجاري بين دولتين
2
الكلية
النسبية
المتوسطة



#

ويرى . . . . أن الفائدة أو المنافع المتحصل عليها من التجارة الدولية تتأتى من التوظيف الأكثر كفاءة للقوى الإنتاجية في العالم
3
ادم سميث
دافيد ريكاردو
جون ستيوارت ميل



#

يتم قياس الميزة النسبية باستخدام معامل تكلفة الموارد . . . . 
2
الأجنبية
المحلية
العالمية
الحدود

#


إذا كانت قيمة معامل تكلفة الموارد المحلية أقل من الواحد الصحيح فهذا يشير إلى أن الدولة . . . . عملة أجنبية من إنتاج السلعة محليا
2
لا توفر
توفر
تخسر
لا تخسر


#
يمكن للدولة أن يكون لها ميزة نسبية في إنتاج تلك السلعة إذا توافرت السلعة . . . . 
1
بوفرة
بندرة
قليلا



#

بتركيب الرقم القياسي للميزة النسبية Balassaقام 
3
الحقيقية
التقليدية
الظاهرية
الخيالية



#

كلما زادت قيمة الرقم القياسي للميزة النسبية الظاهرة عن 100 دل ذلك على . . . . ميزة نسبية ظاهرة لصادرات السلعة
2
عدم وجود
وجود
غياب
عدم غياب



#

وإذا انخفض الرقم القياسي للميزة النسبية الظاهرة عن 100 دل ذلك على . . . . الميزة النسبية للسلع الداخلة في حسابه
3
زيادة
تحسن
تدهور



#

يقيس معامل الحماية الأسمى أثر
4
السياسة الصناعية
السياسة التجارية
السياسة العلمية
السياسة الزراعية




#

معامل الحماية الأسمى يساوي السعر المزرعى مقسوما على السعر العالمي . . . . 
4
سعر السلعة التوازني
سعر الحدود التوازني
السعر العالمي التوازني
سعر الصرف التوازني



#

الميزة . . . . لها مكونات معناها إنتاج سلعة بتكلفة منخفضة وذات جودة عالية ووجود خدمات لتوصيل هذه السلعة للمستهلك في الوقت المناسب والشكل المناسب
1
التنافسية
النسبية
الكلية



#

تستخدم مرونة . . . . على السلعة المصدرة في الدولة المستوردة كمؤشر للمركز أو القوة التنافسية للسلعة في سوق الدولة المستوردة لها
2
العرض السعرية
الطلب السعرية
الإنتاج السعرية



#

كلما كانت مرونة الطلب الخارجي على السلعة في سوق ما . . . . كلما دل ذلك على أن الدولة المصدرة تستطيع رفع سعر السلعة في أسواق الدول المستوردة
2
مرتفعة
منخفضة
متزايدة
متناقصة



#

إن النظام التجاري . . . . ينطوي على قواعد يضعها المجتمع الدولي، بصورة متعددة الأطراف
3
المحلى
الإقليمي
الدولي



#

إن النظام التجاري الدولي يبني على . . . . دولية، تكون ملزمة للدول التي توقعها بعد مناقشتها
3
مناقشات
اجتماعات
اتفاقيات



#

تعتبر منظمة . . . . العالمية العنصر الأساسي في النظام التجاري الدولي متعدد الأطراف
4
العمل
الاستهلاك
الإنتاج
التجارة



#

تعد منظمة . . . . العالمية الآن بمثابة الإطار المؤسسي الدولي الوحيد الذي يضع ويوضح، ويطور، ويشرف على تطبيق القواعد التي تحكم حركة التجارة الدولية بين دول العالم المختلفة
4
العمل
الاستهلاك
الإنتاج
التجارة



#
التعرفة والربط Tarifficationاتفقت الدول الأعضاء في النظام التجاري العالمي على إجراء . . . . جمركية على مدى ست سنوات بدءا من عام 1995  Binding 
2
زيادات
تخفيضات
تثبيتات




#

يؤكد هذا الاتفاق لحرية التجارة الدولية على حق أي دولة عضو في منظمة التجارة العالمية في تبني أي تدابير تراها ضرورية للحفاظ على . . . . الإنسان، والحيوان، والنبات
3
أعداد
خصائص
صحة



#

اتبعت الدول النامية بعد الاستقلال الدول المتقدمة في نظام حرية التجارة العالمية لتحقيق . . . . من التجارة الدولية
2
خسائر
مكاسب
استقرار



#

يمكن تعريف . . . . الاقتصادي الدولي على أنه درجة معينة من التكامل الاقتصادي الذي يقوم بين مجموعة من الدول المتجانسة اقتصاديا
3
الاتحاد
التجمع
التكتل


#

تعريف التكتل الاقتصادي الدولي على أنه درجة معينة من التكامل الاقتصادي بهدف تعظيم المصالح وزيادة التجارة الدولية لتحقيق . . . . عائد لشعوب تلك الدول
2
اقل
أكبر
تعادل



#

من أهم . . . . النظام الاقتصادي العالمي الجديد هو الاتجاه المتزايد نحو تكوين التكتلات الاقتصادية العملاقة للحصول على أكبر مكاسب ممكنة من التجارة الدولية
1
خصائص
أنواع
طرق



#

 . . . . من الدوافع التي تجعل مجموعة من الدول تهتم بتكوين تكتل اقتصادي فيما بينها هو
1
التمتع بوفورات الإنتاج الكبير
التمتع بالانفراد بالإنتاج
التمتع بالإنتاج الصغير



#

من الدوافع التي تجعل مجموعة من الدول تهتم بتكوين تكتل اقتصادي فيما بينها
1
زيادة درجة المنافسة
تقليل درجة المنافسة
تثبيت درجة المنافسة



#

من الدوافع التي تجعل مجموعة من الدول تهتم بتكوين تكتل اقتصادي فيما بينها
1
توسيع حجم السوق
تقليل حجم السوق
تثبيت حجم السوق



#

من الدوافع التي تجعل مجموعة من الدول تهتم بتكوين تكتل اقتصادي فيما بينها
1
زيادة معدل التجارة الدولية البينية
تقليل معدل التجارة البينية
تثبيت معدل التجارة البينية



#

من الدوافع التي تجعل مجموعة من الدول تهتم بتكوين تكتل اقتصادي فيما بينها
3
تقليل نصيب التكتل الاقتصادي من التجارة العالمية 
تثبيت نصيب التكتل الاقتصادي من التجارة العالمية 
زيادة نصيب التكتل الاقتصادي من التجارة العالمية



#

من الدوافع التي تجعل مجموعة من الدول تهتم بتكوين تكتل اقتصادي فيما بينها
2
تثبيت مستوى الرفاهية الاقتصادية
زيادة مستوى الرفاهية الاقتصادية
تقليل مستوى الرفاهية الاقتصادية



#

من الدوافع التي تجعل مجموعة من الدول تهتم بتكوين تكتل اقتصادي فيما بينها
3
تثبيت مستوى التكاليف الإنتاجية
زيادة مستوى التكاليف الإنتاجية
تقليل مستوى التكاليف الإنتاجية



#

من الدوافع التي تجعل مجموعة من الدول تهتم بتكوين تكتل اقتصادي فيما بينها
2
تثبيت مستوى الكفاءة الإنتاجية
زيادة مستوى الكفاءة الإنتاجية
تقليل مستوى الكفاءة الإنتاجية



#

الضلع النقدي في نظام التجارة العالمية ويشير إلى المعاملات النقدية الدولية قصيرة الأجل وأهمية تحقيق الاستقرار فيها ويعبر عنه . . . . 
3
صندوق الإسكان الدولي
صندوق التمويل الدولي
صندوق النقد الدولي



#

الضلع المالي في نظام التجارة العالمية يعبر عن المعاملات الاقتصادية طويلة الأجل والتي تمثل الاستثمارات الدولية ويشرف على هذا النوع من المعاملات مجموعة . . . . والذي يسعى إلى تأمين حركة تدفقات
4
رؤوس الأموال العالمية
الاستثمار الدولي
العمل الدولي
البنك الدولي



#

الضلع التجاري أو ما يعرف بالتجارة الدولية متعددة الأطراف وقد كانت الاتفاقية العامة للتعريفة والتجارة الجات) ترعى شئون التجارة العالمية من الفترة 1 / 1 / 1948 - 31 / 12 / 1994 . ومع بداية عام 1995 حلت) 
4
محلها منظمة
العمل الدولية
الأم الدولي
التجارة العالمية



#

ويضيف . . . . أن اختلاف الندرة النسبية لعوامل الإنتاج ما بين دولة وأخرى هو شرط ضروري لوجود اختلاف في النفقات النسبية وبالتالي لقيام التجارة الخارجية
3
جون ستيوارت ميل
ديفيد ريكاردو
هيكشر



#

معامل . . . . = إجمالي التكاليف للوحدة بالسعر المحلى / القيمة المضافة للوحدة بسعر الحدود
2
أسعار الموارد المحلية
تكلفة الموارد المحلية
إنتاج العوامل المحلية





#

التكامل الاقتصادي . . . . ويقصد به توسيع النطاق الجغرافي للاتحاد من خلال قبول أعضاء جدد من بين الدول المنتمية جغرافيا إلى الإقليم الاقتصادي
2
الرأسي
الأفقي
المتوسط



#

التكامل الاقتصادي . . . . ويقصد به التحرك من درجة إلى أخرى على درجات سلم التكامل الاقتصادي والذي يبدأ بمنظمة التجارة الحرة مرورا بالاتحاد الجمركي فالسوق المشتركة فالوحدة الاقتصادية انتهاءا بالتكامل 
3
الاقتصادي
الأفقي
الرأسي
المتوسط



#

التكامل الاقتصادي . . . . وهو يشير إلى درجات سلم التكامل الاقتصادي الثلاث الأولى (منظمة التجارة الحرة، الاتحاد الجمركي، السوق المشتركة)، حيث يتم إزالة القيود فقط
2
الموجب
السالب
المتعادل



#

التكامل الاقتصادي . . . . وهو يعكس الوحدة النقدية المالية والتكامل حيث تتخذ سلطات التكامل خطوات إيجابية نحو إنشاء آليات جديدة للتكامل مثل التنسيق وتوحيد السياسات الاقتصادية وإنشاء عملة موحدة وإنشاء بنك مركزي موحد وتوحيد النظم الضريبية وتشريعات العمل وغير ذلك
1
الموجب
السالب
المتعادل



#

ويتكون هذا التكتل الاقتصادي بهدف تحرير التجارة بين دول الأعضاء ويتم الاتفاق بين دولتين أو أكثر على إزالة كافة العقبات التي تقف في سبيل التبادل التجاري بينهم وتلتزم كل دولة من الدول المشتركة بإلغاء الرسوم الجمركية والقيود الكمية المفروضة على الواردات من بقية الدول المشتركة
3
منظمة الاستهلاك الحر
منظمة الإنتاج الحر
منطمة التجارة الحرة



#

وفيه يتم إلغاء الرسوم الجمركية والقيود الكمية فيما بين الدول الأعضاء، وتلتزم الدول الأعضاء بتعريفة جمركية موحدة يتم تطبيقها على السلع المستوردة من العالم الخارجي
2
الاتحاد الضرائبي
الاتحاد الجمركي
الاتحاد الإنتاجي



#

وفيه يتم توحيد أسواق كل من المنتجات وعناصر الإنتاج فيما يمكن تسميته بتكامل الأسواق وهذا لا يكون ممكنا إلا إذا اتفقت الدول الأعضاء في السوق على ترتيبات من شأنها تنسيق السياسة الاقتصادية فيما يسمى بتكامل السياسات
1
السوق المشتركة
السوق المنفردة
السوق العالمي




#

من خلال الاتحاد الاقتصادي يتم إلغاء كافة القيود على التجارة الدولية وانتقال رؤوس الأموال والأشخاص بين الدول بالإضافة إلى تحقيق التنسيق في كافة السياسات الاقتصادية بغرض الوصول إلى الوحدة الاقتصادية العالمية
1
الاتحاد الاقتصادي
الاتحاد الإنتاجي
الاتحاد الاستهلاكي



#

يعتبر . . . . أكبر التكتلات الاقتصادية في العالم وأصبح هذا التكتل الاقتصادي في نظر العديد من الخبراء أكبر قوة اقتصادية وأقوى تكتل اقتصادي على مستوى العالم
3
الاتحاد العالمي
الاتحاد العربي
الاتحاد الأوروبي



#

من أهم أهداف التكتل الاقتصادي الأوروبي
1
خلق سوق تجارية موحدة ذات قدرة إنتاجية أكثر كفاءة وطاقة استيعابية
خلق سوق تجارية متعددة ذات قدرة إنتاجية أكثر كفاءة وطاقة استيعابية
خلق سوق تجارية موحدة ذات قدرة إنتاجية اقل كفاءة وطاقة استيعابية



#

من أهم أهداف التكتل الاقتصادي الأوروبي
1
تعميق الاقتصاد القائم على آليات السوق واحترام مبدأ المنافسة
تعميق الاقتصاد الغير قائم على آليات السوق واحترام مبدأ المنافسة
تعميق الاقتصاد القائم على آليات السوق وعدم احترام مبدأ المنافسة



#

من أهم أهداف التكتل الاقتصادي الأوروبي
2
عدم الانتقال من مرحلة التكامل والتنسيق إلى مرحلة الاندماج الفعلي بما يسهل من عملية الاستخدام الأمثل للموارد
الانتقال من مرحلة التكامل والتنسيق إلى مرحلة الاندماج الفعلي بما يسهل من عملية الاستخدام الأمثل للموارد
الانتقال من مرحلة التكامل والتنسيق إلى مرحلة الانفصال الفعلي بما يسهل من عملية الاستخدام الأمثل للموارد



#

من أهم أهداف التكتل الاقتصادي الأوروبي
3
انخفاض قدرة التكتل الأوروبي في لعب دورا أكثر فعالية في كافة المجالات الاقتصادية والسياسية
ثبات قدرة التكتل الأوروبي في لعب دورا أكثر فعالية في كافة المجالات الاقتصادية والسياسية
زيادة قدرة التكتل الأوروبي في لعب دورا أكثر فعالية في كافة المجالات الاقتصادية والسياسية



#

من أهم أهداف التكتل الاقتصادي الأوروبي
1
تحقيق الوحدة النقدية الأوروبية والاستقرار النقدي في أوروبا وإقامة البنك المركزي الأوروبي
عدم تحقيق الوحدة النقدية الأوروبية والاستقرار النقدي في أوروبا وإقامة البنك المركزي الأوروبي
تراجع الوحدة النقدية الأوروبية وعدم الاستقرار النقدي في أوروبا وإقامة البنك المركزي الأوروبي



#

من أهم أهداف التكتل الاقتصادي الأوروبي
2
العمل على زيادة معدلات التضخم وزيادة معدلات النمو وخفض نسبة البطالة وخفض معدلات الفائدة
العمل على خفض معدلات التضخم وزيادة معدلات النمو وخفض نسبة البطالة وخفض معدلات الفائدة
العمل على خفض معدلات التضخم وخفض معدلات النمو وخفض نسبة البطالة وخفض معدلات الفائدة




#

يعتبر التكتل الاقتصادي . . . . من أكبر التكتلات الاقتصادية في العالم بعد التكتل الاقتصادي الأوروبي من ناحية الحجم والإمكانيات
2
لأمريكا الجنوبية
لأمريكا الشمالية
للدول العربية




#

من أهداف التكتل الاقتصادي لأمريكا الشمالية (نافتا) انه يسعى إلى تحقيق مجموعة من الأهداف أهمها
1
زيادة معدلات نمو الناتج المحلى الإجمالي للدول الأعضاء
تقليل معدلات نمو الناتج المحلى الإجمالي للدول الأعضاء
تثبيت معدلات نمو الناتج المحلى الإجمالي للدول الأعضاء



#

من أهداف التكتل الاقتصادي لأمريكا الشمالية (نافتا) انه يسعى إلى تحقيق مجموعة من الأهداف أهمها
3
الغاء الحواجز الجمركية وتحرير التجارة وزيادة الاستثمارات
عدم إلغاء الحواجز الجمركية وعدم تحرير التجارة وزيادة الاستثمارات
إلغاء الحواجز الجمركية وتحرير التجارة وزيادة الاستثمارات



#

من أهداف التكتل الاقتصادي لأمريكا الشمالية (نافتا) انه يسعى إلى تحقيق مجموعة من الأهداف أهمها
1
علاج مشكلات البطالة في دول التكتل من خلال زيادة الطاقة الإنتاجية وبالتالي تعظيم فرص العمل أمام الراغبين فيه
علاج مشكلات البطالة في دول التكتل من خلال زيادة الطاقة الإنتاجية وبالتالي تعظيم فرص العمل أمام الراغبين فيه
علاج مشكلات البطالة في دول التكتل من خلال زيادة الطاقة الإنتاجية وبالتالي تعظيم فرص العمل أمام الراغبين فيه



#

من أهداف التكتل الاقتصادي لأمريكا الشمالية (نافتا) انه يسعى إلى تحقيق مجموعة من الأهداف أهمها
1
تحقيق التكامل الاقتصادي بين دول التكتل الاقتصادي القائم على المزايا النسبية والمزايا التنافسية لكل دولة
دم تحقيق التكامل الاقتصادي بين دول التكتل الاقتصادي القائم على المزايا النسبية والمزايا التنافسية لكل دولة
تقليل التكامل الاقتصادي بين دول التكتل الاقتصادي القائم على المزايا النسبية والمزايا التنافسية لكل دولة



#

من أهداف التكتل الاقتصادي لأمريكا الشمالية (نافتا) انه يسعى إلى تحقيق مجموعة من الأهداف أهمها
2
تقليل قدرة التكتل الاقتصادي لأمريكا الشمالية على التعامل مع التكتلات الاقتصادية العملاقة الأخرى وتحقيق ميزة تنافسية
زيادة قدرة التكتل الاقتصادي لأمريكا الشمالية على التعامل مع التكتلات الاقتصادية العملاقة الأخرى وتحقيق ميزة تنافسية
تثبيت قدرة التكتل الاقتصادي لأمريكا الشمالية على التعامل مع التكتلات الاقتصادية العملاقة الأخرى وتحقيق ميزة تنافسية



#

السوق المشتركة لدول . . . . تعبر عن أكبر تكتل اقتصادي في القارة الأفريقية، ويبلغ عددها بعد انضمام مصر إليها واحد وعشرون دولة 
1
شرق وجنوب أفريقيا
غرب وجنوب أفريقيا
شمال وجنوب أفريقيا





#

تسعى السوق المشتركة ( الكوميسا ) لتحقيق الأهداف التالية
1
تحقيق معدل نمو اقتصادي ثابت ومستمر لدول الأعضاء
تحقيق معدل نمو اقتصادي منخفض ومستمر لدول الأعضاء
تحقيق معدل نمو اقتصادي ثابت وغير مستمر لدول الأعضاء



#
تسعى السوق المشتركة ( الكوميسا ) لتحقيق الأهداف التالية
2
خلق بيئة غير مواتية للاستثمار المحلى والأجنبي
خلق بيئة مواتية للاستثمار المحلى والأجنبي
خلق بيئة مواتية للاستثمار المحلى دون الأجنبي



#

تسعى السوق المشتركة ( الكوميسا ) لتحقيق الأهداف التالية
1
تشجيع المشروعات المشتركة في الأنشطة الاقتصادية
عدم تشجيع المشروعات المشتركة في الأنشطة الاقتصادية
وقف المشروعات المشتركة في كافة الأنشطة الاقتصادية





#

تسعى السوق المشتركة(الكوميسا) لتحقيق الأهداف التالية
1
تنمية تطوير العلوم والتكنولوجيا وتحقيق السلام والأمن والاستقرار للدول
عدم تنمية تطوير العلوم والتكنولوجيا وتحقيق السلام والأمن والاستقرار للدول
توقف تنمية تطوير العلوم والتكنولوجيا وتحقيق السلام والأمن والاستقرار للدول



#

تسعى السوق المشتركة (الكوميسا) لتحقيق الأهداف التالية
3
عدم تنمية تطوير العلوم والتكنولوجيا وتحقيق السلام والأمن والاستقرار للدول
تقليل تنمية تطوير العلوم والتكنولوجيا وعدم تحقيق السلام والأمن والاستقرار للدول
تنمية تطوير العلوم والتكنولوجيا وتحقيق السلام والأمن والاستقرار للدول


`,ne=t=>{let[,s,e]=/^!\[(.*)\]\((.*)\)$/.exec(t)||[];return[!!e,s,e]},re=se.split("#").map((t,s)=>{var d;let e=t.trim().split(`
`).filter(p=>p.trim().length>0),r=e.shift()||"failed to parse question",i=Number((d=e.shift())==null?void 0:d.trim()),[n,a,c]=ne(e[0]);n&&e.shift();const l=e.map((p,f)=>({id:m(),text:p,correct:f+1===i}));return g({questionText:r,answers:l,image:c,imageAlt:a})}),ie=`


المسار أو المسلك الذي تمر من خلاله السلع والمنتجات الى المستهلك أو المستخدم النهائي هو
2
وكلاء التصدير
المفهوم العام للقنوات التسويقية في النشاط التصديري
المهام الرئيسية للمصدر في النشاط التصديرية
السعر المرتفع للسلعة


#

من المهام الرئيسية للمصدر في النشاط التصديرية
3
عدم التعرف على القنوات التسويقية المختلفة
عدم فحص البدائل الممكنة للقنوات التسويقية لمنتجاته
اختيار القنوات الأكثر ملائمه
عدم دراسة البدائل الممكنة للقنوات التسويقية لمنتجاته


#

يجرى تسويق المنتجات في الأسواق الخارجية بطرق غير مباشره ومنها
1
تراخيص الإنتاج
وكلاء التصدي
بيوت الاستيراد
تجار الجملة


#

يجرى تسويق المنتجات في الأسواق الخارجية بطرق مباشره ومنها
2
تراخيص الإنتاج
الوسطاء التجاريون
عقود الإدارة
حقوق الامتياز


#

يجرى تسويق المنتجات في الأسواق الخارجية بطرق غير مباشره ومنها
2
المشترين المصنعين
امتلاك الشركات
شركات الاستيراد
الموزعون


#

كلما كانت دورة البيع للمنتج بطيئة كان المسلك التسويقي
2
أطول
أقصر
أبطئ
ليس هناك علاقة




#

من العوامل المؤثرة على طول أو قصر القناة التسويقية
2
التعرف على القنوات التسويقية المختلفة
قدرة المنتج على البقاء سليما
دراسة البدائل الممكنة للقنوات التسويقية


#

هناك بعض العوامل التي تجعل البيع في الأسواق الخارجية يختلف عن البيع في الأسواق المحلية
1
اختلاف الأذواق وأنماط الاستهلاك
عدم اختلاف نظم البيع
اللغة واحده في كل الأسواق
ارتفاع درجة المخاطرة وانخفاض التكاليف التسويقية


#

من المهام الرئيسية للمصدر في النشاط التصديرية
1
فحص ودراسة البدائل الممكنة للقنوات التسويقية 
اختيار القناة الأقل حجما
عدم التعرف على القنوات التسويقية المختلفة
ليس مما سبق


#

في نموذج قنوات التسويق النمطي يوجد الموزع وهو بدوره يشتري من المصدر ثم يبيع الموزع الى
2
عدد محدود من تجار التجزئة
عدد محدود من تجار الجملة
المستهلك النهائي
المصدر


#

في نموذج قنوات التسويق النمطي يوجد تجار التجزئة وهم بدورهم يشت روا من تجار الجملة ثم يبيعوا الى
2
عدد محدود من تجار التجزئة
عدد محدود من تجار الجملة
المستهلك النهائي
المصدر


#

يجرى تسويق المنتجات في الأسواق الخارجية بطرق مباشره ومنها
3
عقود التصنيع
عقود الإدارة
تجار الجملة
حقوق الامتياز


#

من العوامل المؤثرة على طول أو قصر القناة التسويقية الخدمات المطلوبة للمنتج، فمثلا وجود خدمات ما بعد البيع بدرجة عالية، كان المسلك التسويقي
2
طويل
قصير
لا يتأثر
أبطئ



#

من العوامل المؤثرة على طول أو قصر القناة التسويقية المتطلبات والمعاملات الفنية للمنتج، فكلما كانت معقده، كان المسلك التسويقي
2
طويل
قصير
ليس هناك علاقة
أبطئ


#

من العوامل المؤثرة على طول أو قصر القناة التسويقية قدره المنتج على البقاء سليما، فكلما كان هناك سرعه تلف للمنتج، كان المسلك التسويقي
1
طويل
قصير
لا يتأثر
أبطئ


#

يتم تسويق المنتجات في الأسواق الخارجية بطرق غير مباشره، وإحدى هذه الطرق هو عباره عن اتفاق بين شركتين تقوم إحداها بتنظيم بعض أو كل أنشطه الشركة الأخرى
3
المشروعات المشتركة
حقوق الامتياز
عقود الإدارة
تراخيص الإنتاج


#

عقود الإدارة من احدى طرق التسويق للأسواق الخارجية بطريقه غير مباشره بالنسبة للاستثمارات المحددة التي تتطلبها، بانها تحقق عوائد
1
كبيره
صغيره
لا يوجد تأثير
ليس مما سبق


#

يتم تسويق المنتجات في الأسواق الخارجية بطرق مباشره عن طريق الوسطاء، وإحدى هذه الطرق هو شخص اعتباري أو طبيعي يقوم باسم المصدر، ونيابة عنه بالسعي لتوزيع السلعة في الأسواق الخارجية
2
الموزع
الوكيل التصديري
تجار الجملة
تجار التجزئة


#

يتم تسويق المنتجات في الأسواق الخارجية بطرق غير مباشره، وإحدى هذه الطرق يكون بموجبها يمكن بقدر من السرعة والسهولة دخول الأسواق الخارجية المستهدفة
1
امتلاك الشركات من الخارج
تراخيص الإنتاج
عقود الإدارة
عقود التصنيع





#

يتم تسويق المنتجات في الأسواق الخارجية بطرق غير مباشره، وإحدى هذه الطرق تتميز بتغلبها على العقبات الجمركية ومعوقات التصدير الى السوق الخارجي
4
امتلاك الشركات من الخارج
تراخيص الإنتاج
عقود الإدارة
عقود التصنيع


#

يتم تسويق المنتجات في الأسواق الخارجية بطرق مباشره، وتتميز هذه الطريقة بان يقوم المنتج المصدر بتنفيذ البرنامج التصدير ية الخاص به بالكامل
2
التصدير المباشر بواسطة الوسطاء
التصدير المباشر بدون وسطاء
عقود التصنيع
عقود الإدارة


#

يتم تسويق المنتجات في الأسواق الخارجية بطرق مباشره عن طريق الوسطاء، وإحدى هذه الطرق فيها تمارس التجارة الخارجية نشاط عامة استيرادا أو تصديرا وقد تقوم بشراء البضائع كعميل مباشر مع المصدر ثم تقوم ببيعها وتوزيعها في الأسواق
3
وكلاء التصدير
تجاره الجملة
شركات الاستيراد
هيئات الشراء الحكومية


#

يتم تسويق المنتجات في الأسواق الخارجية بطرق مباشره عن طريق الوسطاء، وإحدى هذه الطرق فيها يقومون بالشراء المباشر من المصدر مثل شركات الاستيراد بدلا من الاعتماد على الشراء من الموزعين أو المستوردين أو الوكلاء
2
شركات الاستيراد
تجار الجملة
متاجر التجزئة
المشترين المصنعين


#

يتم تسويق المنتجات في الأسواق الخارجية بطرق غير مباشره ، وإحدى هذه الطرق فيها تتم عمليه إنتاج المنتجات التصديريه وذالك بموجب اتفاق منح ترخيص يحصل بموجبه احد طرفي الاتفاق على الخبرة الفنية والتجارية وحق استخدام الماركة وبراءات الاختراع وذالك في مقابل مبلغ أو نسبه معينه يدفعها للطرف الأخر المانح للترخيص
2
حقوق الامتياز
تراخيص الإنتاج
عقود التصنيع
المشروعات المشتركة


#

يتم تسويق المنتجات في الأسواق الخارجية بطرق مباشره عن طريق الوسطاء، وإحدى هذه الطرق الشركات التي تشتري كميات كبيره وبشكل متكرر من السلع قد يفضلون التعامل مباشره مع المصدر وقد يتم ذالك على أساس تعاقدأو بدون تعاقد
4
شركات الاستيراد
عقود التصنيع
متاجر التجزئة
المشترين المصنعين



#

من أدوات التمويل السابق للشحن، تحدد الدول التي تقدم هذا النوع مثل دوله المكسيك من التمويل أسعار فائدته بما يتناسب وأسعار الفائدة التي تقدمها الدول الأخرى على مثل هذا النوع من التمويل
3
القروض
الصناديق متجددة الموارد
خطابات الاعتماد المتبادلة
جميع ما سبق


#

يتمثل الشكل التقليدي في الخصم التجاري في التمويل الذي يتراوح من ثلاث الى خمس سنوات وهو تمويل
4
قصير الأجل
طويل الأجل
ممتد الأجل
متوسط الأجل


#

تتضمن عمليه الخصم التجاري قيامه كطرف ثالث بضمان الأوراق المالية (تجاريه وكمبيالات وسندات إذنيه) بدون أيه قيود
3
المستورد
المخصم
بنك المستورد
القروض


#

يعد خصم الكمبيالات التي يضمنها البنك واحده من اهم أدوات التمويل . . . . بعد الشحن
1
قصير الأجل
طويل الأجل
ممتد الأجل
متوسط الأجل


#

من أدوات التمويل أثناء وبعد الشحن، تتمثل في قيام الجهة الممولة بتقديم القروض والتسهيلات الائتمانية الى المستوردين
3
الخصم التجاري
الصفقات المتكافئة
ائتمان المشتري الأجنبي
الشراء التبادلي


#

وفقا لهذه الأداة تقوم الدولة التي تتمتع بميزه نسبيه وتنافسيه في احدى القطاعات بتشجيع تدفق الاستثمار المحلي والأجنبي الى تلك القطاعات ومن ثم زيادة الصادرات من تلك القطاعات الى الأسواق العالمية
4
التمويل قبل الشحن
التخصيم
التمويل أثناء وبعد الشحن
التمويل الاستثماري للصادرات





#

تتمثل في قيام المُصدر بالتامين على تحصيل قيمه صادراته عند استحقاق موعد الائتمان الممنوح أثناء عمليه التصدير
1
تأمين ائتمان للتصدير
ضمان الصادرات
A, B
حفظ الصادرات


#

يعد فشل أو رفض المستورد أن يتقيد باي شرط من شروط عقد التصدير إذا كان ذالك المستورد جهة أو مؤسسه حكومية سبق التعامل معها من
2
مخاطر المستورد المغطاة
مخاطر الدولة المستوردة المغطاة
ضمان الصادرات
حفظ الصادرات


#

نظرا لما يواجهه مديري التصدير بالأسواق العالمية من صعوبة الحصول على معلومات صحيحه ودقيقه وحديثه عن الشركات الأجنبية، ولتقليل مخاطر عدم السداد من قبل المستوردين الأجانب فيتم طلب
2
تأمين ائتمان للتصدير
ضمان الصادرات
A, B
حفظ الصادرات


#

يقوم المصدرون في هذا الشكل من أشكال التمويل بالتعاون فيما بينهم في مجال تسويق صادراتهم مما يسهم في زيادة فرص التصدير لتلك الأسواق
3
تأمين ائتمان للتصدير
ضمان الصادرات
تمويل عمليات تسويق الصادرات
تمويل عمليات البيع


#

يعتبر قيام الحكومة بأنشاء مؤسسات متخصصة لتمويل الصادرات دون توفير الموارد المالية الكافية للقيام بهذا الدور
1
من المشكلات التي تؤثر سلبا على الصادرات المصرية
من مميزات الصادرات المصرية
من أدوات التمويل قبل الشحن
من أدوات التمويل أثناء وبعد الشحن


#

يعد من المؤسسات التي تقدم خدمات تمويل الصادرات بمصر، وتم إنشاؤه بموجب القانون رقم 1983 بغرض تشجيع الصادرات المصرية والمعاونة في قيام قطاع تصديري زراعي وصناعي وتجاري ومصرفي
2
الجهاز المصرفي
البنك المصري لتنميه الصادرات
الشركة المصرية لضمان الصادرات
المؤسسة العربية لضمان الاستثمار





#

يعد من المؤسسات التي تقدم خدمات تمويل الصادرات بمصر، وقام البنك المصري لتنميه الصادرات بإنشائها لضمان الصادرات بموجب القانون رقم 21 لسنه 1992 ، وذالك من اجل تنفيذ نظام تامين لضمان الصادرات ضد المخاطر التجارية وغير التجارية
3
الجهاز المصرفي
البنك المصري لتنميه الصادرات
الشركة المصرية لضمان الصادرات
المؤسسة العربية لضمان الاستثما ر


#

رفض المشتري أو امتناعه عن استلام البضاعة المشحونة رغم قيام المصدر بالوفاء بجميع التزاماته تجاه المشتري من المخاطر المغطاة
1
التجارية
غير التجارية
A, B
المخاطر المغطاة غير التجارية


#

تعمل المؤسسة العربية لضمان الاستثمار على توفير خدمات الضمان ضد المخاطر غير التجارية ومن هذه المخاطر المغطاة غير التجارية
2
عدم الغاء سلطات الدولةالمستوردة لترخيص الاستيراد
استيلاء سلطات الدولة المستوردة أو دولة العبور العربي على السلع المشحونة أو حجزها أو مصادرتها
عدم عجز المشتري أو تأخره في سداد المبالغ المستحقة للمصدر
إفلاس المشتري


#

يعد من المؤسسات التي تقدم خدمات تمويل الصادرات بمصر، هو مؤسسه ماليه عربيه مشتركه تهدف للإسهام في تنميه التجارة العربية وقد أنشئ في عام 1989 ويبلغ راس المال المدفوع 500 مليون دولار أمريكي
3
الجهاز المصرفي
البنك المصري لتنميه الصادرا ت
برنامج تمويل التجارة العربية
المؤسسة العربية لضمان الاستثما


#

من أدوات تمويل الصادرات المصرية أثناء وبعد الشحن، تعمل هذه الأداة في قطاعات رئيسيه مثل القطاع الزراعي والغذائي والمجمدات ، الصناعات الدوائية ، الصناعات الهندسية والنسيجية تم التركيز عليها
4
اليات اعاده الخصم
اليه التخصيم
اليه ائتمان المشتري الأجنبي
إدخال خدمه الخصم التجاري للمصدر المصري


#

من أدوات تمويل الصادرات المصرية أثناء وبعد الشحن، يساعد على حل مشكله التدفق النقدي التي قد يعاني منها يعض المصدرين المصريين
4
توفير راس المال العامل
برامج الصناديق المتجددة
اليات اعاده الخصم
اليه التخصيم





#

قامت وزاره التجارة الخارجية بوضع القواعد ومنها : الخصائص المالية للصفقة ، نوع السلعة التي تغطيها، وأجال التغطية وتكاليفها التي تعمل وفقال
3
اليات اعاده الخصم
اليه التخصيم
اليه ائتمان المشتري الأجنبي
إدخال خدمه الخصم التجاري للمصدر المصري


#

تعد سندات التصدير من أدوات التمويل الاستثماري بمصر، حيث يقوم البنك الأهلي بطرح سندات لتمويل الصادرات طويله الأجل من
4
3:1 سنوات
3:1 شهور
10:7 شهور
10:7 سنوات

#

من أدوات التمويل الاستثماري بمصر، يتم ذالك من خلال حصول بنك تنميه الصادرات على قروض من بنوك مثل بنك التنمية الأفريقي وكذالك بنك الصادرات الأمريكي الياباني لتمويل الصادرات المصرية
4
اليه التخصيم
الية ائتمان المشتري الأجنبي
سندات التصدير
الحصول على تمويل دولاري طويل الأجل


#

تتولى الحكومة تدبير مبالغ لمواجهه جزء من أعباء الشركات لضمان مخاطر الصادرات في دعم أقساط الضمان للدول متوسطه المخاطر لتصبح 1% بدلا من
1
1.5%
2%
1%
0.5%

#

من أدوات تامين وضمان الصادرات، حيث تم إعداد وثيقة تقوم بتحمل الدولة لنفقات الاشتراك بهذه الأداة بنسبه تتراوح من 50% الى 75% من التكلفة الكلية في حاله إخفاق المٌصدر في الحصول على تعاقدات فعليه
2
سندات التصدير
ضمان المعارض
ضمان مخاطر الصادرات
اليه التخصيم


#

من أدوات تمويل الصادرات المصرية قبل الشحن، ومن امثلتها توقيع وزاره الخارجية بروتوكول التعاون مع البنك الأهلي المصري في أبريل عام 2004
2
توفير راس المال العامل
برامج الصناديق المتجددة
اليات اعاده الخصم
اليات الخصم




#

تشير العديد من الدراسات الى انه يمكن النظر الى مفهوم الميزة التنافسية
2
مستويان
مستويات ثلاث
مستويات خمس
مستويات ست


#

يمكن النظر الى مفهوم الميزة التنافسية لأكثر من مستوى وهذه المستويات هي
4
الدولة والصناعة فقط
الشركة والدولة فقط
الصناعة والشركة فقط
الدولة والصناعة والشركة


#

تعتبر أحد مستويات الميزة التنافسية وفي هذا المستوي يرتكز الاهتمام حول انعكاس الميزة التنافسية على الرفاهية العامة للدول
1
الميزة التنافسية على مستوى الدولة
الميزة التنافسية على مستوى الصناعة
الميزة التنافسية على مستوى الشركة
الميزة التنافسية على مستوى الفرد الواحد


#

تعتبر أحد مستويات الميزة التنافسية وفي هذا المستوي قد تتمتع الدولة بميزه تنافسيه عالميه في صناعه معينه أو في بعض الصناعات
2
الميزة التنافسية على مستوى الدولة
الميزة التنافسية على مستوى الصناعة
الميزة التنافسية على مستوى الشركة
الميزة التنافسية على مستوى الفرد الواحد


#

تعتبر أحد مستويات الميزة التنافسية وفي هذا المستوي يتم التنافس في السوق العالمي يقوم فيما بين الشركات
3
مستوى الدولة
مستوى الصناعة
الميزة التنافسية على مستوى الشركة
الميزة التنافسية على مستوى الفرد الواحد


#

من مؤشرات الميزة التنافسية
4
النصيب السوقي في الصادرات
معدل نمو الصادرات
الطلب المحلي
خفة الحركة والاعتمادية والتعليم


#

من محددات الميزة التنافسية
1
راس المال البشري ومواصفات الجودة السلعية
عدم تجهيز البيئة التحتية الملائمة لنشاط التصدير
عدم المقدرة على متابعه متطلبات التصدير
عدم تجهيز المقومات الضرورية لنشاط التصدير


#

من محددات الميزة التنافسية
3
خفة الحركة والتشابكات
الاعتمادية والتعليم
الطلب المحلي والمقدرة التكنولوجية
معدل نمو الصادرات والواردات


#

هناك مقاييس لقياس درجة التنافسية ومن أمثلتها
1
النصيب السوقي للصادرات
خفة الحركة
الخطوط العامة لمداخل التنافسية في الدول المتقدمة
معدل نمو الواردات


#

من مؤشرات الميزة التنافسية وهو يعني قدرة المؤسسات والعاملين على استيعاب المعلومات والتقانات الجديدة
3
خفه الحركة
الاعتمادية
التعليم
التشابكات


#

من مؤشرات الميزة التنافسية وهي تعني قدرة المؤسسات على القيام بالتزامات متواصلة وتلبيتها مع مرور الزمن في مواجهة عوامل المخاطرة واللايقين
2
خفه الحركة
الاعتمادية
التعليم
التشابكات


#

من مؤشرات الميزة التنافسية وهي تعني مختلف أشكال الارتباط أو التواصل القائم بين الأسواق المحلية والدولية ومصادر المعلومات والتكنولوجيا
4
خفه الحركة
الاعتمادية
التعليم
التشابكات


#

من مؤشرات الميزة التنافسية وهي قدرة المؤسسات والعاملين على الاستجابة لمؤشرات السوق كما يعكسها الأداء الاقتصادي والتصديري
1
خفه الحركة
الاعتمادية
التعليم
التشابكات


#

من مؤشرات الميزة التنافسية ويشمل على نسبة الأنفاق على الدفاع القومي الى الموازنة الكلية
3
خفه الحركة
الاعتمادية
التعليم
التشابكات


#

من مؤشرات الميزة التنافسية ويشمل نسبة عجز الموازنة مقارنة بالناتج المحلي
2
خفه الحركة
الاعتمادية
التعليم
التشابكات


#

من مؤشرات الميزة التنافسية ويشمل عدد أجهزه التليفزيون والجرائد اليومية لكل ألف نسمه
4
خفه الحركة
الاعتمادية
التعليم
التشابكات


#

من مؤشرات الميزة التنافسية ويشمل متوسط معدل نمو الدخل للفرد ومتوسط معدل نمو الصادرات والواردا ت
1
خفه الحركة
الاعتمادية
التعليم
التشابكات


#

من محددات الميزة التنافسية ويقصد به العمالة المدربة الماهرة المتخصصة عالية الكفاءة والكفاءات العالية من العلماء والخبراء والمهندسين والفنيين
1
رأس المال البشري
الطلب المحلي
القدرة التكنولوجية
مواصفات الجودة السلعية


#

من المقاييس المستخدمة لقياس درجة التنافسية وهو يعبر عن التغير النسبي بالزيادة أو النقص في كميه أو قيمه الصادرات للدولة عامه
2
النصيب السوقي للصادرات
معدل نمو الصادرات
الميزة التنافسية الظاهرة
مؤشر التنافسية الظاهرة لفولراث


#

من المقاييس المستخدمة لقياس درجة التنافسية وهو يقاس بنسبه نصيب صادرات الدولة في الأسواق التصديرية
1
النصيب السوقي للصادرات
معدل نمو الصادرات
الميزة التنافسية الظاهرة
مؤشر التنافسية الظاهرة لفولراث






#

من المقاييس المستخدمة لقياس درجة التنافسية وهو أكثر المقاييس شمولا لكونه يأخذ في الاعتبار كلا من جانبي الصادرات والواردات معا كما يمكن تطبيقه على جانب الصادرات فقط أو الواردات فقط
4
النصيب السوقي للصادرات
معدل نمو الصادرات
الميزة التنافسية الظاهرة
مؤشر التنافسية الظاهرة لفولراث


#

من المقاييس المستخدمة لقياس درجة التنافسية وهو يقيس الأداء التصديري للسلعة من دوله معينه مقارنه بالأداء التصديري العام للصادرات على مستوى الدولة وأيضا للصادرات من نفس السلعة على مستوى العالم
3
النصيب السوقي للصادرات
معدل نمو الصادرات
الميزة النسبيه الظاهرة
مؤشر التنافسية الظاهرة لفولراث


#

من الخطوط العامة لمداخل التنافسية في الدول المتقدمة
2
الميزة التنافسية نسبيه
الميزة تنافسيه وليست نسبيه
الميزة القومية تورث
الميزة القومية لا تكتسب


#

من محددات الميزة التنافسية وتشتمل على المجموع الكلي للمزايا والخواص للسلعة أو الخدمة وما يقترن بها من عمليات أو معاملات كالتغليق والتعبئة وظروف النقل ومدى المطابقة لمعايير الجودة العالمية أو تلك التي تفرضه الدول المستوردة
1
مواصفات الجودة السلعية
الطلب المحلي
القدرة التكنولوجية
راس المال البشري


#

من محددات الميزة التنافسية وهي الوسيلة التي يتم بها تحويل الموارد الى سلع وهي تعد شرطا ضروريا لتأهيل الدولة للمنافسة في الأسواق العالمية
3
مواصفات الجودة السلعية
الطلب المحلي
القدرة التكنولوجية
راس المال البشري


#

يقصد به السعر المدفوع أو الوجب دفعه ثمنا لهذا المنتج من قبل المستورد ودون تحميله باي تكاليف أو رسوم أو نفقات تزيد على ما يتحمله عند البيع
2
الإغرا ق
سعر التصدير
الضرر
هامش الإغراق





#

يقصد بها سعر المنتج في مجرى التجارة العادي في السوق المحلية لدولة المنشأ أو التصدير
3
الإغراق
سعر التصدير
القيمة العادية
هامش الإغراق


#

يجوز لها تقدير القيمة العادية وفقا لتكلفه الإنتاج في دولة المنشأ مضافا اليها مبلغ مناسب من المصروفات البيعية والعمومية والإدارية وهامش ربح مناسب
1
سلطة التحقيق
الشحن البحري
التامين البحري
النقل الداخلي


#

CIF يعرف بانه هو مقدار الإغراق كنسبة مئوية من سعر التصدير
4
الإغراق
سعر التصدير
الضرر
هامش الإغراق


#

يقصد به انخفاض سعر بيع المنتح المستورد في السوق المحلي عن سعر بيع المنتج المثيل الذي تنتجه الصناعة المحلي على نفس المستوى التجاري
1
الفرق السعري
تخفيض الأسعار
الدعم
منع الأسعار المحلية من الزيادة


#

يقصد به انحفاض أسعار بيع المنتج المحلي نتيجة تأثير الواردات التي تباع بأسعار مغرقه( منخفضه)
2
الفرق السعري
تخفيض الأسعار  
منع الأسعار المحلية من الزيادة
الدعم


#

يقصد به عدم حدوث الزيادة في الأسعار التي كان من الممكن أن تحدث لولا وجود الواردات المغرقة
3
الفرق السعري
تخفيض الأسعار  
منع الأسعار المحلية من الزيادة
الدعم






#

يعرف بانه الأثار السلبية التي تقع على الصناعة المحلية نتيجة للممارسات الغير عادله في التجارة الدولية
3
الإغراق
سعر التصدير
الضرر
هامش الإغراق


#

يقسم الضرر الى
2
نوعان
ثلاثة أنواع
خمسه أنواع
نوع واحد


#

من أنواع الضرر، وهو يعني أن هناك ضرر وقع بالفعل على الصناعة المحلية
1
ضرر مادي
التهديد بالضرر
الإعاقة المادية
الأرباح


#

الضرر المادي، وهو يعني أن هناك ضرر وقع بالفعل على الصناعة المحلية ويتم بحثه من خلال
2
عنصر
ثلاثة عناصر
خمسه عناصر
سبعه عناصر


#

يعتبر معدل زيادة كبيره في الواردات المغرقة الى السوق المحلي مما يكشف عن احتمال حدوث زيادة كبيره في الاستيراد من
2
عوامل الضرر المادي
عوامل التهديد بالضرر
عوامل الإعاقة المادية
عوامل الدعم


#

من أنواع الضرر، وهي أنها تفسر على أن الواردات المغرقة تمنع قيام أو إنشاء صناعه جديده في الدولة المستوردة
3
ضرر مادي
التهديد بالضرر
الإعاقة المادية
الأرباح


#

يعتبر من أنواع الدعم، ويعرف بانه الدعم الذي يجب أن يمتنع الأعضاء كلية عن تقديمه
1
الدعم المحظور
الدعم القابل لاتخاذ إجراء
الدعم غير القابل لاتخاذ إجراء
الدعم المخصص للبيئة


#

يعرف بانه أي مساهمه ماليه مباشره أو غير مباشره مقدمه من دولة المنشأ أو من أي هيئة عامه بها من خلال برامج أو خطط وينتج عنها تحقيق فائدة للمنتج أو المصدر
2
الإغراق
الدعم
الضرر
الوقاية


#

تعرف بانها إمكانيه فرض تدابير ضد الزيادة غير المبررة في الواردات سوآءا بشكلها المطلق أو النسبي من الإنتاج وتسبب ضرر جسيما بالصناعة المحلية أو تهديد بحدوث ضرر جسيم
4
الإغراق
الدعم
الضرر
الوقاية


#

تعرف بانها زيادة مطلقه أو زيادة نسبيه بالنسبة للإنتاج المحلي وهي زيادة حدثت مؤخرا بصورة مفاجئة وكبيره وجوهريه
1
الزيادة غير المبررة
الزيادة المبررة
الضرر الخطير
الإعاقة المادية


#

يعرف بانه مستوى اعلى من الضرر المادي في حالات مكافحة الإغراق والإجراءات التعويضية
3
الزيادة غير المبررة
الزيادة المبررة
الضرر الخطير
الإعاقة المادية


#

يعرف بان السلع إذا كان سعر تصديرها الى السوق المحلي في بلد الاستيراد اقل من قيمتها العادية في بلد التصدي
1
الإغراق
الدعم
الوقاية
الضرر


#

يعرف بانه الأضعاف الكلي الكبير في مركز الصناعة المحلية أو التهديد بوقوعه استنادا على وقائع وليس مجرد ادعاءات أو تكهنات
3
الزيادة غير المبررة
الزيادة المبررة
الضرر الخطير
الضرر البسيط





#

من أنواع الدعم المحظو
3
الدعم غير المخصص
الدعم المخصص للبيئة
دعم التصدير
الدعم المخصص للبحوث والتطوير


#

من أنواعه الدعم ، وهو الدعم الذي لا يكون محظورا ويسبب ضررا بالصناعة المحلية لعضو أخر من أعضاء منظمه التجارة العالمية
1
الدعم القابل لاتخاذ إجراء
الدعم المحظور
الدعم غير القابل لاتخاذ إجراء
الدعم المخصص للبيئة


#

هو الفرق بين القيمة العادية وسعر التصدير
3
الدعم
الوقاية
مقدار الإغراق
هامش الإغراق


#

طبقا لاتفاق مكافحة الإغراق يجب إثبات علاقة السببية عن طريق ما يعرف بانه حدوث الضرر تزامن مع زيادة الواردات المغرقة
3
الزيادة غير المبررة
الدعم
بحث التزامن
سعر التصدير


#

تعرف بانها زيادة الواردات سوآءا كانت مطلقه أو نسبيه وهي زيادة نسبة الواردات الى الإنتاج أو الاستهلاك
4
تخفيض الأسعار
الفرق السعري
اثر الواردات على أسعار السلع المنتجة في السوق المحلي
أثر الواردات على اقتصاديات الصناعة المحلية بالنسبة لحجم الواردات


`,oe=t=>{let[,s,e]=/^!\[(.*)\]\((.*)\)$/.exec(t)||[];return[!!e,s,e]},ae=ie.split("#").map((t,s)=>{var d;let e=t.trim().split(`
`).filter(p=>p.trim().length>0),r=e.shift()||"failed to parse question",i=Number((d=e.shift())==null?void 0:d.trim()),[n,a,c]=oe(e[0]);n&&e.shift();const l=e.map((p,f)=>({id:m(),text:p,correct:f+1===i}));return g({questionText:r,answers:l,image:c,imageAlt:a})}),ce=`

تمر دورة حياه المشروع ب . . . . 
3
بمرحلتين
بثلاث مراحل
بأربع مراحل
بخمس مراحل



#
تعنى المزايا أو الجوانب التي يتمتع بها الفرد ب . . . . 
1
نقاط القوة
نقاط الضعف
الفرص
التهديدات



#
تتناول المجالات أول الجوانب التي يتطلب العمل على تقويتها أو استبعادها أو تحديدها ب . . . . 
2
نقاط القوة
نقاط الضعف
الفرص
التهديدات



#
تعنى كيفية تحسين الأداء والخصائص والفرص المتاحة لتحقيق ذلك ب . . . . 
3
نقاط القوة
نقاط الضعف
الفرص
التهديدات


#
يقصد بها المخاطر التي قد يتعرض لها الفرد ب . . . . 
4
1نقاط القوة
نقاط الضعف
الفرص
التهديدات


#
الصورة الذهنية للأثر التنموي المتحقق في الوضع المستقبلي والذي يشمل تغيراً جذريا في حياة السكان المستهدفين
1
الهدف طويل المدى
الأهداف الكلية
الأهداف المباشرة
الأهداف غير المباشرة



#
النتائج العامة المنشودة في شكل تغيير في أوضاع الحياة والسكان المستهدفين
2
الهدف طويل المدى
الأهداف الكلية
الأهداف المباشرة
الأهداف غير المباشرة



#
تسهم في تحقيق الأهداف الكلية والتي تمثل مخرجات مباشره قابله للقياس لأنشطه المشروع
3
الهدف طويل المدى
الأهداف الكلية
الأهداف المباشرة
الأهداف غير المباشرة



#
تتسم الأهداف الذكية ب . . . . صفات
3
ثلاث
أربع
خمس
ست



#
النتائج البعيدة المدى والأكثر شمولا والتي تنتج عاده عن جهود تدخلات مختلفة حكومية وغير حكومية
3
مخرجات
عائدات
أثار
الأهداف الكلية



#
النتائج التي تنشأ عن مجموعه مخرجات مجتمعه لنفس المشروع أو للمشروع
2
مخرجات
عائدات
أثار
الأهداف الكلية



#
النتائج المباشرة لأنشطه المشروع
1
مخرجات
عائدات
أثار
الأهداف الكلية



#
يتسم المؤشر الجيد ب . . . . صفات
3
ثلاث
أربع
خمس
ست



#
تتم عمليه للتقييم المؤسسة كل . . . . 
1
ثلاث سنوات
أربع سنوات
خمس سنوات
ست سنوات



#
عمليه التقييم تتكون من . . . . مراحل رئيسيه
1
ثلاث
أربع
خمس
ست



#
يتصف المقيم الخارجي بأنه . . . . 
4
جزء من الهيكل التنظيمي والسلطة في البرنامج
يجد صعوبة في أن يكون موضوعيا
البرنامج مألوف لديه لذا فهو يفهمه ويستطيع أن يفسر السلوك والاتجاهات الشخصية
يستطيع أن يرى البرنامج بنظره جيده



#
معيار يقيس مدى ملائمه المشروع للمؤسسات والجمعيات والممولين والفئات المستهدفة، وأن على أداره المشروع في هذا المعيار اختيار الفئات المستهدفة
3
معيار الفاعلية
معيار الكفاءة
معيار الموائمة والارتباط 
معيار الأثر



#
لاستغلال الأمثل للموارد المادية والمالية والبشرية لتحقيق المخرجات المخطط لها وذلك بأقل جهد ووقت وتكلفه
2
معيار الفاعلية 
معيار الكفاءة 
معيار الموائمة والارتباط 
معيار الأثر



#
يقيس مدى القرب من تحقيق الأهداف
1
معيار الفاعلية 
معيار الكفاءة 
معيار الموائمة والارتباط 
معيار الأثر



#
قيس مدى تحقق الهدف العام للمشروع والمنظمة على مستوى الفئات المستهدفة والمجتمع على المدى البعيد
2
معيار الفاعلية 
معيار الأثر
معيار الموائمة والارتباط 
معيار الكفاءة 




#
يقيس مدى ديمومة المشروع بعد انتهاءه
2
معيار الفاعلية 
معيار الاستدامة 
معيار الموائمة والارتباط 
معيار الأثر



#
إذا كان للبرنامج أهداف طويله المدى فسوف يكون من غير المجدي قياس الأثر بسرعه أي قبل  . . . . 
4
شهر
موسم
سنه
سنتين



#
تتضمن الحصول على معلومات مفيدة وفى الوقت المناسب من خلال مراقبه ما يفعله الناس
4
طريقه مقابلات شبه منظمه 
طريقه دراسة الحالة 
طريقه الاستبيان 
طريقه الملاحظة المباشرة



#
هي عباره عن توثيق قصه حياه أو تسلسل الأحداث مع مرور الوقت المتعلقة بشخص، أو موق ع، أو أسره، أو مؤسسه
2
طريقه مقابلات شبه منظمه 
طريقه دراسة الحالة 
طريقه الاستبيان 
طريقه الملاحظة المباشرة



#
تتم من خلال الحصول على معلومات وجها لوجه من مجموعه فرديه أو صغيره
1
طريقه مقابلات شبه منظمه 
طريقه دراسة الحالة 
طريقه الاستبيان 
طريقه الملاحظة المباشرة


#
يتم الحصول على بيانات من عدد كبير من الأشخاص بطريقه منظمه وفقا لأسئلة محدده
3
طريقه مقابلات شبه منظمه 
طريقه دراسة الحالة 
طريقه الاستبيان 
طريقه الملاحظة المباشرة



#
تشجع الناس على التفكير النقدي والإبداعي، بدلاً من مجرد إنشاء قائمه بالخيارات أو الإجابات أو الاهتمامات
2
طريقه مجموعات التركيز 
طريقه العصف الذهني 
طريقه تحقيق الأحلام أو الرؤية 
طريقه التغيير الأكثر أهمية



#
تستخدم لجمع معلومات عامه، أوضح في التفاصيل وجمع الأراء حول مشكله من مجموعه صغيره من الأشخاص المختارين الذين يمثلون وجهات نظر مختلفة
1
طريقه مجموعات التركيز 
طريقه العصف الذهني 
طريقه تحقيق الأحلام أو الرؤية 
طريقه التغيير الأكثر أهميه



#
تساعد أصحاب المصلحة في المشروع على التفكير في مدى ملائمه الأنشطة القائمة على رؤى الناس للتنمية
3
طريقه مجموعات التركيز 
طريقه العصف الذهني 
طريقه تحقيق الأحلام أو الرؤية 
طريقه التغيير الأكثر أهميه



#
توفر تمثيل مرئي للمعلومات في سياق جغرافي معيت استنادا إلى تصورات أصحاب المصلحة لأى مشكله
3
نظم تحديد المواقع العالمية
GISطريقه 
طريقه رسم الخرائط
طريقه لتقويمات الموسمية


#
تستخدم لاكتشاف وتسجيل البيانات لفترات زمنيه مميزه لإظهار التغيرات الدورية مع مرور الوقت
3
طريقه الروتين اليومي 
طريقه التغيير الأكثر أهمية 
طريقه التقويمات الموسمية 
طريقه الخريطه الاجتماعية



#
تستخدم لتقييم الاختلافات الرئيسية في المهام اليومية وكيفية التغلب عليها
1
طريقه الروتين اليومي 
طريقه التغيير الأكثر أهمية 
طريقه التقويمات الموسمية 
طريقه الخرطة الاجتماعية



#
تستخدم لتحديد حالات التغييرات الهامة / الحرجة - الإيجابية والسلبية
2
طريقه الروتين اليومي 
طريقه التغيير الأكثر أهمية 
طريقه التقويمات الموسمية 
طريقه الخرطة الاجتماعية


#
رسم يتم فيه عرض الأفكار والمعلومات بطريقه تسهل على ذهنك حفظها وتذكرها
1
 طريقه الخرائط الذهنية 
طريقه تحليل المدخلات والمخرجات 
طريقه التقويمات الموسمية 
طريقه مخطط الارتباط المؤسسي



#
توضح مدى تفاعل الأفراد، أو المنظمات، أو المشاريع، أو الخدمات مع بعض البعض والأهمية النسبية لكل منهم في القضية التي يجرى تقييمها
2
طريقه الخرائط الذهنية 
طريقه تحليل المدخلات والمخرجات 
طريقه التقويمات الموسمية 
طريقه مخطط الارتباط المؤسسي



#
تحليل تفصيلي تساعد الأنظمة في تحليل المدخلات اللازمة لجعل النظام يعمل، وكذلك مخرجاته
2
طريقه الخرائط الذهنية 
طريقه تحليل المدخلات والمخرجات 
طريقه التقويمات الموسمية 
طريقه مخطط الارتباط المؤسسي



#
طريقه العصف الذهني من طرق . . . . 
4
تحليل الروابط والعلاقات 
الاتجاهات التاريخية والجداول الزمنية 
المعلومات الموزعة مكانيا 
المناقشة للمجموعات



#
طريقه نظم تحديد المواقع العالمية من طرق . . . . 
3
تحليل الروابط والعلاقات 
الاتجاهات التاريخية والجداول الزمنية 
المعلومات الموزعة مكانيا 
المناقشة للمجموعات



#
طريقه تحليل الاتجاهات التاريخية للموارد الطبيعية المتجددة من طرق . . . . 
2
تحليل الروابط والعلاقات 
الاتجاهات التاريخية والجداول الزمنية 
المعلومات الموزعة مكانيا
المناقشة للمجموعات



#
طريقه الخرائط الذهنية من طرق . . . . 
1
تحليل الروابط والعلاقات 
الاتجاهات التاريخية والجداول الزمنية 
المعلومات الموزعة مكانيا
المناقشة للمجموعات



#
طريقه مجموعات التركيز من طرق . . . . 
4
تحليل الروابط والعلاقات 
الاتجاهات التاريخية والجداول الزمنية 
المعلومات الموزعة مكانيا
المناقشة للمجموعات



#
طريقه رسم الخرائط من طرق . . . . 
3
تحليل الروابط والعلاقات 
الاتجاهات التاريخية والجداول الزمنية 
المعلومات الموزعة مكانيا
المناقشة للمجموعات



#
طريقه التقويمات الموسمية من طرق . . . . 
2
تحليل الروابط والعلاقات 
الاتجاهات التاريخية والجداول الزمنية 
المعلومات الموزعة مكانيا
المناقشة للمجموعات



#
طريقه مخطط الارتباط المؤسسي من طرق . . . . 
1
تحليل الروابط والعلاقات 
الاتجاهات التاريخية والجداول الزمنية 
المعلومات الموزعة مكانيا
المناقشة للمجموعات



#
طريقه التقويمات الموسمية من طرق . . . . 
2
تحليل الروابط والعلاقات 
الاتجاهات التاريخية والجداول الزمنية 
المعلومات الموزعة مكانيا
المناقشة للمجموعات



#
طريقه الخريطه الاجتماعية من طرق . . . . 
3
تحليل الروابط والعلاقات 
الاتجاهات التاريخية والجداول الزمنية 
المعلومات الموزعة مكانيا
المناقشة للمجموعات



#
طريقه الروتين اليومي من طرق . . . . 
2
تحليل الروابط والعلاقات 
الاتجاهات التاريخية والجداول الزمنية 
المعلومات الموزعة مكانيا
المناقشة للمجموعات



#
طريقه تحليل المدخلات والمخرجات من
1
تحليل الروابط والعلاقات 
الاتجاهات التاريخية والجداول الزمنية 
المعلومات الموزعة مكانيا
المناقشة للمجموعات



#
طريقه خريطه الموارد والخدمات والفرص من طرق . . . . 
3
تحليل الروابط والعلاقات 
الاتجاهات التاريخية والجداول الزمنية 
المعلومات الموزعة مكانيا
المناقشة للمجموعات



#
طريقه التقويمات الموسمية من طرق . . . . 
2
تحليل الروابط والعلاقات 
الاتجاهات التاريخية والجداول الزمنية 
المعلومات الموزعة مكانيا
المناقشة للمجموعات



#
طريقه التغير الأكثر أهمية من طرق . . . . 
2
تحليل الروابط والعلاقات 
الاتجاهات التاريخية والجداول الزمنية 
المعلومات الموزعة مكانيا
المناقشة للمجموعات



#
 من طرق . . . . GIS طريقه 
3
تحليل الروابط والعلاقات 
الاتجاهات التاريخية والجداول الزمنية 
المعلومات الموزعة مكانيا
المناقشة للمجموعات



#
طريقه تحقيق الأحلام أو الرؤية من طرق . . . . 
4
تحليل الروابط والعلاقات 
الاتجاهات التاريخية والجداول الزمنية 
المعلومات الموزعة مكانيا
المناقشة للمجموعات



#
يوضح أهم الأنشطة التي يتم تنفيذها من قبل المؤسسة خلال اليوم وتكون تفصيليه مثل تقارير الأنشطة وتقارير حضور وانصراف الموظفين اليومي، وتكون عاده روتينية لا تحمل مؤشرات
4
تقارير المراقبة والمتابعة 
تقارير خارجيه 
تقارير غير دوريه 
التقرير اليومي


#
تكون مرتبطة بخطه موضوعه أو ببرنامج أو مشروع جارى تنفيذه، وعاده ما تتضمن عمليه مقارنه بين ما هو واقع وما كان يجب أن يتم وفقا للخطة أو البرنامج الموضوع، وتوضيح وتقديم تحليل لها وبيان مسبباتها
1
تقارير المراقبة والمتابعة 
تقارير خارجيه 
تقارير غير دوريه 
التقرير اليومي


#
تقارير تصدر لحاجه معينه أو بناء على طلب محدد دون وجود ضابط زمني لصدورها، ومثال عليها تقرير حول مشكله إدارية أو ماليه أو فنيه محدد
3
تقارير المراقبة والمتابعة 
تقارير دوريه 
تقارير غير دوريه 
التقرير اليومي



#
تهدف إلى الحكم على الكفاءة أو إعطاء درجات أو تقديرات تعبر عن مستوى الأداء خلال فتره التقييم
3
تقارير الأنشطة 
تقارير أوليه 
تقارير تقييم الأداء 
تقارير ماليه ومحاسبيه



#
تركز على وضع المؤسسة أو المشروع ماليا من حيث المصروفات والإيرادات والمركز المالي، وتظهرهذه التقارير العجز أو الربح المتحقق
4
تقارير الأنشطة 
تقارير أوليه 
تقارير تقييم الأداء 
تقارير ماليه ومحاسبيه



#
يصنف التقرير السنوي ضمن التقارير . . . . 
3
حسب المحتوى 
من حيث الجهة التي تصدر من أجلها 
حسب مدتها 
من حيث تكرارها



#
تصنف تقارير المراقبة والمتابعة من ضمن تقارير . . . . 
1
حسب المحتوى 
من حيث الجهة التي تصدر من أجلها 
حسب مدتها 
من حيث توقيتها



#
تصنف التقارير الخارجية من ضمن التقارير . . . . 
2
حسب المحتوى 
من حيث الجهة التي تصدر من أجلها 
حسب مدتها 
من حيث تكرارها



#
تصنف تقارير تقييم الأداء من ضمن تقارير . . . . 
1
حسب المحتوى 
من حيث الجهة التي تصدر من أجلها 
حسب مدتها 
من حيث تكرارها



#
تصنف تقارير الأنشطة من ضمن تقارير . . . . 
1
حسب المحتوى 
من حيث الجهة التي تصدر من أجلها 
حسب مدتها 
من حيث تكرارها



#
تصنف التقارير النهائية من ضمن التقارير . . . . 
3
حسب المحتوى 
من حيث الجهة التي تصدر من أجلها 
من حيث توقيتها 
من حيث تكرارها



#
تصنف التقارير المالية والمحاسبية من ضمن التقارير . . . . 
1
حسب المحتوى 
من حيث الجهة التي تصدر من أجلها 
حسب مدتها 
من حيث تكرارها



#
تصنف التقارير الداخلية من ضمن التقارير . . . . 
2
حسب المحتوى 
من حيث الجهة التي تصدر من أجلها 
حسب مدتها 
من حيث تكرارها



#
يصنف التقرير النصفي من ضمن التقارير . . . . 
3
حسب المحتوى 
من حيث الجهة التي تصدر من أجلها 
حسب مدتها 
من حيث تكرارها




#
الرصد
1
عملية مستمرة من جمع وتحليل البيانات ومقارنتها مع ما هو مخطط ومتوقع،لمعرفة مدي كفاءة أداء المشروع أو البرنامج اعتمادا على قياس مؤشرات محددة، ويستمر الرصد طوال فترة تنفيذ المشروع




#
التقييم
1
تقدير منهجي موضوعي لتصميم وتنفيذ ونتائج مشروع أو برنامج، ويتم تنفيذه عند نقط زمنية محددة مثل منتصف المدة وختام المشروع




#
البيانات الأولية
1
تجمع مباشرة من قبل المؤسسة من خلال المسوحات أو المشاهدة المباشرة والمقابلات




#
البيانات الثانوية
1
تستمد من بيانات سبق جمعها من قبل جهة أخري




#
المقيم الخارجي
1
شخص قادر علي رؤية البرنامج بنظرة جديدة باعتباره غير مشارك فيه




#
المقيم الداخلي
1
شخص من داخل البرنامج أو ممن يعرفون البرنامج جيدا يعرف فعليا اتجاه عمل البرنامج وكذلك أهدافه ومشاكله ونقاط ضعفه




#
خريطة للموارد والخدمات والفرص
1
تستخدم للحصول على معلومات عن الموارد والخدمات المتاحة في المجتمع وتشمل الموارد، الخدمات، الأوضاع الاجتماعية، الاقتصادية، السكانية والجغرافية عن المنطقة التي يعيش فيها المجتمع





#
الخريطة الاجتماعية
1
تستخدم في جمع وتحليل المعلومات المتعلقة بأفراد المجتمع وهي من الطرق ذات المردود الجيد لأن نتائجها تعتبر مدخل لتوضيح التدرج حسب الثروة، حيث تستخدم للحصول على البيانات المتعلقة بطبيعة المساكن والسكان والمهن التي يمارسها أفراد المجتمع




#
التقرير الأسبوعي
1
يوضح أهم الأنشطة التي يتم تنفيذها في المؤسسة خلال الأسبوع وتكون تفصيلية مثل تقارير دوائر وأقسام المؤسسة الإنتاجية




#
التقرير الربعي
1
يوجز أنشطة المؤسسة خلال فترة ثلاث شهور ويعكس في طياته الإنجازات والأداء والمعوقات




#
تقارير دورية
1
يتم إصدارها بشكل متكرر ضمن فترات زمنية محددة




#
تقارير أولية
1
تقارير تقدم عند بدء المشروع أو النشاط أو المهمة وتتضمن معلومات عن الطاقم وخطة ومنهجية العمل




#
تقارير مرحلية
1
تقارير تقدم بفترة تنفيذ المشروع وقبل الانتهاء منه وتتضمن معلومات وبيانات فنية ومالية حول الأنشطة المنفذة وخطة العمل والمعيقات التي تواجه عملية التنفيذ




#
تقارير نهائية
1
تقارير تقدم بنهاية المشروع وتعرض سردا تفصيليا (ماليا وفنيا) عن الأنشطة المنفذة خلال فترة المشروع




#
تقارير الأنشطة
1
يتم التركيز بهذا النوع من التقارير على الأنشطة من حيث عناصرها وآليات تنفيذها والمعيقات في سبيل القيام بها




#
المشروع
1
مشكلة أو حاجة معينة يتم تحديدها ضمن إطار منظم وتتضمن الاستثمار الأمثل للموارد في ظل وجود أهداف محددة وندرة في الموارد




#
البرنامج
1
يتكون من مجموعة مشاريع مبنية ضمن خطة واضحة المعالم ومشتركة  مع بعضها البعض في (جانب أو أكثر )موضوعيا، مكانيا، سكانيا، تنظيميا




#
النشاط
1
جزء من المشروع يتمثل في الإجراءات التي تحقق أهداف المشروع




#
دراسة الجدوى
1
تحليل لعناصر المشروعات الاقتصادية لتقرير الاستمرار فيه أو إلغاء الفكرة




#
الإطار المنطقي
1
وصف لكيفية استخدام الموارد (المدخلات) من خلال تنفيذ إجراءات وأنشطة للحصول على مجموعه من النتائج




#
تحليل المخاطر
1
تحديد كل العوامل التي يمكن أن تنشأ وتعترض المشروع وتؤثر سلبا على تنفيذه ومعدلات نجاحه




#
تحليل الوضع القائم
1
تحديد مدي احتياج الفئات المستهدفة للمشروع ومكوناته وأوليات هذه الاحتياجات، وتحديد الاحتياجات ذات الأولوية الأعلى




#
المؤشرات
1
متغيرات كمية أو نوعية توفر وسيلة موثقة لقياس الأداء أو الإنجاز

`,le=t=>{let[,s,e]=/^!\[(.*)\]\((.*)\)$/.exec(t)||[];return[!!e,s,e]},ue=ce.split("#").map((t,s)=>{var d;let e=t.trim().split(`
`).filter(p=>p.trim().length>0),r=e.shift()||"failed to parse question",i=Number((d=e.shift())==null?void 0:d.trim()),[n,a,c]=le(e[0]);n&&e.shift();const l=e.map((p,f)=>({id:m(),text:p,correct:f+1===i}));return g({questionText:r,answers:l,image:c,imageAlt:a})}),de=`

العلاقة بين البيئة والمشروع هي علاقة . . . . 
2
تكامليه
تبادليه
عكسية
طرديه


#

مناخ الاستثمار الذي يعمل من خلاله المشروع، بالإضافة إلى الناحية القانونية التي تتعلق ببيئة المشروع
1
آثار البيئة الاستثمارية
اثار البيئة الطبيعية
اثار البيئة التكنولوجية
اثار البيئة السياسية


#

يعبر . . . . عن البيئة التي يعمل فيها المشروع بكل مكوناتها الاقتصادية والسياسية والاجتماعية .
2
أثر المشروع على البيئة
أثر البيئة على المشروع
أثر البيئة والمشروع على المجتمع
غير ذلك


#

لأثار المشروع على البيئة توجد . . . . احتمالات تنشأ من طبيعة المنتجات التي يقدمها المشروع.
1
ثلاث
أربع
خمس
ست


#

احتمال وجود آثار ضارة بالبيئة لا يمكن معالجتها ولا السيطرة عليها، يؤدى إلى
2
قبول المشروع
رفض المشروع
إضافة تكاليف استثمارية كبيرة
تركيب معدات خاصة


#

احتمال وجود آثار ضارة بالبيئة يمكن معالجتها يؤدى إلى
4
تغيير المشروع
رفض المشروع
قلة التكاليف الاستثمارية
تركيب معدات خاصة



#

من أهم المصطلحات الأساسية لتقييم الأثر البيئي .
2
مخاطر المشروع
مصادر التلو ث
معوقات المشروع
الموارد الاقتصادية


#

سلسلة من المواصفات القياسية لتقييم الأداء البيئي للمؤسسة لتصبح المؤسسة أكثر فاعلية تجاه المحافظة على البيئة والحدمن التلوث والوصول الأداء بيئي متميز يحافظ على أمن الأرض.
4
معايير الجودة
مواصفات تقرير التقييم
المواصفات العالمية
المواصفات القياسية


#

كل ما يلي يوضح الآثار البيئية الرئيسية التي قد تنتج عن بعض المشاريع بالنسبة للهواء ما عدا . . . . 
2
زيادة انبعاثات ملوثات الهواء
التعارض مع شبكات الصرف الحالية
انتشار الروائح الكريهة
تغيرات في ديناميكية الهواء


#

كل ما يلي يوضح الآثار البيئية الرئيسية التي قد تنتج عن بعض المشاريع بالنسبة للمياه ما عدا . . . . 
1
تأثير على المزارع الفريدة النوعية
تغيرات في توزيع القنوات المائية
إعاقة وانسداد مأخذ المياه (الري)
إعاقة مسارات مياه الفيضان


#

كل ما يلي يوضح الآثار البيئية الرئيسية التي قد تنتج عن بعض المشاريع بالنسبة للتربة ما عدا . . . . 
4
توازن ميول جوانب التربة
حدوث إحلال للتربة
حدوث انتقال للأيونات السامة والمعادن الثقيلة
الانبعاثات الضارة


#

من الآثار البيئية الرئيسية التي قد تنتج عن بعض المشاريع على البيئة البيولوجية بالنسبة (للحياة النباتية) ما عدا . . . . 
3
تغييرات في إنتاجية وتنوع المحاصيل الموجودة
إمكانية انقراض الفصائل النباتية النادرة
أثار انخفاض جودة المياه على الكائنات الحية الدقيقة
تحسين الخدمات الزراعية



#

من الآثار البيئية الرئيسية التي قد تنتج عن بعض المشاريع على البيئة البيولوجية بالنسبة (للحياة الحيوانية) ما عدا . . . . 
1
تحسين الخدمات الزراعية
تواجد فصائل جديدة من الكائنات الحيوانية
إعاقة أو تغييرمسارات حجرة الكائنات الحيوانيه
تغييرات في الأنواع السمكية


#

من الآثار الاجتماعية والاقتصادية التي قد تنتج عن بعض المشاريع . . . . 
2
إعاقة مسارات مياه الفيضان
تغيير في أسعار الأراضى
زيادة الطلب على الوقود والغاز
الوصول للخدمات الطبية


#

من الآثار البيئية الرئيسية التي قد تنتج عن بعض المشاريع بالنسبة لحركه المرور والانتقال . . . . 
3
تحسين الانتقال للمدارس والجهات الحكوميين
زيادة المرور في المناطق التاريخية .
تحسين الترابط بين القرى
تحسين خدمات إطفاء الحرائق


#

من الآثار البيئية الرئيسية التي قد تنتج عن بعض المشاريع بالنسبة للخدمات العامة والمرافق . . . . 
1
زيادة الطلب على الوقود والغاز
زيادة انبعاثات ملوثات الهواء
تغيرات في توزيع القنوات المائية
انتشار الطحالب


#

من الآثار البيئية الرئيسية التي قد تنتج عن بعض المشاريع بالنسبة لصحه الأنسان . . . . 
4
تحسين خدمات الطوارئ
زيادة التعرض الأمراض المستوطنة
ظهور بعض الأمراض الجديدة
B&C معا


#

هي مجموعة الأطر المؤسسية والنظم الاقتصادية والاجتماعية والقانونية المؤثرة على توجهات القرارات الاستثمارية
2
مقومات الاستثمار
مناخ الاستثمار
الخطط الاستثمارية
قوانين الاستثمار



#

هي الدراسة التي يتم إجراؤها للمشروع لتحديد الآثار المحتملة أو الناجمة عن المشروع، والإجراءات والوسائل المناسبة لمنع الآثار السلبية أو تخفيضها وتحقيق أو زيادة المردودات الإيجابية للمشروع على البيئة بما يتوافق مع المقاييس البيئية المعمول بها.
3
تقييم الأثرالاجتماعى
تخطيط المشروع
تقييم الأثرالبيئى
تقييم المشروع



#

هو الفحص المنظم للآثار غير المتعمدة التي تنجم عن مشروع أو برنامج تنموي، وذلك بهدف تقليص أو تخفيف حدة الآثار السلبية وتعظيم الآثار الإيجابية
1
تقييم الأثر البيئى
تقييم المشروع
تخطيط المشروع
تقييم الأثر الاجتماعى



#

جميع ما يلي يعد من أهداف تقييم الأثر البيئي ما عدا . . . . 
4
حماية البيئة والحفاظ على صحة الإنسان
المراقبة البيئية المستمرة لمشروعات التنمية
تحسين عملية صناعة اتخاذ القرار
بناء الثقة في القيادات المحلية



#

قانون حماية البيئة يستند في تعريفه للمنشآت التي تخضع لتقييم الآثار البيئية على المبادئ الرئيسية التالية ما عدا . . . . 
2
نوعية النشاط المنشأة
مساحة المنشأ ة
موقع المنشأة
نوعية الطاقة المستخ دمة لتشغيل المنشأة


#

تصنف المشروعات تبعا لتأثيرها على البيئة ل . . . . 
2
فئتان
ثلاث فئات
أربع فئات
خمس فئات


#

فئة لا تحتاج إلى إعداد دراسات التقييم البيئي وإنما يجب الالتزام بالتنظيمات والاشتراطات الفنية والصحية لهذه الأنشطة التي تم أخذها في الاعتبار في أثناء مرحله إعداد المخطط العام للمدينة أو القرية منها . . . . 
3
مراكز بيع مواد البناء
محطات الوقود والغسيل والتشحيم
المساجد - المدارس
مدافن النفايات البلدية


#

فئة تحتاج إلى تعبئه استمارة التقييم البيئي للمشاريع التي تُعد من قِبل أحد المكاتب الاستشارية المعتمدة والمؤهلة من قبل الرئاسة العامة للأرصاد وحماية البيئة منها . . . . 
1
مجمعات الأسواق التجارية
المحلات المهنية
محلات بيع وتوزيع الغاز
المحلات التي لها علاقة بالصحة العامة




#

فئة (مشاريع) تحتاج إلى إعداد دراسة تقييم بيئي شامل واقتراح الحلول الكفيلة لتجنب أو تخفيف الآثار البيئية في أثناء اختيار الموقع والتصميم والتنفيذ والتشغيل منها . . . . 
4
المدراس
المراكز الترفيهية
سوبر ماركت
شبكات الصرف الصحي
من خطوات تقييم الأثر البيئي ويتطلب اعداد قائمة توضح هذا النشاط بكافة عناصره من حيث التخطيط والاعداد والمواد 


#

المستخدمة وكيفية التخلص من المخلفات 
2
تحليل الأثر
التمييز والاختبار
البحث عن بدائل
الإشراف


#

من خطوات تقييم الأثر البيئي التي تركز على المكونات البيئية وأهميتها وتأثيرها بالمشروع.
1
تحديد الأهداف المؤثرة والشروط المرجعية
تقييم الدراسات الخاصة بالآثار البيئية
تجنب الآثار والتعويض
التدقيق


#

تحديد الحقائق وتقييمها من حيث قوة هذا الأثر وأهمية قيمته وحقيقته .
4
الإشراف
تحليل الأثر
البحث عن البدائل
تقييم الأثر


#

إجراء يتم ممارسته خلال العمل بالنشاط التطويري لمنع أو لتقليل او إصلاح الأثر البيئي السلبي من خلال استبدال او إيجاد مصدر بديل (الإجراء التخفيفي)
1
البحث عن البدائل
تجنب الآثار والتعويض
تقييم الدراسات الخاصة بالآثار البيئية
تقييم الأثر


#

هي عملية الحد او التخفيف من المؤثرات البالغة على البيئة، وكيفية التعرض للمؤثرات التي لا يمكن تجنبها، مع الوضع في الاعتبار بان التعويض يؤدي الى زيادة التكلفة
2
تقييم الاثر
تجنب الآثار والتعويض
تحديد الأهداف المؤثرة والشروط المرجعية
البحث عن البدائل


#

تكون باتباع خطة ادارية تستند الى تقرير تقييم الأثار البيئية والذي يبين مسؤولية كل من مقدم المشروع والحكومة
3
تحديد الأهداف المؤثرة والشروط المرجعية
الإشراف
المراقبة والإدارة البيئية
التدقيق






#

هو ضمان ان جميع الجوانب الهامة المتعلقة بالمشروع ذكرت في الشروط المرجعية(متطلبات وزارة البيئة)
4
التدقيق
البحث عن البدائل
تجنب الآثار والتعويض
تقييم الدراسات الخاصه بالآثار البيئيه


#

القيام بنشاطات الترخيص واتمام عملية عقود البناء وتكون مقترحة في تقرير تقييم الأثر البيئي 
1
إقرار المشروع وشروط التراخيص
تحديد الأهداف المؤثرة والشروط المرجعية
تجنب الآثار والتعويض
تقييم الدراسات الخاصه بالآثار البيئيه


#

عبارة عن نشاط حكومي تقوم به الوزارة او سلطة البيئة للتاكد من مطابقة الشروط للترخيص
2
تقييم الدراسات الخاصه بالآثار البيئيه
الإشرا ف
التمييز والإختبار
تحديد الأهداف المؤثرة والشروط المرجعية


#

مهم في كل مراحله من بداية التفكير بالمشروع حتى اقامته
4
البحث عن البدائل
تحليل الأثر
تجنب الآثار والتعويض
التدقيق


#

هي تلك المشروعات التي توفر خدمة أو سلعة تعد حاجة أو رغبة اجتماعية حيوية دون أن تقصد تحقيق الأرباح من وراء ذلك
1
المشروعات الاجتماعية
المشروعات التجارية
المشروعات الخاصة
المشروعات العامة


#

من أنواع المشروعات الاجتماعية
4
مشاريع الاستثمارالخا ص
مشاريع الاستثمارالعام
مشاريع الاستثمارالقطاعى
مشاريع الاستثمار المادي


#

من أنواع المشروعات الاجتماعية
3
مشاريع الاستثمارالخا ص
مشاريع الاستثمارالعام
مشاريع الاستثمار البشري
مشاريع الاستثمار القطاعى


#

من امثله المشروعات التي تنصب على الاستثمار المادي
2
مشروعات التعليم
مشروعات النقل والإسكان
مشروعات الصحة
مشروعات البحث العلمي


#

من امثله المشروعات التي تنصب على الاستثمار البشري
1
مشروعات التعليم والصحة
مشروعات النقل
مشروعات الاسكان
مشروعات الصرف الزراعي


#

من خصائص المشروعات الاجتماعية
4
تنشأ بهدف الربح
وجود تنافس في استهلاك منتجاتها
تجانس مخرجاتها
عدم وجود سوق لمخرجاتها


#

من خصائص المشروعات الاجتماعية
2
تنشأ بهدف الربح
عدم وجود تنافس في استهلاك منتجاتها


#

من خصائص المشروعات الاجتماعية
3
تنشأ بهدف الربح
وجود تنافس في استهلاك منتجاتها
عدم تجانس مخرجاتها
وجود سوق لمخرجاتها


#

من خصائص المشروعات الاجتماعية
1
إلغاء دوافع الربح في نشاطها
وجود تنافس في استهلاك منتجاتها
تجانس مخرجاتها
وجود سوق لمخرجاتها


#

تعد من الطرق الشائعة في تقييم المشروعات الاجتماعية
4
الطريقة الكمية
الطريقة الوصفية
الطريقة التقديرية
الإحساسات والأحكام العامة


#

تعد من الطرق الشائعة في تقييم المشروعات الاجتماعية
3
الطريقة الكمية
الطريقة الوصفية
الاستعانة بمؤشرات مهنيه لمشاريع قائمه
الاستعانة بمؤشرات تقديريه


#

تعد من الطرق الشائعة في تقييم المشروعات الاجتماعية
1
الاسناد الى أحكام مبنيه على الخبرة 
الطريقة الوصفية
الطريقة التقديرية
الطريقة الكمية


#

تعد من الطرق الشائعة في تقييم المشروعات الاجتماعية
4
الطريقة الكمية
الطريقة الوصفية
الطريقة التقديرية
المنافع والتكاليف الاجتماعية


#

طريقه الإحساسات والأحكام العامة من الطرق الشائعة في تقييم المشروعات الاجتماعية، غالبا ما تكون غير قائمة على أسس
1
اقتصاديه
غير علميه
عشوائية
علميه


#

طريقه الإسناد الى أحكام مبنيه على الخبرة، غالبا ما تكون
3
علميه
إحصائية
تقديريه
حسابيه


#

طريقه الإسناد الى أحكام مبنيه على الخبرة، وذلك من جانب الافرا د
2
غير المختصين
المختصين
الهواه
المتدربين


#

المنافع والتكاليف المباشرة تتعلق ب
1
تحقيق الأهداف الرئيسية للمشروع
المنتجات الجانبية للمشروع
التقييم من خلال نظام السوق
كيفية تمويل المشروع




#

المنافع والتكاليف غير المباشرة تتعلق ب
2
تحقيق الأهداف الرئيسية
المنتجات الجانبية للمشروع
التقييم من خلال نظام السوق
كيفية تمويل المشروع


#

المنافع والتكاليف الملموسة يمكن تقييمها من خلال السوق اي
2
لها قيمه ثابته
لها قيمه سوقيه
لها مرونة دخليه
تدخل في انتاج خدمه وسطيه


#

من خطوات معيار فعالية التكاليف
1
تحديد الاهداف
تحديد المعوقات
تحديد الموارد
تحديد التكاليف


#

مقياس من مقاييس الفعالية، وهو يعبر عنه بالمهارات والمعارف المكتسبة من برامج تدريب العاملين على تكنولوجيا حديثه
3
عمل منجز
منتجات مصنعه
منافع محققه
أثر محقق


#

مقياس من مقاييس الفعالية، وهو يعبر عنه الذي يحدثه تشغيل المتعلمين العاطلين من أثر على المجتمع، نتيجة انخفاض معدلات الجريمة، وزيادة الديمقراطية، وكذلك الاستفادة بخبراتهم .
4
عمل منجز
منتجات مصنعه
منافع محققه
أثر محقق


#

تقوم الأسس الفلسفية/ الأيديولوجية على
1
التقييم الموضوعى
التقييم الشهرى
التقييم الشكلي
التقييم المادى




#

يعتبر من أسس تقييم المشروعات، يصلح هذا الأسلوب لتقييم المشروعات الحكومية والعامة التي تستهدف تحقيق مصلحة عامة
1
تقييم الأثر النهائي للمشروع
التقييم الشخصى
التقييم الموضعى
تقييم المنافع أو المخرجات النهائية للمشروع


#

يعتبر من أسس تقييم المشروعات، يهتم بما حققته بعض الفئات أو بعض أصحاب المصالح من مكاسب
4
تقييم الأثر النهائي للمشروع
التقييم الشخصى
التقييم الموضعى
تقييم المنافع أو المخرجات النهائية للمشروع


#

منهج ينصب على ما إذا كانت هذه الأهداف قد تحققت أم لا؟
2
مناهج التقييم على أساس إداري
مناهج تقييم الأهدا ف
مناهج التقييم على أساس المستهلكين
مناهج قائمه على الخبرة


#

مناهج تقوم على أساس توفير معلومات التقييم للمساعدة في اتخاذ القرارات
1
مناهج التقييم على أساس إداري
مناهج تقييم الأهداف
مناهج التقييم على أساس المستهلكين
مناهج قائمه على الخبرة


#

مناهج تعكس اهتمام المستخدمين النهائيين عموما للسلع والخدمات التي يوفرها المشرو ع
3
مناهج التقييم على أساس إداري
مناهج تقييم الأهداف
مناهج التقييم على أساس المستهلكين
مناهج قائمه على الخبرة


#

تعد من أقدم مناهج التقييم وتقوم على الأحكام الشخصية المهنية، وتؤدي عملية التقييم إما بشكل رسمي أو غير رسمي سواء قام بها شخص واحد أو فريق عمل .
4
مناهج التقييم على أساس إداري
مناهج تقييم الأهداف
مناهج التقييم على أساس المستهلكين
مناهج قائمه على الخبرة



#

مناهج أهم عيوبها الاعتماد الكبير على الخبرات الشخصية، وعدم توافر معايير قياسية سواء ضمنية أو منشورة
3
مناهج التقييم على أساس إداري
مناهج تقييم الأهداف
منهج التقييم على أساس المشاركة
مناهج قائمه على أساس التعلم


#

مشاركة أي شخص في منافعها لن يؤدى إلى حرمان أو تخفيض منافع أشخاص آخرين إذ أن تلك المنافع تكون متاحة للجميع وبدون تعارض.. يطلق على هذا المبدأ
1
مبدأ الاستبعاد
مبدأ المعارضة
مبدأ الاستغلال
مبدأ التمييز


#

من مجالات قياس فعالية البرامج للمشاريع التي لا تهدف للربح
3
مؤشرات ايجابيه
منتجات وسطيه
أثر محقق
منتجات بديله


#

مناهج تقييم المشروعات وفقا للأسس النظرية والعلمية
3
اربعه مناهج
خمسه مناهج
ست مناهج
ثمانية مناهج


#

إجمالي التغييرات الإيجابية والسلبية الناشئة عن أحد المشروعات التي تهدف لصنعه على فئة مستهدفة من المجتمع
2
الأثر الاقتصادى
الأثر الاجتماعى
الأثر السياسى
الأثر المالى


#

يركز على التأثيرات الخاصة بمقترحات المشروعات ومعرفة عواقب المشروعات المقترحة على الإنسان، ولفت الانتباه إلى تخفيف تلك العواقب
1
تقييم الأثر الاجتماعى
تقييم الأثر الاقتصادى
تقييم الأثر السياسى
تقييم الأثر المالى



#

يرى البعض التأثيرات الاجتماعية في علاقتها بتغيرات البيئية ذات طابع
2
واسع
محدو د
منتشر
غير محدود


#

من الخصائص الرئيسية والمرتبطة بالتأثيرات الاجتماعية ويعبر عنها النماذج الجديدة للتوظيف/ الدخل
2
التغيير السكانى
التغيير الاقتصادى
التغيير البيئي
التغيير المؤسسى


#

من الخصائص الرئيسية والمرتبطة بالتأثيرات الاجتماعية ويعبر عنها التغيير في هيكل الحكومة المحلية أو القيادة التقليدية، تقسيم الناطق بالقوانين، امتلاك الأر ض
4
التغيير السكانى
التغيير الاقتصادى
التغيير البيئي
التغيير المؤسسى


#

يمكن أن تقسم الأنواع الأساسية للتأثيرات الاجتماعية الى
2
أربعه فئات متداخله
خمس فئات متداخله
ست فئات متداخله
عشر فئات متداخله


#

من الأنواع الأساسية للتأثيرات الاجتماعية وهي تؤثر على طريقة تصرفات الإنسان وعلاقة العائلة، الأصدقاء
1
تأثيرات على طريقه المعيشة
التأثيرات الثقافية
التأثيرات المجتمعية
تأثيرات الترفيه


#

من الأنواع الأساسية للتأثيرات الاجتماعية وهي تؤثر على البنية الأساسية، الخدمات، المنظمات المتطوعة وأنشطة الشبكا ت
3
تأثيرات على طريقه المعيشة
التأثيرات الثقافية
التأثيرات المجتمعية
تأثيرات الترفيه



#

من الأنواع الأساسية للتأثيرات الاجتماعية وهي تؤثر على الحالة النفسية والبدنية والاجتماعية
3
تأثيرات على طريقه المعيشة
التأثيرات الثقافية
التأثيرات الصحية
تأثيرات الترفيه


#

من الأنواع الأساسية للتأثيرات الاجتماعية وهي تؤثر على العادات المرتبطة، واللغة، المعتقدات الدينية وعناصر أخرى لتي بها التميز العرقي أو الاجتماعي . 
2
تأثيرات على طريقه المعيشة
التأثيرات الثقافية
التأثيرات الصحية
تأثيرات الترفيه


#

مرحلة من دورة حياة المشروع تبدأ بالإعلان عن المشروع والذي يمكن أن يكون له تأثيرات اجتماعية
4
الاغلاق والتنازل
الانشاء / التنفيذ
التشغيل والصيانة
التخطيط أو السياسة المتطورة


#

مرحلة من دورة حياة المشروع دائما ما تأخذ التأثير الاجتماعي الأكبر، من وجهة النظر الاجتماعية هو عمل تمزيقى
2
الاغلاق والتنازل
الانشاء / التنفيذ
التشغيل والصيانة
التخطيط أو السياسة المتطورة


#

هذه المرحلة تتعلق بتجهيز وتهيئة الأرض ثم بناء المنشأة وشق الطرق والمنافع، وينتج عنها مخاطر تؤثر على جودة الحياة للسكان المحليين
2
الاغلاق والتنازل
الانشاء / التنفيذ
التشغيل والصيانة
التخطيط أو السياسة المتطورة


#

هذه المرحلة غالبا تشكل توترا في البنية الأساسية للمجتمع ويمكن أن تشير بانفجار ودورة انكسارية
2
الاغلاق والتنازل
الانشاء / التنفيذ
التشغيل والصيانة
التخطيط أو السياسة المتطورة


#

هذه المرحلة من المشروع تستمر لسنوات عديدة. في كثير من الحالات، تكون فترة نسبيا ثابتة مقارنة بالتغيير الاجتماعي الذي يحدث أثناء الإنشاء، يحتاج لعمالة إضافية وهناك وافدون جدد
3
الاغلاق والتنازل
الانشاء / التنفيذ
التشغيل والصيانة
التخطيط أو السياسة المتطورة


#

هذه المرحلة لها تأثير اجتماعي مميز، وخاصة عندما تكون المنشأة هي الدعامة الأساسية لقاعدة الاقتصاد المحلى أو لمستخدم الوحيد لمجتمع منقب عن الهدف الواحد
1
الاغلاق والتنازل
الانشاء / التنفيذ
التشغيل والصيانة
التخطيط أو السياسة المتطورة


#

تتضمن الفائدة التي تعود من عمل تقييم تأثير اجتماعي منتظم
2
ارتفاع التكلفة
تجنب التأخير والعوائق
ارتفاع التأثير على الأفرا د
عدم تعزيز الفوائد للمتضررين


#

تتضمن الفائدة التي تعود من عمل تقييم تأثير اجتماعي منتظم
3
ارتفاع التكلفة
ارتفاع التأثير على الأفرا د
تحسين المشروعات المقترحة
عدم تحسين العلاقات بالمجتمع وزيادة الخوف


#

تتضمن الفائدة التي تعود من عمل تقييم تأثير اجتماعي منتظم
1
تقليل التكلفة
ارتفاع التأثير على الأفرا د
عدم تجنب العوائق
عدم تعزيز الفوائد للمتضررين


#

من خطوات عمليه تقييم التأثير الاجتماعي، ويتم بها تحليل وتوقع التأثيرات المحتملة المشروع المقترح والبدائل
4
المشاركة العامة
تعريف البدائل
دراسة النطا ق
تقدير التأثيرات المحتملة


#

من خطوات عمليه تقييم التأثير الاجتماعي، ويتم بها تطوير وتنفيذ خطة لاشتراك العامة بفعالية ولاشتراك كل المعنيين والمهتمين والمتأثرين
1
المشاركة العامة
تعريف البدائل
دراسة النطاق
تقدير التأثيرات المحتملة


#

من خطوات عمليه تقييم التأثير الاجتماعي، ويتم بها توثيق تأثير المشروع المقترح على ترابط البيئة البشرية/ المساحة، والشروط والاتجاهات الاجتماعية الحالية
4
المشاركة العامة
تعريف البدائل
دراسة النطاق
ظروف دراسة خط الاساس


#

يعتبر حاسم لكسب فهم أفضل للتأثيرات الاجتماعية وكيفية إدارتها مع ذلك بالممارسة.
2
ممارسة المشروع
التحليل المسبق للمشروع
تشغيل المشروع
انشاء المشروع


#

يرون ان مخاطره الغلق البكر يفوق أهمية الفائدة الكامنة من عمل الدراسة
3
الحكومات
متخذي القرار
المطورون
المجتمعات


#

من خطوات عمليه تقييم التأثير الاجتماعي، ويتم بها تحديد الأهمية للتأثيرات الاجتماعية المعرفة إلى أولئك المتأثرين بها .
4
التخفيف
المراقبة
التغيير في البدائل
التنبؤ وتقييم ردود الأفعال على التأثيرات


#

من خطوات عمليه تقييم التأثير الاجتماعي، ويتم بها تطوير وتطبيق خطته بهدف التفادي أولا ، وثانيا للتقليل، وثالثا للتعويض عن الآثار المعاكسة
1
التخفيف
المراقبة
التغيير في البدائل
التنبؤ وتقييم ردود الأفعال على التأثيرات


#

من خطوات عمليه تقييم التأثير الاجتماعي، ويتم بها تمييز التأثيرات اللاحقة للمشروع المقترح، متضمنا الرتبة الثانية/ ثالثة للتأثيرات .
4
التخفيف
المراقبة
التغيير في البدائل
تقدير التأثيرات الغير مباشره والمتراكمة


#

تخضع عمليه تقييم الأثار البيئية للمشروعات ل
2
ثلاث مبادئ رئيسيه
أربعة مبادئ رئيسيه
ست مبادئ رئيسيه
عشرة مبادئ رئيسيه



#

استنادا الى مبادئ تقييم الأثار البيئية للمشروعات، تم تصنيف المشروع الى
1
ثلاث قوائم
أربعة قوائم
خمس قوائم
سبع قوائم


#

احدى تصنيفات المشروعات، وتضم المنشآت والمشروعات ذات التأثيرات البيئية الضئيلة
1
القائمة (أ)
القائمة (ب)
القائمة (ج)
القائمة السوداء



#

احدى تصنيفات المشروعات، وتضم المنشآت والمشروعات التي يمكن أن تحدث آثار بيئية مهمة
2
القائمة (أ)
القائمة (ب)
القائمة (ج)
القائمة السوداء


#

احدى تصنيفات المشروعات، وتضم المنشآت والمشروعات التي يمكن أن تحدث آثار بيئية خطيرة وتحتاج إلى دراسة بيئية متكاملة
3
القائمة (أ)
القائمة (ب)
القائمة (ج)
القائمة الرمادية


#

من مراحل تقييم الأثر البيئي، ويعرف الجمع المخطط والمنهجي للبيانات البيئية من اجل الوفاء بأهداف واحتياجات بيئية محددة
3
التخفيف
الوصف
الرصد البيئى
التقرير



#

من خطوات تقييم الأثر البيئي، يتولى جهاز شئون البيئة أو الفرع الإقليمي مراجعة وتقييم المستندات أو إبداء ملاحظاته وإرسالها إلى إدارة شئون البيئة بالمحافظة متضمنة الاقتراحات الممكنة لأجراء ما يلزم اتخاذها لضمان حماية البيئة وذلك خلال . . . . يوما من استلام المستندات كاملة
2
6
60
30
66


#

هو المسئول عن إدارة نظام تقييم الأثر البيئي ومراجعة الدراسات وتقديم الرأي والمشورة للجهات الإدارية المختصة
3
مقدمو المشروعات
معدو الدراسة
جهاز شئون البيئة
رئاسة المدينة الصناعية

`,pe=t=>{let[,s,e]=/^!\[(.*)\]\((.*)\)$/.exec(t)||[];return[!!e,s,e]},fe=de.split("#").map((t,s)=>{var d;let e=t.trim().split(`
`).filter(p=>p.trim().length>0),r=e.shift()||"failed to parse question",i=Number((d=e.shift())==null?void 0:d.trim()),[n,a,c]=pe(e[0]);n&&e.shift();const l=e.map((p,f)=>({id:m(),text:p,correct:f+1===i}));return g({questionText:r,answers:l,image:c,imageAlt:a})}),me=`

جودة الغذاء
1
هي تحقيق رغبات المستهلك في المنتج الغذائي

هي المحافظة على الجودة في مستوى قبولها لدى المستهلك

هي جميع الإجراءات المخططة والمنطقية اللازمة لتوفير الثقة المناسبة للمنتج لتلبية احتياجات محددة

#
مراقبة الجودة
1
هي المحافظة على الجودة في مستوى قبولها لدى المستهلك 
هي وثيقة تفصيلية للإجراءات العملية النوعية للجودة والموارد المخصصة لها وترتيب تسلسل أنشطتها لتحق يق جودة منتج معين
هي تسلسل مفهوم الجودة من خلال جميع الأشخاص والعمليات بالمصنع بدءا من الموردين إلى العملاء ونهاية بالمستهلك

#
سياسة الجودة
1
هي الشروط والتوجيهات التي تحددها المنشأة أو المؤسسة في مجال الجودة والمعدة مسبقا بواسطة الإدارة العليا
وهى تعنى الفحص الدوري المنتظم للوقوف على مدى الالتزام بأنشطة الجودة كما هو مخطط لها من ترتيبات وهل هذه الترتيبات تحقق الغرض منها
هي الشروط والتوجيهات التي تحددها المنشأة أو المؤسسة في مجال الجودة والمعدة مسبقا بواسطة الإدارة العليا

#
توكيد الجودة
1
هي جميع الإجراءات المخططة والمنطقية اللازمة لتوفير الثقة المناسبة للمنتج لتلبية احتياجات محددة
هي جميع الإجراءات اللازمة لإنتاج غذاء صحى غير ضار بصحة الإنسان
الهيئة المصرية العامة للمواصفات والجودة

#
خطة الجودة
1
هي وثيقة تفصيلية للإجراءات العملية النوعية للجودة والموارد المخصصة لها وترتيب تسلسل أنشطتها لتحقيق جودة منتج معين
لجنة دستور الغذاء 
هو التاريخ الذى يحدد نهاية فترة الصلاحية

#
نظام الجودة
1
هو الهيكل التنظيمي والمسئوليات والطرق والعمليات وإجراءات العمل والموارد المخصصة لتوضيح مسئوليات
هي تحقيق رغبات المستهلك في المنتج الغذائي
هي عملية اعتماد الشركة على أنها مطابقة لمتطلبات المواصفات الدولية حيث تمو الجهات المرخص لها بذا لك والمعتمدة من هيئة ال الجودة مط بق فعليا فتعتمد الشركة ويتم منحها شهادة تسمى بال شهادة الجودة (ISO) بتقييم الشركة للتأكد من أن نظام

#
المواصفة
1
هي وثيقة معتمدة لتطب يق اشتراطات وخصائص وأنواع لمنتج معين وهى تصدر لتحديد التعامل مع الأخرين 
هي تسلسل مفهوم الجودة من خلال جميع الأشخاص والعمليات بالمصنع بدءا من الموردين إلى العملاء ونهاية بالمستهلك
هو التاريخ الذى يحدد نهاية فترة الصلاحية

#
سلسلة الجودة
1
هي تسلسل مفهوم الجودة من خلال جميع الأشخاص والعمليات بالمصنع بدءا من الموردين إلى العملاء ونهاية بالمستهلك
هي جميع الإجراءات المخططة والمنطقية اللازمة لتوفير الثقة المناسبة للمنتج لتلبية احتياجات محددة
وهى تعنى الفحص الدوري المنتظم للوقوف على مدى الالتزام بأنشطة الجودة كما هو مخطط لها من ترتيبات وهل هذه الترتيبات تحقق الغرض منها

#
مراجعة الجودة
1
وهى تعنى الفحص الدوري المنتظم للوقوف على مدى الالتزام بأنشطة الجودة كما هو مخطط لها من ترتيبات وهل هذه الترتيبات حق الغرض منها
هي الوثيقة الأساسية المستخدمة للإرشاد والتطبيق لنظام إدارة الجودة وت صف هذه الوثيقة كل عناصر نظام الجودة الذى يحتاجه المشروع لتلبية احتياجات الجودة
هي جميع الإجراءات اللازمة لأنتاج غذاء صحى غير ضار بصحة الإنسان

#
ممارسة التصنيع الجيد
1
وهى وثيقة لوصف طريقة الصناعة القياسية وكيفية التحكم في ظروفها من حيث خطوات الصناعة، المصنع الآلات ، العمال ، الاختبارات المعملية في مصانع الأغذية لإنتاج غذاء آمن صحيا
هو وصول أي من الملوثات السابق ذكرها إلى الغذاء أو البيئة المحيطة بالغذاء
من نظم التشفير الخطى والأكثر شيوعا ويتم استخدامه في الدول الأوروبية وكثير من دول العالم كما أنه من المتبع في مصر

#
الاعتماد
1
هي عملية اعتماد الشركة على أنها مطابقة لمتطلبات المواصفات الدولية حيث تمو الجهات المرخص لها بذالك والمعتمدة من هيئة ال تسمى بال شهادة الجودة (ISO) بتقييم الشركة للتأكد من أن نظام الجودة مط بق فعليا فتعتمد الشركة ويتم منحها شهادة
هي وثيقة لنظام إدارة الجودة يوضح فيها احتياجات تدريب العاملين في المجالات التي تحتاج إلى مهارة معينة
هو التاريخ الذى يحدد نهاية فترة الصلاحية

#
دليل الجودة
2
هي وثيقة لنظام إدارة الجودة يوضح فيها احتياجات تدريب العاملين في المجالات التي تحتاج إلى مهارة معينة
هي الوثيقة الأساسية المستخدمة للإرشاد والتطبيق لنظام إدارة الجودة وتصف هذه الوثي قة كل عناصر نظام الجودة الذى يحتاجه المشروع لتلبية احتياجات الجودة
من نظم التشفير الخطى والأكثر شيوعا ويتم استخدامه في الدول الأوروبية وكثير من دول العالم كما أنه من المتبع في مصر

#
سجلات الجودة
3
هي وثي قة لنظام إدارة الجودة يوضح فيها احتياجات تدريب العاملين في المجالات التي تحتاج إلى مهارة معينة
هي وثيقة لنظام إدارة الجودة يوضح فيها احتياجات تدريب العاملين في المجالات التي تحتاج إلى مهارة معينة
هي سجلات مصممة لتوضيح نتائج الجودة المحددة للمنتج النهائي وأثناء التصنيع وللتحقق من التنفيذ الفعال لنظام إدارة الجودة كما توفر السجلات أيضآ وصول المنتج إلى المستوى المطلوب

#
وثائق التدريب
1
هى وثيقة لنظام إدارة الجودة يوضح فيها احتياجات تدريب العاملين في المجالات التي تحتاج إلى مهارة معينة
هو فعل لاستبعاد سبب عدم المطابقة الذى تم اكتشافه أو أي وضع غير مرغوب فيه
هي جميع الإجراءات المخططة والمنطقية اللازمة لتوفير الثقة المناسبة للمنتج لتلبية احتياجات محددة

#
غذاء أمن
3
هي جميع الإجراءات المخططة والمنطقية اللازمة لتوفير الثقة المناسبة للمنتج لتلبية احتياجات محددة 
هو وصول أي من الملوثات السابق ذكرها إلى الغذاء أو البيئة المحيطة بالغذاء 
هو الغذاء الخالي من الملوثات والمخاطر والذي لا يسبب أذى أو مرض للأنسان على المدى البعيد أو القريب وذالك بناء على نتائج تحاليل معملية وتجارب على الحيوانات

#
أمان الغذاء
3
هو وصول أي من الملوثات السابق ذكرها إلى الغذاء أو البيئة المحيطة بالغذاء
هو الغذاء الخالي من الملوثات والمخاطر والذى لا يسبب أذى أو مرض للأنسان على المدى البعيد أو القريب وذالك بناء على نتائج تحاليل معملية وتجارب على الحيوانات
هي جميع الإجراءات اللازمة لإنتاج غذاء صحى غير ضار بصحة الإنسان



#
تلوث الغذاء
1
هو وصول أي من الملوثات السابق ذكرها إلى الغذاء أو البيئة المحيطة بالغذاء
هو الغذاء الخالي من الملوثات والمخاطر والذى لا يسبب أذى أو مرض للأنسان على المدى البعيد أو القريب وذالك بناء على نتائج تحاليل معملية وتجارب على الحيوانات
هي جميع الإجراءات اللازمة لأنتاج غذاء صحى غير ضار بصحة الإنسان

#
فترة الصلاحية
1
هي فترة زمنية يحتفظف يها المنتج الغذائي بصفاته الأساسية ويظل حتى نهايتها مستساغا ومقبولا وصالحا للاستهلاك الآدمي وذلك تحت ظروف محددة للتعبئة والن قل والتخزين
هو التاريخ الذى يحدد نهاية فترة الصلاحية
هي جميع الإجراءات اللازمة لأنتاج غذاء صحى غير ضار بصحة الإنسان

#
تاريخ انتهاء الصلاحية
2
هي فترة زمنية يحتفظ فيها المنتج الغذائي بصفاته الأساسية ويظل حتى نهايتها مستساغا ومقبو لا وصالحا للاستهلاك الآدمي وذلك تحت ظروف محددة للتعبئة والنقل والتخزين
هو التاريخ الذى يحدد نهاية فترة الصلاحية
هو وصول أي من الملوثات السابق ذكرها إلى الغذاء أو البيئة المحيطة بالغذاء

#
مراكز الاتصال
3
لجنة دستور الغذاء 
الهيئة المصرية العامة للمواصفات والجودة
وتعتبر مراكز الاتصال أماكن جيدة لجمع المعلومات عن رضاء العملاء وكذالك عن العملاء المحتملين حيث يمكن سؤالهم عن احتياجاتهم وتوقعاتها
#

W. H. O اختصار ل
3
لجنة دستور الغذاء
وهى وثيقة لو صف طريقة الصناعة القياسية وكيفية التحكم في ظروفها من حيث خطوات الصناعة ، المصنع ، الآلات ، العمال ، الاختبارات المعملية في مصانع الأغذية لإنتاج غذاء آمن صحيا
منظمة الصحة العالمية
#
(E. O. S)
3
منظمة الصحة العالمية 
لجنة دستور الغذاء 
الهيئة المصرية العامة للمواصفات والجودة
#
اختصارل : (CODEX)
1
لجنة دستور الغذاء 
منظمة الصحة العالمية 
منظمة الصحة العالمية

#
النظام الأوروبي 13 – EAN
1
من نظم التشفير الخطى والأكثر شيوعا ويتم استخدامه في الدول الأوروبية وكثير من دول العالم كما أنه من المتبع في مصر
من نظم التشفير الدائري والأكثر شيوعا ويتم استخدامه في الدول الأوروبية وكثير من دولالعالم كما أنه من المتبع في مصر
من نظم التشفير المنقط والأكثر شيوعا ويتم استخدامه في الدول الأوروبية وكثير من دول العالم كما أنه من المتبع في مصر

#
الفعل التصحيحي
3
هو فعل التصحيح سبب عدم المطابقة الذى تم اكتشافه أو أي وضع غير مرغوب فيه
هو فعل القبول سبب عدم المطابقة الذى تم اكتشافه أو أيوضع غير مرغوب فيه
هو فعل لاستبعاد سبب عدم المطابقة الذى تم اكتشافه أو أي وضع غير مرغوب فيه

#
الرسم التوضيحي لدائرة . . . . 
3
![](a.png)
دميج 
مديج 
ديمنج 
جمديج

#
المربع واحد يدل على
1
![](b.png)
D
P
C
A

#
المربع الثاني يدل على
2
![](b.png)
D
P
C
A
#
المربع الثاني يدل على
3
![](b.png)
D
P
C
A
#
المربع الرابع يدل على
4
![](b.png)
D
P
C
A

#
يدل هذا الشكل على المعاملة الغذاء بواسطة 
3
![](c.png)
البسترة
التعميم
الإشعاع
الكيماوي

#
هي اختصار EAN ال
1
European Article Number ل 
EGYPT Article Number ل 
Euro Article Number ل 
Epean Article Number ل 



#
رقم 13 تعنى أنه مكون من 13 رقم مقسمة إلى . . . . مجموعات
2
5 مجموعات
4 مجموعات
6 مجموعات
2 مجموعات

#
أول ثلاثة أرقام على الشمال تمثل كود
1
كود البلد
كود المصنع
كود المنطقة
كود المنتج

#
الأربعة أرقام التالية تمثل كود
2
كود البلد
كود المصنع
كود المنطقة
كود المنتج
#
الخمسة أرقام التالية تمثل كود
4
كود البلد
كود المصنع
كود المنطقة
كود المنتج
#
أخر رقم يعبر عن كود
4
كود البلد
كود المصنع
كود المراجعة
كود المنتج

#
توكيد الجودة
1
نظام إدارة بيروقراطي
نظام إدارة ديموقراطى
نظام إدارة رأس مالي




#
توكيد الجودة
1
إجراءات غير مرنة
إجراءات مرنة
إجراءات متوازنة

#
الإدارة الشاملة للجودة
2
إجراءات غير مرنة
إجراءات مرنة
إجراءات متوازنة.

#
الإدارة الشاملة للجودة
1
يهتم بالتحسين المستمر
لا يهتم بالتحسين المستمر
مطلوب بدرجة متوسطة بالتحسين المستمر
#
توكيد الجودة
2
يهتم بالتحسين المستمر
لا يهتم بالتحسين المستمر
مطلوب بدرجة متوسطة بالتحسين المستمر

#
الإدارة الشاملة للجودة
2
نظام إدارة بيروقراطي
نظام إدارة ديموقراطى
نظام إدارة رأس مالي

#
الباركود للمنتجات الغذائية في مصر هو
1
622
633
366
362

#
استخدام مصطلح "حلال" لا يطلق على
1
الضفادع
السمن
الرنجة
لحوم الماعز



#
هيئة الأيزو هي وكالة متخصصة في التقييس مقرها
2
مصر
جنيف
كوبا
أمريكا

#
تتكون لجنة دستور الأغذية من
1
اللجنة التنفيذية: تتكون من رئيس اللجنة ونواب الرئيس الثلاثة ، 6 أعضاء تنتخبهم اللجنة من بين أعضائها
اللجنة التنفيذية: تتكون من رئيس اللجنة ونواب الرئيس الاثنين ، 4 أعضاء تنتخبهم اللجنة من بين أعضائها
اللجنة التنفيذية: تتكون من رئيس اللجنة ونواب الرئيس الثلاثة، 8 أعضاء تنتخبهم اللجنة من بين أعضائها

#
عند استعمال الترتيب الأبجدي يتبع الترتيب التالي
1
أبجد هوز حطي كلمن سعفص قرشت ثخد ضظغ
أبجد هوز حطي كلمن
سعفص قرشت ثخد ضظغ
#
Monitoring الرصيد: 
1
هو تنفيذ مجموعة مخططة من الملاحظات أو القياسات للتأكد من أن مقاييس التحكم تعمل كما هو مخطط لها
هى رسم تخطيطي منهجي يمثل تتابع وانسياب خطوات الصناعة
الموجودة في خطة الهاسب Control measures هي الدليل المتحصل عليه على "سلامة الغذاء" والذى يدل على أن مقاييس التحكم 


`,he=t=>{let[,s,e]=/^!\[(.*)\]\((.*)\)$/.exec(t)||[];return[!!e,s,e]},ge=me.split("#").map((t,s)=>{var d;let e=t.trim().split(`
`).filter(p=>p.trim().length>0),r=e.shift()||"failed to parse question",i=Number((d=e.shift())==null?void 0:d.trim()),[n,a,c]=he(e[0]);n&&e.shift();const l=e.map((p,f)=>({id:m(),text:p,correct:f+1===i}));return g({questionText:r,answers:l,image:c,imageAlt:a})}),xe=`

الحوادث المتعلقة بسلامة الغذاء قد ترجع الي
3
تلوث المواد الخام
عدم مراعاة الاشتراطات الصحية أثناء الأعداد والتجهيز
جميع ما سبق


#
تشير المخاطر الكيميائية لسلامة الغذاء الي
3
بقايا مواد التنظيف والتطهير
المبيدات الحشرية
جميع ما سبق


#
تلوث الغذاء هو
1
وصول أي من الملوثات إلى الغذاء أو البيئة المحيطة بالغذاء
وجود عيوب ظاهرية بالغذاء
أي تغير يحدث في الغذاء يؤثر علي خواصه


#
يحدد من المسئول عن عملية التنظيف والتطهير ومدي تكراريتها والمواد المستخدمة
1
برنامج التنظيف والتطهير
السياسة الصحية
دليل الجودة


#
من وسائل مكافحة الحشرات الطائرة داخل مصانع الأغذية
2
الصواعق الكهربائية
المصائد الضوئية
مساحق التعفير


#
نظام تحليل المخاطر ونقاط التحكم الحرجة هو
1
نظام وقائي ورقابي لتأكيد سلامة الغذاء
نظام لإدارة الجودة الشاملة
جميع ما سبق


#
يتكون فريق سلامة الغذاء من
4
إدارة الجودة
إدارة الإنتاج
إدارة الصيانة
جميع ما سبق




#
من البرامج التمهيدية لسلامة الغذاء
3
التنظيف والتطهير
مكافحة الآفات
جميع ما سبق


#
يعتبر وجود قطع زجاج أو أشياء غريبة في الغذاء من مصادر الخطر
1
الفيزيائية
البيولوجية
الكيميائية


#
من البرامج الأولية المتعلقة بالتشريعات الخاصة بنظام الهاسب والتي يجب تطويرها بالمنشأة قبل تطبيق نظام الهاسب بها وهي
4
إجراءات تتعلق بالمنشأة وإجراءات مراقبة الموردين
إجراءات المواصفات القياسية للمنتجات وإجراءات تنظيف معدات الإنتاج
إجراءات التنظيف والتطهير للمنشاة وإجراءاته الشؤون الصحية للأفراد
جميع ما سبق


#
يجب أن تلتزم إدارة الشركة باتخاذ كل الاحتياطيات اللازمة للتأكد من تطبيق العناصر الأتية لبرنامج الممارسات الشخصية الجيدة
4
السيطرة على الأمرا ض
الاعتبارات الصحية الشخصية
الملابس والالتهابات والأربطة المفتوحة
جميع ما سبق


#
يجب أن تكون الأرضيات في صالات الإنتاج
4
من مواد غير سامة وغير ممتصة ومن النوع المقاوم للماء
في حالة جيدة وذات ميل تجاه بالوعات الصرف
المواد المستخدمة في وصلات الأرضيات غير منفذة
جميع ما سبق


#
	مناطق الإنتاج التي يتم بها تجهيز منتجات الأغذية عالية الخطورة يجب أن تكون ذات
1
ضغط إيجابي
ضغط سلبي
منخفضة الضغط
جميع ما سبق خطأ






#
الخواص الواجب توافرها في مواد التنظيف المستخدمة في مصانع الأغذية
3
سهلة الامتزاج بالماء
لها قدرة علي استحلاب الدهون
جميع ما سبق


#
العوامل التي تحدد اختيار مادة التنظيف في مصانع الأغذية
3
نوعيه المياه المستخدمة
نوع نظام التنظيف المستخدم
جميع ما سبق


#
نظام تنظيف يتم من خلاله عمل دورة مغلقة لمحاليل التنظيف والتطهير دون تفكيك خطوط الإنتاج
1
CIP
COP
SOP


#
للتحقق من كفاءة تنظيف وتطهير الأسطح يتم
3
اخد مسحة من السطح وتحليلها ميكروبيولوجيا
الكشف عن المواد العضوية المتبقيةاخد مسحة من السطح وتحليلها ميكروبيولوجيا
جميع ما سبق


#
في مناطق التخزين يجب أن تكون هناك مسافة . . . . سم بين الرف السفلي والأرضيات
2
100 سم
15 سم
يمكن التخزين علي الأرضيات مباشرة


#
اشتراطات يجب تطبيقها على العاملين في التصنيع الغذائي
3
تغطية الشعر بغطاء راس - لا يسمح باستخدام طلاء الأظافر
عدم ارتداء أي مجوهرات أو إكسسوارات
جميع ما سبق


#
يجب أن تتوافر مع المواد الكيميائية المستخدمة في عمليات التنظيف
1
(MSDS) بطاقة المادة الكيميائية
موافقة وزارة الصحة
جميع ما سبق


#
يجب تدوير المخزون في مخازن الأغذية علي أساس
3
ما تم تخزينه أولاً يتم إخراجه أولا
الأقرب في انتهاء فترة الصلاحية يخرج أولا
Aاو B يمكن استخدام



#
من الاشتراطات الأساسية لغرف التبريد والتجميد ما يلى
4
-18م) ≥مؤشرات بيان درجة الحرارة ظاهرة ( التبريد +1:+4م /التجميد   
توافر ستائر بلاستيك على الأبواب من الداخل لعدم تسريب درجة التبريد أثناء فتح الأبواب
توافر سُترات واقية من البرد للعاملين
جميع ما سبق


#
يجب أن يترك حول المحيط الداخلي لكل مخزن مسافة . . . . سم ويطلق على هذه المسافة خط محيط التفتيش
1
50
100
150
25


#
عبارة عن إزالة لأسباب التلوث المرئية
1
التنظيف
التطهير
التعقيم
التهوية


#
يحدد جدول التنظيف والتطهير في المنشآت الغذائية
4
مكان التنظيف ومن المسئول
مواد التنظيف والتطهير
معدل التنظيف والتطهير
جميع ما سبق


#
تقوم مراقبة المخازن بالتفتيش على المخازن للتأكد من
4
وجود كارت التعريف ( كارت الصنف) علي الأصناف بالمخازن طبقا لنوعها
اكتشاف أي تلف أو تدهور بالمخزون
متابعة وضع المنتجات في مكانها المخصص
جميع ما سبق


#
هو الحالة المرضية التي تحث نتيجة تناول غذاء إما لكونه ملوثا بالميكروبات الممرضة أو نواتجها السامة أو نتيجة تناول ملوثات كيميائية
1
تسمم الغذاء
فساد الغذاء
انخفاض جودة الغذاء
جميع ما سبق




#
الحوادث المتعلقة بسلامة الأغذية على المستوي العالمي لوجود مصادر خطر بيولوجية أو كيميائية أو طبيعية ترجع الي واحد أو أكثر من العوامل التالية
4
تلوث المواد الخام
عدم مراعاة الاشتراطات الصحية في عمليات التجهيز، التصنيع، التعبئة، التخزين والنقل
التلوث من الأسطح غير النظيفة الملامسة للغذاء وعدم كفاءة برامج التنظيف والتطهير
جميع ما سبق


#
مكونات طبيعية تض ر بصحة الإنسان مثل أجزاء الحشرات أو مخلفات الإنسان )كالشعر( أو المجوهرات، أو خشب، أو حصى، أو شظايا معدنية، أو قطع زجاج . . . . إلخ
1
مصادر خطر فيزيائية
مصادر خطر كيميائية
مصادر خطر بيولوجية
مصادر خطر إشعاعية


#
مواد كيميائية تضر بصحة الإنسان مثل بقايا المبيدات والأسمدة ومواد التنظيف والتطهير والشحوم والمواد المضافة أو الحافظة وبقايا المضادات الحيوية والأدوية البيطرية . . . . إلخ
2
مصادر خطر فيزيائية
مصادر خطر كيميائية
مصادر خطر بيولوجية
مصادر خطر إشعاعية


#
كائنات حية ممرضة أو منتجة للسموم وتشمل البكتريا والفطريات والفيروسات والطفيليات وغيرها . . . . إلخ
3
مصادر خطر فيزيائية
مصادر خطر كيميائية
مصادر خطر بيولوجية
مصادر خطر إشعاعية


#
إجراء أو نشاط أو فعل يمكن استخدامه لمنع أو إزالة مخاطر سلامه الغذاء أو خفضها الى المستوي المقبول
1
اجراء سيطرة
الحد الحرج
نقطة تحكم حرجة
إجراء تصحيحي


#
مستوي مخاطر سلامة الغذاء والذي يجب ألا يتم تجاوزه في المنتج النهائي
1
المستوي المقبول
الحد الحرج
نقطة تحكم حرجة
إجراء السيطرة


#
وجود عامل بيولوجي أو كيميائي أو فيزيائي بالغذاء (أو يتعلق بالغذاء ) ويمكن أن يسبب تأثير ضار بصحة الإنسان(بما فيها الحساسية)
1
مصدر خطر
نقطة تحكم حرجة
حد حرج


#
والتي تفصل بين ما هو مقبول وغير مقبول  Measurable value القيمة القابلة للقياس
1
الحد الحرج
المستوي المقبول
نقطة تحكم حرجة
الإجراءات القياسية للتشغيل


#
الحد الحرج لعمليه التبريد
2
15 م
4 م
10 م
25 م



#

يحدث التلوث العرضى من
4

غذاء الى غذاء اخر
المعدات الى الغذاء
الاشخاص الى الغذاء
جميع ما سبق


#

تعتبر الافلاتوكسين
3

مخاطركميائية
مخاطر فيزيائية
مخاطر بيولوجية 
مسببات حساسية 


#

اى مما يلى يعتبر حد حرج
4

تنظيف منطقة اعداد الاغذية 
غسيل الفواكه
فحص وفرز الخضروات
الطهى الى درجة 70ْ م لمدة دقيقتين





#

يمكن تقسيم المخاطر سلامة الغذاء الى
4

بيولوجية , كميائية , معدانية
بيولوجية , فيزيائية , مسببات حساسية
بيولوجية , معدانية, مسببات حساسية
بيولوجية , كميائية , فيزيائية , مسببات حساسية


#

ترتبط سلامة الغذاء بحماية المستهلك من 
3

الغش والتدليس
ارتفاع الاسعار
المخاطر البيولوجية
جميع ما سبق


#

اى من المعايير  التالية لا يمكن اعتبار حد حرج عند انشاء خطة الهاسب
4

PH
درجة الحرارة 
نسبة اضافة مادة حافظة
التقييم الحسى


#

الخطوات الاساسية لنظام الهاسب . . . . خطوات
1
7
5
10
12


#

المبدا الثالث من مبادئ نظام الهاسب الاساسية
3

تحليل المخاطر
CCPs تحديد
وضع الحدود الحرج
التحقق


#

الاجراءات التى يجب اتباعها عند حدوث انحرافات تهدد سلامة الغذاء
2

المتابعة
الاجراءات التصحيحية
التحقق
الاجراءات الوقائية






#

تعد الاختبارات الميكروبيولوجية التى تجرى على نقاط مختليفة من التصنيع مثالا على
2

الاجراءات التصحيحية
التحقق
الحدود الحرج
تحليل المخاطر


#

يتطلب نظام تحليل المخاطر ونقاط التحكم الحرجة
4

التزام ودعم الادارة 
مشاركة جميع العاملين 
فريق متعدد التخصصات 
جميع ما سبق


#

تسلسل مراحل انتاج وتجهيز وتوزيع وتخزين ومعالجة الاغذية ومكوناتها بدءا من الانتاج الاولى وحتى الاستهلاك
2

سلسلة الامداد
سلسلة الغذائية 
مخطط العمليات 
خطة المراجعة 


#

يطلق على الخطوة التصنيعية والتى يمكن فيها تطبيق اجراءت النحكم الضرورى لمنع او تقليل خطر معنوى على سلامة الغذاء الى المستوى المقبول كذلك لا يوجد خطوة لاحقة لمنع او تقليل هذا الخطر
1

CCP
CP
CPRP
POA


#

يجب ان تتوافر فى وحدات غسيل الايدى فى مصانع الاغذية 
4

مصدر ماء ساخن
الصابون 
المطهر 
جميع ما سبق


#

نظام لتجديد وتقييم والتحكم فى المخاطر التى تهدد سلامة الاغذية بهدف انتاج غذاء امن صحيأ
1

HACCP
ISO 9001
ISO 14001
ISO45001
 

`,be=t=>{let[,s,e]=/^!\[(.*)\]\((.*)\)$/.exec(t)||[];return[!!e,s,e]},we=xe.split("#").map((t,s)=>{var d;let e=t.trim().split(`
`).filter(p=>p.trim().length>0),r=e.shift()||"failed to parse question",i=Number((d=e.shift())==null?void 0:d.trim()),[n,a,c]=be(e[0]);n&&e.shift();const l=e.map((p,f)=>({id:m(),text:p,correct:f+1===i}));return g({questionText:r,answers:l,image:c,imageAlt:a})}),Q={"إرشاد زراعي":X,"إدارة جودة — 1":ge,"إدارة جودة — 2":we,"تجارة دولية — 1":re,"تجارة دولية — 2":ae,"سياسة رزاعية — 1":Y,"سياسة رزاعية — 2":te,"تقييم مشروعات — 1":ue,"تقييم مشروعات — 2":fe},ve=()=>{},C=u.createContext(Q),A=u.createContext([]),w=u.createContext(()=>{}),x=u.createContext($),v=u.createContext(ve),je=({children:t})=>{const[s,e]=u.useState($),[r,i]=u.useReducer(V,[]);return o.jsx(v.Provider,{value:e,children:o.jsx(w.Provider,{value:i,children:o.jsx(C.Provider,{value:Q,children:o.jsx(x.Provider,{value:s,children:o.jsx(A.Provider,{value:r,children:t})})})})})},ye=""+new URL("burger.svg",import.meta.url).href;async function Ce(){let t="https://icsltn2qastore.table.core.windows.net/?sv=2022-11-02&ss=t&srt=sco&sp=rwdlacu&se=2123-05-17T10:14:54Z&st=2023-05-17T02:14:54Z&spr=https&sig=D1FbXTuBcFKeEJ5lUw14FlIFRb4kl2C84uU9c90aqEA%3D",s="BlobEndpoint=https://icsltn2qastore.blob.core.windows.net/;QueueEndpoint=https://icsltn2qastore.queue.core.windows.net/;FileEndpoint=https://icsltn2qastore.file.core.windows.net/;TableEndpoint=https://icsltn2qastore.table.core.windows.net/;SharedAccessSignature=sv=2022-11-02&ss=bfqt&srt=sco&sp=rwdlacupiytfx&se=2023-06-18T00:28:14Z&st=2023-05-17T16:28:14Z&spr=https,http&sig=%2F0%2FcHEiRTcKSwpRtQnKsy0mTf3sL%2BXuDwEc90ZL%2BpEo%3D";await D.fromConnectionString(s,{}).createTable("test");const r=new k(t,"test"),i={partitionKey:"hometasks",rowKey:"1",description:"take out the trash",dueDate:new Date(2015,6,20)};let n=await r.createEntity(i);console.log(n)}function Ae(){const t=u.useContext(x),s=u.useContext(v);function e(){s({...t,sidebarOn:!t.sidebarOn})}return o.jsxs("div",{className:"burger-btn sticky top-0 min-h-[50px] px-4 flex items-center justify-between bg-green-700 ",children:[o.jsx("div",{children:o.jsx("img",{className:"cursor-pointer",onClick:e,src:ye,alt:"Menu"})}),o.jsx("div",{onClick:()=>{Ce()},className:"text-slate-200 border-double border-b-4 text-xl cursor-pointer",children:t.subject}),o.jsx("div",{})]})}function Ie(){const t=u.useContext(x),s=u.useContext(A),e=u.useContext(w),r=t.testModeOn&&t.correctAnswers,i=u.useMemo(()=>t.testModeOn?(console.log("calculating..."),s.reduce((n,a)=>n+(a.correct?1:0),0)):0,[s]);return o.jsxs("div",{className:`bottombar ${r?"":"none"}`,children:[o.jsxs("div",{className:"score",children:[o.jsx("span",{className:"score__label",children:"Score: "}),o.jsxs("span",{className:"score__value",children:[i,"/",s.length]})]}),o.jsx("div",{className:"actions",children:o.jsx("button",{className:"",onClick:()=>e(O()),children:"مسح الإجابات"})})]})}const b={};function Ne(t,s,e=!0,r=100){u.useDebugValue(b);const[i,n]=u.useState(!1),a=l=>{var d;return(b[t]={...b[t],captured:l??((d=b[t])==null?void 0:d.captured)??!1}).captured};return i||a()||(s&&!e&&s(),!b[t].skip&&(s&&e&&s(),n(()=>a(!0)),setTimeout(()=>n(!1),r))),!i&&a()&&a(!1),[i,()=>t in b?b[t].skip=!0:!1]}const Se=(t=35)=>("vibrate"in navigator&&navigator.vibrate(t),!0);function Pe({id:t,index:s,question:e,answers:r}){const i=u.useContext(v),n=u.useContext(x),a=l=>{i({...n,unbluredQuestion:l}),Se()},[c]=Ne(t,()=>"",!0,300);return o.jsxs("div",{className:"quest-container",children:[o.jsxs("h2",{className:`quest-text ${c&&"bg-slate-600"||""}`,children:[o.jsx("span",{className:"quest-span",children:s}),e]}),o.jsxs("div",{className:"quest-answers",children:[n.unbluredQuestion!==t&&n.blurAnswers&&!n.testModeOn&&o.jsx("div",{className:"blur",onDoubleClick:()=>a(t)}),r]})]})}const qe=u.memo(Pe),N=(t=35)=>("vibrate"in navigator&&navigator.vibrate(t),!0);function Oe({question:t}){const s=u.useContext(x),e=u.useContext(w),r=f=>{if(!s.testModeOn)return console.log("testMode is off");if(s.correctAnswers&&t.selectedId)return N(60);e(q(t.id,f)),N()},i="bg-amber-700",n="bg-green-700",a="bg-red-700",c="bg-slate-800";function l(f){return s.testModeOn?s.correctAnswers?t.selectedId?f.selected?f.correct?n:a:f.correct?n:c:c:f.selected?i:c:f.correct?n:c}function d(f){return"answers"in f}const p=d(t)?t.answers:[t.answer];return o.jsx(o.Fragment,{children:p.map((f,I)=>f?o.jsxs("div",{className:`quest-answer ${l(f)}`,children:[o.jsx("input",{type:"radio",onClick:Ke=>r(f.id),name:"answer",id:`answer${t.id}${I}`,className:"hidden"}),o.jsx("label",{htmlFor:`answer${t.id}${I}`,className:"quest-answerlable p-2",children:f.text})]},f.id):"")})}function $e({question:t,index:s}){const e=Oe({question:t}),r=o.jsxs(o.Fragment,{children:[o.jsx("span",{children:t.questionText}),t.image&&o.jsx("img",{src:"./assets/"+t.image,alt:t.imageAlt,className:"quest-image w-full h-auto my-2 "})]}),i={id:t.id,index:s,question:r,answers:e};return o.jsx(qe,{...i})}function Qe({questPanel:t}){const s=u.useContext(A),e=u.useContext(x),r=u.useContext(v),i=u.useContext(C),n=u.useContext(w);return u.useEffect(()=>{if(!s.length){let a="إرشاد زراعي";r({...e,sidebarOn:!1,subject:a,questions:i[a]}),n(y(i[a],e.shuffleQuestions))}},[]),o.jsxs("div",{ref:t,className:"questions p-4 flex-1 overflow-y-auto",children:[s==null?void 0:s.map((a,c)=>o.jsxs("div",{children:[o.jsx($e,{question:a,index:c+1}),o.jsx("br",{})]},a.id)),o.jsx(Te,{questPanel:t})]})}function Te({questPanel:t}){const s=u.useContext(x),e=s.testModeOn&&s.correctAnswers?"raise":"",r=s.sidebarOn?"none":"",[i,n]=u.useState("");return o.jsx("div",{className:`scroll-top ${e} ${r} ${i}`,onClick:()=>{var a;return(a=t.current)==null?void 0:a.scrollTo({top:0,behavior:"smooth"})},onPointerMoveCapture:()=>n("hover"),onPointerDownCapture:()=>n("hover"),onPointerOutCapture:()=>n(""),onPointerUp:()=>n("")})}function Ee({defaultValue:t=!1,enabled:s=!0,onChange:e,setToggle:r,...i}){const n=u.useId(),a=u.useRef(null),c=d=>{var p;return e?e(((p=d.target)==null?void 0:p.checked)||!1):null};return r&&r(()=>{var d;return(d=a.current)==null?void 0:d.click()}),o.jsxs("label",{style:{},htmlFor:n,className:`toggle-switch ${s?"":"disabled"}`,children:[o.jsx("input",{id:n,ref:a,type:"checkbox",onChange:c,disabled:!s,onClick:d=>d.stopPropagation(),defaultChecked:t,...i}),o.jsx("span",{className:"slider"})]})}function Me({questPanel:t}){const s=u.useContext(x),e=u.useContext(v),r=u.useContext(C),i=u.useContext(w),{sidebarOn:n}=s,a=(c,l)=>{var d;switch(c){case"selectedSubject":return(d=t.current)==null||d.scrollTo({top:0,behavior:"smooth"}),e({...s,sidebarOn:!1,subject:l,questions:r[l]}),i(y(r[l],s.shuffleQuestions));case"testModeOn":return e({...s,testModeOn:l});case"correctAnswers":return e({...s,correctAnswers:l});case"blurAnswers":return e({...s,blurAnswers:l});case"shuffleQuestions":return e({...s,shuffleQuestions:l}),i(P([...r[s.subject]],l));case"shuffleAnswers":return e({...s,shuffleAnswers:l});default:return}};return o.jsxs("div",{className:"absolutez",children:[o.jsxs("nav",{onClick:c=>c.stopPropagation(),className:`${n?"":"off"} sidebar`,children:[o.jsxs("div",{className:"subjects",children:[o.jsx("h2",{className:"title",children:"البنك"}),o.jsx("div",{className:"sep"}),Object.keys(r).map(c=>o.jsx("div",{className:`item ${s.subject===c?"active":""}`,onClick:()=>a("selectedSubject",c),children:c},c))]}),o.jsxs("div",{className:"settings",children:[o.jsx("div",{className:"sep"}),o.jsx("div",{className:"title",children:"الاعدادات"}),o.jsx("div",{className:"sep"}),o.jsx(j,{title:"وضع الإختبار",defaultValue:s.testModeOn,action:c=>a("testModeOn",c)}),o.jsx(j,{title:"تصحيح الإجابات",enabled:s.testModeOn,defaultValue:s.correctAnswers,action:c=>a("correctAnswers",c)}),o.jsx("p",{}),o.jsx(j,{title:"تغشية الإجابات",enabled:!s.testModeOn,defaultValue:s.blurAnswers,action:c=>a("blurAnswers",c)}),o.jsx(j,{title:"مزج الأسئلة",defaultValue:s.shuffleQuestions,action:c=>a("shuffleQuestions",c)})]}),o.jsxs("div",{className:"credits",children:[o.jsx("div",{className:"sep"}),o.jsx("div",{className:"title",children:"الحقوق"}),o.jsx("div",{className:"sep"}),o.jsx("div",{className:"item",children:"motifyee@gmail.com"}),o.jsx("div",{className:"item",children:"م/ مليك روماني"})]})]}),o.jsx("div",{onPointerMove:c=>c.stopPropagation(),onPointerDownCapture:c=>c.stopPropagation(),onPointerDown:c=>c.stopPropagation(),onClick:()=>e({...s,sidebarOn:!1}),className:`${n?"":"off"} sidebar-overlay`})]})}function j({title:t,defaultValue:s,action:e,enabled:r=!0}){let i=()=>{};const n=a=>i=a;return o.jsxs("div",{onClick:a=>{a.preventDefault(),i()},className:"flex justify-between items-center item",children:[o.jsx("div",{className:`${r?"":"text-gray-500 xline-through"}`,children:t}),o.jsx(Ee,{defaultValue:s,enabled:r,onChange:e,setToggle:n})]})}const De=F({apiKey:"AIzaSyBWmWIAPvA97sn2RpVx0mfTBmCcgX-98o4",authDomain:"fir-computers-ip.firebaseapp.com",databaseURL:"https://fir-computers-ip.firebaseio.com",projectId:"fir-computers-ip",storageBucket:"fir-computers-ip.appspot.com",messagingSenderId:"369476238484",appId:"1:369476238484:web:f214ed67d25cdb30178881",measurementId:"G-05Z9EBZ84Z"}),T=R(De),E="agri-asu.web.app";S(T,E);const ke=async t=>(console.log("addFirebaseAction:"),console.table(t),await _(S(T,E),{date:L(),...t}));let Be=Fe();localStorage.getItem("install-date")||localStorage.setItem("install-date",new Date().toISOString());function Fe(){return localStorage.getItem("user")||""}async function Re(){return await fetch("https://api.ipify.org").then(t=>t.text())}async function _e(t,s){if(Be=="admin")return;console.log("saveAction",t,s);let e=await ke({action:t||"DEFAULT",value:s||"",deviceInfo:await Ue()});return console.log("saveAction",e),e}function Le(){return{width:window.screen.width,height:window.screen.height,availWidth:window.screen.availWidth,availHeight:window.screen.availHeight,colorDepth:window.screen.colorDepth,pixelDepth:window.screen.pixelDepth,orientation:{angle:window.screen.orientation.angle,type:window.screen.orientation.type}}}async function Ue(){let t=new B().parse(navigator.userAgent),s=Le(),e=await Re(),r=He();return{ip:e,screen:s,detector:t,deviceId:r}}function He(){let t=localStorage.getItem("machineId");return t||(t=m(),localStorage.setItem("machineId",t)),t}function Ze(){const t=u.useRef(null);return u.useEffect(()=>{window.location.href.includes("http://localhost")||_e()},[]),o.jsxs(je,{children:[o.jsx(Ae,{}),o.jsx(Me,{questPanel:t}),o.jsx(Qe,{questPanel:t}),o.jsx(Ie,{})]})}const Ge=document.getElementById("root");M.createRoot(Ge).render(o.jsx(Ze,{}));
